
<!DOCTYPE html>
<!--[if IEMobile 7 ]><html class="no-js iem7"><![endif]-->
<!--[if lt IE 9]><html class="no-js lte-ie8"><![endif]-->
<!--[if (gt IE 8)|(gt IEMobile 7)|!(IEMobile)|!(IE)]><!--><html class="no-js" lang="en"><!--<![endif]-->
<head>
  <meta charset="utf-8">
  <title>Nome do Jogo</title>
  <meta name="author" content="Carlos Brando">
  

  <!-- http://t.co/dKP3o1e -->
  <meta name="HandheldFriendly" content="True">
  <meta name="MobileOptimized" content="320">
  <meta name="viewport" content="width=device-width, initial-scale=1">

  
  
    <link rel="canonical" href="http://nomedojogo.com/page/81/">
  <link href="/favicon.png" rel="shortcut icon" />
  <link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
  <script src="/javascripts/modernizr-2.0.js"></script>
  <script src="http://s3.amazonaws.com/ender-js/jeesh.min.js"></script>
  <script src="/javascripts/octopress.js" type="text/javascript"></script>
  <link href="http://feeds2.feedburner.com/NomeDoJogo" rel="alternate" title="Nome do Jogo" type="application/atom+xml"/>
  <!--Fonts from Google's Web font directory at http://google.com/webfonts -->
<link href='http://fonts.googleapis.com/css?family=PT+Serif:regular,italic,bold,bolditalic' rel='stylesheet' type='text/css'>
<link href='http://fonts.googleapis.com/css?family=PT+Sans:regular,italic,bold,bolditalic' rel='stylesheet' type='text/css'>

</head>

<body  >
  <header><hgroup>
  <h1><a href="/">Nome do Jogo</a></h1>
  
    <h2>por Carlos Brando</h2>
  
</hgroup>

</header>
  <nav role=navigation><ul role=subscription data-subscription="rss">
  <li><a href="http://feeds2.feedburner.com/NomeDoJogo" rel="subscribe-rss" title="assine via RSS">RSS</a></li>
  
</ul>
<form action="http://google.com/search" method="get">
  <fieldset role="site-search">
    <input type="hidden" name="q" value="site:nomedojogo.com" />
    <input class="search" type="text" name="q" results="0" placeholder="Pesquisar"/>
  </fieldset>
</form>
<ul role=main-navigation>
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Arquivo</a></li>
</ul>

</nav>
  <div id="main">
    <div id="content">
      <div class="blog-index">



  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/14/11-dicas-para-melhorar-suas-senhas/">11 dicas para aumentar a segurança de suas senhas</a></h1>
    
    
      <p class="meta">





  



<time datetime="2007-03-14T00:00:00-03:00" pubdate  data-updated="true" >14 de Março de 2007</time></p>
    
  </header>


  <div class="entry-content"><div style="width: 63px; margin: 4px 40px 4px 10px; float: left;">
<script language="JavaScript" src="http://rec6.via6.com/link.php?action=widget&url=http://www.nomedojogo.dreamhosters.com/2007/03/14/11-dicas-para-melhorar-suas-senhas/" type="text/javascript"></script>
</div>


<p><img align="right" src="http://old.nomedojogo.com/wp-content/uploads/2007/03/securelock.jpg" alt="Senha" title="Senha" />Onze dicas para aumentar a seguran&ccedil;a de suas senhas pessoais.</p>

<ol>
    <li>Trate suas senhas como voc&ecirc; trata suas roupas intimas. Troque frequentemente e n&atilde;o deixa a vista.</li>
    <li>Nunca envie sua senha para um amigo ou familiar pela internet.</li>
    <li>Uma boa senha n&atilde;o pode ser encontrada em nenhum dicion&aacute;rio, de nenhuma l&iacute;ngua.</li>
    <li>Nunca use nomes e data com significado em suas senhas.</li>
    <li>Se voc&ecirc; tem uma senha padr&atilde;o para todas as coisas, mude imediatamente.</li>
    <li>Nunca use a mesma senha para tudo. Use sempre uma senha diferente.</li>
    <li>Use programas de armazenamento de senha com uma senha longa (+ de 20 caracteres) para guardar suas senhas.</li>
    <li>Quanto maior a senha, melhor.</li>
    <li>Senhas devem conter letras, n&uacute;mero e s&iacute;mbolos, em mai&uacute;sculo e min&uacute;sculo.</li>
    <li>Use geradores de senhas.</li>
    <li>Nunca anote uma senha.</li>
</ol>


<p>Via <a target="_blank" href="http://www.dailycupoftech.com/11-password-tips/">Daily Cup of Tech</a></p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/13/concorrente-do-delicious-em-portugues/">Concorrente do del.icio.us em português</a></h1>
    
    
      <p class="meta">





  



<time datetime="2007-03-13T00:00:00-03:00" pubdate  data-updated="true" >13 de Março de 2007</time></p>
    
  </header>


  <div class="entry-content"><p>O site <a target="_blank" href="http://simpy.com/">Simpy</a>, ganhou uma tradu&ccedil;&atilde;o para o portugu&ecirc;s. N&atilde;o sei se pega, mas gosto de ter variedades para brincar, e isto estimula a melhoria dos servi&ccedil;os.</p>

<blockquote>Simpy &eacute; uma ferramenta social de favoritos, um servi&ccedil;o que permite a voc&ecirc; salvar, classificar (tag) e buscar seus favoritos e anota&ccedil;&otilde;es ou navegar e buscar por links e tags de outros usu&aacute;rios. Voc&ecirc; pode revelar e compartilhar seus links com outros, ou mant&ecirc;-los privados. Simpy tamb&eacute;m ajuda voc&ecirc; a encontrar pessoas com as mesmas afinidades, descobrir sites novos e interessantes, publicar seus favoritos, detectar e eliminar links desatualizados, etc.</blockquote>

</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/13/a-mente-de-uma-pessoa-que-sofre-de-anorexia-e-bulimia/">A mente de uma pessoa que sofre de anorexia e bulimia</a></h1>
    
    
      <p class="meta">





  



<time datetime="2007-03-13T00:00:00-03:00" pubdate  data-updated="true" >13 de Março de 2007</time></p>
    
  </header>


  <div class="entry-content"><blockquote><p>A <strong><a href="http://pt.wikipedia.org/wiki/Anorexia" target="_blank">anorexia nervosa</a> </strong>&eacute; uma disfun&ccedil;&atilde;o alimentar, caracterizada por uma r&iacute;gida e insuficiente dieta alimentar (caracterizando em baixo peso corporal) e estresse f&iacute;sico. A anorexia nervosa &eacute; uma doen&ccedil;a complexa, envolvendo componentes psicol&oacute;gicos, fisiol&oacute;gicos e sociais. Uma pessoa com anorexia nervosa &eacute; chamada de anor&eacute;xica. Uma pessoa anor&eacute;xica pode ser tamb&eacute;m bul&iacute;mica.</p>
<p>A anorexia nervosa afeta primariamente adolescentes do sexo feminino e jovens mulheres do Hemisf&eacute;rio Ocidental. A taxa de mortalidade da anorexia nervosa &eacute; de aproximadamente 10%, uma das maiores entre qualquer transtorno psicol&oacute;gico.</p></blockquote>


<blockquote><p>A <strong><a href="http://pt.wikipedia.org/wiki/Bulimia" target="_blank">bulimia nervosa</a> </strong>&eacute; uma disfun&ccedil;&atilde;o alimentar associada &agrave; anorexia nervosa, com um diferencial: a pessoa bul&iacute;mica tende a apresentar per&iacute;odos em que se alimenta em excesso, seguidos pelo sentimento de culpa por causa do ganho de peso. Para &#8220;compensar&#8221; o ganho de massa, o bul&iacute;mico exercita-se de forma desmedida, vomita o que come e/ou faz uso excessivo de purgantes e diur&eacute;ticos.</p>
<p>Al&eacute;m dos mesmos danos &agrave; sa&uacute;de causada pela anorexia, a bulimia nervosa tem outras complica&ccedil;&otilde;es, tais como danos severos ao es&ocirc;fago, &agrave;s gl&acirc;ndulas salivares e aos dentes, por causa do &aacute;cido estomacal, presente no v&ocirc;mito, que corr&oacute;i tais &oacute;rg&atilde;os, o que em alguns casos pode levar &agrave; <strong>morte</strong>.</p></blockquote>


<p>Abaixo segue um v&iacute;deo criado pela ag&ecirc;ncia Grey Stockholm na su&eacute;cia.</p>


<object width="425" height="350">
<param name="movie" value="http://www.youtube.com/v/pkI1Yrf66_0"></param>
<param name="wmode" value="transparent"></param>
<p><embed src="http://www.youtube.com/v/pkI1Yrf66_0" type="application/x-shockwave-flash" wmode="transparent" width="425" height="350"></embed></object>

</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/12/violencia-urbana/">Violência  Urbana</a></h1>
    
    
      <p class="meta">





  



<time datetime="2007-03-12T00:00:00-03:00" pubdate  data-updated="true" >12 de Março de 2007</time></p>
    
  </header>


  <div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/03/482007031212261115alanafabiomotta12marw.jpg" title="482007031212261115alanafabiomotta12marw.jpg" alt="482007031212261115alanafabiomotta12marw.jpg" align="left" />Eu tenho medo de ir ao Rio de Janeiro.
Antes de qualquer mal-entendido, quero dizer que isso n&atilde;o &eacute; uma critica ao estado do Rio de Janeiro, que eu n&atilde;o conhe&ccedil;o e nem aos cidad&atilde;os que tamb&eacute;m s&atilde;o ref&eacute;ns da viol&ecirc;ncia Urbana.
Estou somente escrevendo do ponto de vista de quem acompanha os notici&aacute;rios na TV.
Talvez quem more no Rio sinta o mesmo medo de vir a S&atilde;o Paulo, conhecida por seus  seq&uuml;estros rel&acirc;mpagos e ataques do PCC.
N&atilde;o duvido que o Rio tenha uma beleza exuberante encontrada em raros lugares do mundo e nem que seus moradores sejam pessoas de bem e alegres, mas como n&atilde;o sentir medo de passar por  exemplo minhas f&eacute;rias l&aacute;?
Qual &eacute; o limite entre a viol&ecirc;ncia de policiais e bandidos e a vida urbana de seus moradores?
Hoje se completa uma semana que a estudante de apenas 12 anos  de idade Alana Ezequiel foi baleada e faleceu.
Confronto entre policiais e marginais.
Da onde veio o tiro?
Na mesma semana mais tr&ecirc;s pessoas perderam suas vidas pelo mesmo motivo:
Uma bala perdida.
Uma vida perdida.</p>

<blockquote>Eu vivo sem saber at&eacute; quando estou vivo&#8230;
Sem saber o calibre do perigo, eu n&atilde;o sei da onde vem o tiro.</blockquote>


<p>Como ficar impass&iacute;vel a morte brutal do menino Jo&atilde;o H&eacute;lio de seis anos de idade depois de ser arrastado por 7 km pelas ruas da zona norte do Rio?
Pode ser um assunto repetitivo.
Os programas da televis&atilde;o j&aacute; o debateram exaustivamente.
De quem cobrar?
O que podemos esperar?
Vi em algum lugar algu&eacute;m escrever que n&atilde;o deveria haver carnaval esse ano no Rio como uma express&atilde;o de luto por causa da viol&ecirc;ncia.
No entanto &quot;comemoramos como idiotas, mais um fevereiro e  feriado&#8230;&#8221;</p>

<p>Sei que parece tardio escrever sobre isso agora, mas n&atilde;o quis escrever antes para n&atilde;o ter meu racioc&iacute;nio corrompido pelo sensacionalismo em histeria dos programas de notici&aacute;rios policiais.</p>

<p>E voc&ecirc;, tamb&eacute;m tem medo de ir ao Rio de Janeiro, ou discorda  desse pensamento?</p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/12/dicas-de-sites/">Dicas de sites</a></h1>
    
    
      <p class="meta">





  



<time datetime="2007-03-12T00:00:00-03:00" pubdate  data-updated="true" >12 de Março de 2007</time></p>
    
  </header>


  <div class="entry-content"><p><a target="_blank" href="http://www.famfamfam.com/lab/icons/">Famfamfam</a> - Uma rela&ccedil;&atilde;o de &iacute;cones gratuitos para usar no seu site.<br />
<a target="_blank" href="http://www.crazyegg.com/">Crazyegg</a> - Descubra as &aacute;reas quentes do seu site.<br />
<a target="_blank" href="http://logopond.com/">Logopond</a> - Modelos de logotipos para ajudar os designers a ter uma inspira&ccedil;&atilde;o.</p>

</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/12/deixe-as-imagens-do-seu-site-mais-bonitas-usando-flash/">Deixe as imagens do seu site mais bonitas usando flash</a></h1>
    
    
      <p class="meta">





  



<time datetime="2007-03-12T00:00:00-03:00" pubdate  data-updated="true" >12 de Março de 2007</time></p>
    
  </header>


  <div class="entry-content"><p>O <a href="http://www.swfir.com/" title="swfIr" target="_blank">swfIR</a> (swf Image Replacement) promete acabar com as limita&ccedil;&otilde;es de tratamento de imagens no seu site. Usando flash e javascript a ferramenta permite que voc&ecirc; aplique efeitos visuais interessantes nas imagens.</div>
  
  
    <footer>
      <a rel="full-article" href="/2007/03/12/deixe-as-imagens-do-seu-site-mais-bonitas-usando-flash/">Read on &rarr;</a>
    </footer>
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/11/profissionais-liberais-e-consultores-nao-podem-ficar-doentes/">Profissionais liberais e consultores não podem ficar doentes</a></h1>
    
    
      <p class="meta">





  



<time datetime="2007-03-11T00:00:00-03:00" pubdate  data-updated="true" >11 de Março de 2007</time></p>
    
  </header>


  <div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/03/ab1py1.jpg" title="Acidente" alt="Acidente" align="left" />Li um artigo no <a href="http://www.efetividade.net/2007/03/07/como-voce-e-sua-empresa-lidam-com-ausencias-por-doenca/" title="Efetividade.net" target="_blank">efetividade.net</a> que me fez lembrar de algo interessante. O artigo considerava o fato de ser muito mais produtivo um funcion&aacute;rio doente ficar em casa e se recuperar, do que ir trabalhar nestas condi&ccedil;&otilde;es e &quot;contaminar&quot; o ambiente de trabalho com sua doen&ccedil;a e/ou indisposi&ccedil;&atilde;o.</p>

<p>H&aacute; alguns anos atr&aacute;s me lembro de um caso inusitado onde um funcion&aacute;rio da empresa onde trabalhava foi atropelado e teve uma perna e bra&ccedil;o quebrados. Acontece que alguns dias depois do incidente, o funcion&aacute;rio apareceu na empresa, com os dois bra&ccedil;os engessados e com uma muleta, pronto para o trabalho! Uma cena rid&iacute;cula!</p>

<p>Claro que n&atilde;o o deixaram trabalhar e mandaram-no para casa. Mas, por que uma pessoa nestas condi&ccedil;&otilde;es ainda queria trabalhar?</div>
  
  
    <footer>
      <a rel="full-article" href="/2007/03/11/profissionais-liberais-e-consultores-nao-podem-ficar-doentes/">Read on &rarr;</a>
    </footer>
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/10/a-crise-do-clima/">A crise do clima</a></h1>
    
    
      <p class="meta">





  



<time datetime="2007-03-10T00:00:00-03:00" pubdate  data-updated="true" >10 de Março de 2007</time></p>
    
  </header>


  <div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/03/3220e.jpg" title="Aquecimento Global" alt="Aquecimento Global" align="left" />Aquecimento global &eacute; f&aacute;cil de explicar agora, depois que vi o document&aacute;rio <a href="http://www.nomedojogo.com/?p=7" title="Uma verdade incoveniente" target="_blank">Uma verdade inconveniente </a>de Al Gore.</p>

<p>Mas o que EU posso fazer para ajudar? Esperar os governantes resolverem o problema? A vida real &eacute; bem diferente de Hollywood. O fim pode ser desastroso. Veja uma lista triste de conseq&uuml;&ecirc;ncias para este fen&ocirc;meno no <a href="http://pt.wikipedia.org/wiki/Aquecimento_global#Curiosidades" title="Curiosidades sobre aquecimento global" target="_blank">wikipedia</a>.</p>

<p>O que voc&ecirc; vai fazer a respeito?</p>

<p>Est&aacute; pronto para mudar sua forma de viver?
A crise do clima pode ser resolvida.</p>

<p>Aqui diz como come&ccedil;ar:</div>
  
  
    <footer>
      <a rel="full-article" href="/2007/03/10/a-crise-do-clima/">Read on &rarr;</a>
    </footer>
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/09/estranhos-conhecidos/">Estranhos conhecidos</a></h1>
    
    
      <p class="meta">





  



<time datetime="2007-03-09T00:00:00-03:00" pubdate  data-updated="true" > 9 de Março de 2007</time></p>
    
  </header>


  <div class="entry-content"><p><img align="left" src="http://old.nomedojogo.com/wp-content/uploads/2007/03/untitled.bmp" alt="Estranhos conhecidos" title="Estranhos conhecidos" />Uma vez li um artigo que diz que em apenas um dia de nossas vidas, vemos mais pessoas que um campon&ecirc;s da idade-m&eacute;dia veria durante toda sua exist&ecirc;ncia.
Quantas pessoas entram e saem de um vag&atilde;o de trem?
Eu recorro ao trem todos os dias como meio de transporte para vir ao trabalho.
As pessoas na esta&ccedil;&atilde;o caminham silenciosas lado a lado.
O que pensam? Para onde v&atilde;o?
&#8220;Cada um traz consigo sua pr&oacute;pria dor e todos t&ecirc;m seus pr&oacute;prios sonhos e temores&#8221;
Olho pela janela do vag&atilde;o.
A cidade inteira parece caminhar sozinha.
O trem chega todos os dias no mesmo hor&aacute;rio.
Ele n&atilde;o atrasa, a n&atilde;o ser em dias de chuva.
Hoje ele n&atilde;o atrasou.
Sento-me todos os dias no mesmo lugar e vejo as mesmas pessoas.
Elas est&atilde;o comigo de segunda a sexta.
Eu mal vejo meu irm&atilde;o e minha m&atilde;e todos os dias..
Conhe&ccedil;o seus rostos, seus h&aacute;bitos, sei o que l&ecirc;em.
Vejo onde elas descem e quem as espera.
Mas quem &eacute;?
Eu n&atilde;o saberia dizer um nome sequer.
N&atilde;o h&aacute; &#8220;bom dia, como vai?&#8221;
Eu silenciosamente as observo.</div>
  
  
    <footer>
      <a rel="full-article" href="/2007/03/09/estranhos-conhecidos/">Read on &rarr;</a>
    </footer>
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/08/y-%25e2%2580%2593-o-ultimo-homem/">Y - O Último Homem</a></h1>
    
    
      <p class="meta">





  



<time datetime="2007-03-08T00:00:00-03:00" pubdate  data-updated="true" > 8 de Março de 2007</time></p>
    
  </header>


  <div class="entry-content"><p><img border="0" src="http://bp2.blogger.com/_qPFTWwym1uQ/RfBQUCnobeI/AAAAAAAAATc/NuVFW5i4SGY/s400/y_the_last_man_16.jpg" style="float: left; margin: 0pt 10px 10px 0pt" id="BLOGGER_PHOTO_ID_5039616288258289122" />Yorick Brown, um homem como qualquer outro (apesar de que n&atilde;o concordo que os homens sejam todos iguais), tem seu trabalho, uma noiva e um macaquinho de estima&ccedil;&atilde;o (Ampersand). At&eacute; o dia em que de um uma forma s&uacute;bita, o que aparenta ser uma praga mata todos os mam&iacute;feros com cromossomo Y (entenda-se machos) da terra, incluindo embri&otilde;es e at&eacute; mesmo espermatoz&oacute;ides, com exce&ccedil;&atilde;o de Yorick e seu macaco.</p>

<p>&Eacute; assim que come&ccedil;a a trama desenvolvida por <span style="font-weight: bold">Brian K. Vaughan</span> e desenhada por <span style="font-weight: bold">Pia Guerra</span>.</p>

<p>Imaginem, um mundo s&oacute; com mulheres! No quadrinho, o personagem sai em busca da sua noiva que estava em uma expedi&ccedil;&atilde;o na Austr&aacute;lia, e acaba se envolvendo em um jogo pol&iacute;tico para descobrir a &quot;cura&quot;.</p>

<p>Yorick &eacute; extremamente fiel, mas como se manter assim num mundo onde voc&ecirc; &eacute; o &uacute;ltimo homem?</p>

<p>E o que dizer do resto do mundo? Ao contrario do que podem parecer, as guerras e viol&ecirc;ncia continuam. Grupos de &quot;Amazonas&quot; (mulheres que acreditam que a morte dos homens foi uma providencia divina) espalham o terror, uma corrida armamentista se inicia atr&aacute;s do &uacute;ltimo homem.
<a href="http://bp0.blogger.com/_qPFTWwym1uQ/RfBQvinobgI/AAAAAAAAATs/mib_z8Ccleo/s1600-h/y-thelastman.gif" onblur="try {parent.deselectBloggerImageGracefully();} catch(e) {}"><img border="0" src="http://bp0.blogger.com/_qPFTWwym1uQ/RfBQvinobgI/AAAAAAAAATs/mib_z8Ccleo/s200/y-thelastman.gif" style="float: right; margin: 0pt 0pt 10px 10px; cursor: pointer" id="BLOGGER_PHOTO_ID_5039616760704691714" /></a>
A religi&atilde;o fica sem seus principais instigadores, j&aacute; que todos os padres, mu&ccedil;ulmanos, pastores, etc. morreram.</p>

<p>At&eacute; onde um mundo s&oacute; de mulheres pode chegar? Quais seriam as conseq&uuml;&ecirc;ncias? Quem abrir&aacute; os potes de maionese de agora em diante?</p>

<p>Uma leitura din&acirc;mica e agrad&aacute;vel, com um tema novo e interessante. O autor promete que a saga durar&aacute; 60 edi&ccedil;&otilde;es. Pela internet voc&ecirc; pode encontrar at&eacute; a edi&ccedil;&atilde;o 46 em portugu&ecirc;s.</p>
</div>
  
  


  </article>

<nav role="pagination">
  <div>
    
      <a class="prev" href="/page/82/">&larr; Antigos</a>
    
    <a href="/blog/archives">Arquivo</a>
    
    <a class="next" href="/page/80/">Novos &rarr;</a>
    
  </div>
</nav>

<script type="text/javascript">
    var disqus_shortname = 'carlosbrando';
    (function () {
      var s = document.createElement('script'); s.async = true;
      s.type = 'text/javascript';
      s.src = 'http://' + disqus_shortname + '.disqus.com/count.js';
      (document.getElementsByTagName('HEAD')[0] || document.getElementsByTagName('BODY')[0]).appendChild(s);
    }());
</script>

</div>
<aside role=sidebar>
  
    <section>
  <h1>Artigos Recentes</h1>
  <ul id="recent_posts">
    
      <li class="post">
        <a href="/2011/09/12/contratos-onde-todos-ganham/">Contratos onde todos ganham</a>
      </li>
    
      <li class="post">
        <a href="/2011/08/25/como-convencer-sua-equipe-a-usar-um-sistema-de-controle-de-vers-o/">Como convencer sua equipe a usar um sistema de controle de versão</a>
      </li>
    
      <li class="post">
        <a href="/2011/08/19/blogando-como-um-hacker/">Blogando como um hacker</a>
      </li>
    
      <li class="post">
        <a href="/2011/06/13/a-regra-direita-esquerda-do-c/">A Regra Direita-Esquerda do C</a>
      </li>
    
      <li class="post">
        <a href="/2011/06/03/colorific/">Colorific</a>
      </li>
    
  </ul>
</section>

<section>
  <h1>Últimos Tweets</h1>
  <ul id="tweets">
    <li class="loading">Atualizando&#8230;</li>
  </ul>
  <script type="text/javascript">
    $.domReady(function(){
      getTwitterFeed("carlosbrando", 4, false);
    });
  </script>
  <script src="/javascripts/twitter.js" type="text/javascript"> </script>
  
    <a href="http://twitter.com/carlosbrando" class="twitter-follow-button" data-width="208px" data-show-count="false">Siga @carlosbrando</a>
  
</section>


<section>
  <h1>Open Source</h1>
  <ul id="gh_repos">
    <li class="loading">Atualizando&#8230;</li>
  </ul>
  
  <a href="https://github.com/carlosbrando">@carlosbrando</a> no Github
  
  <script type="text/javascript">
    $.domReady(function(){
        if (!window.jXHR){
            var jxhr = document.createElement('script');
            jxhr.type = 'text/javascript';
            jxhr.src = '/javascripts/libs/jXHR.js';
            var s = document.getElementsByTagName('script')[0];
            s.parentNode.insertBefore(jxhr, s);
        }

        github.showRepos({
            user: 'carlosbrando',
            count: 4,
            skip_forks: false,
            target: '#gh_repos'
        });
    });
  </script>
  <script src="/javascripts/github.js" type="text/javascript"> </script>
</section>




  
</aside>

    </div>
  </div>
  <footer><p>
  Copyright &copy; 2011 - Carlos Brando -
  <span class="credit">Powered by <a href="http://octopress.org">Octopress</a></span>
</p>

</footer>
  
  <script type="text/javascript">
    var _gaq = _gaq || [];
    _gaq.push(['_setAccount', 'UA-1249636-1']);
    _gaq.push(['_trackPageview']);

    (function() {
      var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
      ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
      var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
    })();
  </script>


  
  <script type="text/javascript">
    (function() {
      var script = document.createElement('script'); script.type = 'text/javascript'; script.async = true;
      script.src = 'https://apis.google.com/js/plusone.js';
      var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(script, s);
    })();
  </script>


  
  <script type="text/javascript">
    (function(){
      var twitterWidgets = document.createElement('script');
      twitterWidgets.type = 'text/javascript';
      twitterWidgets.async = true;
      twitterWidgets.src = 'http://platform.twitter.com/widgets.js';
      document.getElementsByTagName('head')[0].appendChild(twitterWidgets);
    })();
  </script>


</body>
</html>
