
<!DOCTYPE html>
<!--[if IEMobile 7 ]><html class="no-js iem7"><![endif]-->
<!--[if lt IE 9]><html class="no-js lte-ie8"><![endif]-->
<!--[if (gt IE 8)|(gt IEMobile 7)|!(IEMobile)|!(IE)]><!--><html class="no-js" lang="en"><!--<![endif]-->
<head>
  <meta charset="utf-8">
  <title>Nome do Jogo</title>
  <meta name="author" content="Carlos Brando">

  
  <meta name="description" content="Todo mundo sabe que para escrever cada vez melhor, nada como escrever muito. Mas alguns se esquecem que para melhorar sua escrita tamb&eacute;m &ea...">
  

  <!-- http://t.co/dKP3o1e -->
  <meta name="HandheldFriendly" content="True">
  <meta name="MobileOptimized" content="320">
  <meta name="viewport" content="width=device-width, initial-scale=1">

  
  <link rel="canonical" href="http://nomedojogo.com/page/80/">
  <link href="/favicon.png" rel="icon">
  <link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
  <script src="/javascripts/modernizr-2.0.js"></script>
  <script src="/javascripts/ender.js"></script>
  <script src="/javascripts/octopress.js" type="text/javascript"></script>
  <link href="http://feeds2.feedburner.com/NomeDoJogo" rel="alternate" title="Nome do Jogo" type="application/atom+xml">
  <!--Fonts from Google's Web font directory at http://google.com/webfonts -->
<link href='http://fonts.googleapis.com/css?family=PT+Serif:regular,italic,bold,bolditalic' rel='stylesheet' type='text/css'>
<link href='http://fonts.googleapis.com/css?family=PT+Sans:regular,italic,bold,bolditalic' rel='stylesheet' type='text/css'>

  
  <script type="text/javascript">
    var _gaq = _gaq || [];
    _gaq.push(['_setAccount', 'UA-1249636-1']);
    _gaq.push(['_trackPageview']);

    (function() {
      var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
      ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
      var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
    })();
  </script>


</head>

<body   >
  <header role="banner"><hgroup>
  <h1><a href="/">Nome do Jogo</a></h1>
  
    <h2>por Carlos Brando</h2>
  
</hgroup>

</header>
  <nav role="navigation"><ul class="subscription" data-subscription="rss">
  <li><a href="http://feeds2.feedburner.com/NomeDoJogo" rel="subscribe-rss" title="assine via RSS">RSS</a></li>
  
</ul>
<form action="http://google.com/search" method="get">
  <fieldset role="search">
    <input type="hidden" name="q" value="site:nomedojogo.com" />
    <input class="search" type="text" name="q" results="0" placeholder="Pesquisar"/>
  </fieldset>
</form>
<ul role=main-navigation>
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Arquivo</a></li>
</ul>

</nav>
  <div id="main">
    <div id="content">
      <div class="blog-index">
  
  
  
    <article>
      
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/17/faa-uma-favor-para-o-seu-blog-leia-mais/">Faça um favor para o seu blog: Leia Mais</a></h1>
    
    
      <p class="meta">
        





  



<time datetime="2007-03-17T00:00:00-03:00" pubdate  data-updated="true" >17 de Março de 2007</time>
        
      </p>
    
  </header>


  <div class="entry-content"><p>Todo mundo sabe que para escrever cada vez melhor, nada como escrever muito. Mas alguns se esquecem que para melhorar sua escrita tamb&eacute;m &eacute; necessário ler muito. Não estou me referindo a ler os feeds do seu blog predileto, mas sim ler livros e revistas de qualidade, e bem escritos.</p>


<p> <p>Conhe&ccedil;o alguns blogueiros que não se dão ao trabalho de ler nem mesmo o que acabaram de escrever. Se você &eacute; um destes, pense o seguinte: Se nem você mesmo gosta do que escreveu, porque outra pessoa iria gostar?</p> <p><img style="border-top-width: 0px; border-left-width: 0px; border-bottom-width: 0px; border-right-width: 0px" height="171" src="http://old.nomedojogo.com/wp-content/uploads/writer/FaaumafavorparaoseublogLeiaMais_E416/Untitled114.jpg" width="240" align="right" border="0">Mais importante do que escrever muito &eacute; ler muito. Leia tudo que puder, livros, revistas, propaganda, qualquer coisa, desde que tenha qualidade e compare com o que você escreve.</p> <p>Uma escrita ruim ou com erros de português pode transformar o mais interessante dos assuntos em algo chato. E o contrário tamb&eacute;m &eacute; uma verdade.</p> <p>Aceite o conselho: escreva muito, leia mais ainda.</p></p>
</div>
  
  


    </article>
  
  
    <article>
      
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/16/eu-queria-ser-um-don/">Eu queria ser um Don</a></h1>
    
    
      <p class="meta">
        





  



<time datetime="2007-03-16T00:00:00-03:00" pubdate  data-updated="true" >16 de Março de 2007</time>
        
      </p>
    
  </header>


  <div class="entry-content"><p><a href="http://old.nomedojogo.com/wp-content/uploads/2007/03/two-dons-sharma31oct03.gif" rel="lightbox" title="Two-Dons-Sharma31oct03.GIF"><img src="http://old.nomedojogo.com/wp-content/uploads/2007/03/two-dons-sharma31oct03-tn.jpg" style="DISPLAY: inline; FLOAT: right; WIDTH: 185px; HEIGHT: 200px" title="Two-Dons-Sharma31oct03.GIF" height="200" width="185" alt="Two-Dons-Sharma31oct03.GIF" border="0" id="urn:zoundry:jid:Two-Dons-Sharma31oct03.GIF"/></a>Todo homem gostaria de ser um Don.<br/>Isso significa proteger a fam&iacute;lia, ser reconhecido no trabalho e ter o respeito dos amigos.<br/>Don Vito conseguiu tudo isso, Don Michael não.<br/><br/>Que Don eu serei?<br/>Talvez um Anthony Soprano, tirando a parte dos assassinatos e da mãe louca&#8230;<br/><br/>Mesmo um Don pode ter ataques de p&acirc;nico, medo e incerteza.<br/>Não vou procurar uma psicanalista.<br/>Ainda tenho o pr&eacute;-conceito que isso &eacute; coisa pra maluco, e que &eacute; muito caro.<br/><br/>A questão &eacute;:<br/>&Eacute; muito mais dif&iacute;cil hoje ser um Don do que era há alguns anos atrás&#8230;<br/>Na &eacute;poca do meu pai, que foi uma esp&eacute;cie peculiar de Don, os homens não conheciam o estresse e a depressão.<br/>Isso não era coisa de Homem, era coisa de fresco.
</div>
  
  
    <footer>
      <a rel="full-article" href="/2007/03/16/eu-queria-ser-um-don/">Continue lendo &rarr;</a>
    </footer>
  


    </article>
  
  
    <article>
      
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/16/educacao-financeira-as-funcoes-da-moeda/">Educação Financeira: As funções da moeda</a></h1>
    
    
      <p class="meta">
        





  



<time datetime="2007-03-16T00:00:00-03:00" pubdate  data-updated="true" >16 de Março de 2007</time>
        
      </p>
    
  </header>


  <div class="entry-content"><p><img align="right" src="http://old.nomedojogo.com/wp-content/uploads/2007/03/moeda.jpg" alt="Moeda" title="Moeda" />Basicamente a moeda tem três fun&ccedil;ões: intermediar trocas, servir de unidade de valor e de reserva de valor.</p>

<p><strong>Intermediária de trocas</strong>
No mundo moderno onde cada pessoa &eacute; interdependente e tem o seu trabalho, a circula&ccedil;ão das mercadorias produzidas &eacute; promovida pela moeda. Imagine se ainda estiv&eacute;ssemos usando o sistema de troca de mercadorias&#8230; Sempre que precisássemos de algo, seria necessário negociar com a outra pessoa para se fazer uma troca justa, o que consome muito tempo, al&eacute;m do problema com o transporte das mercadorias.</p>

<div style="width: 63px; margin: 4px 20px 4px 10px; float: right;">
<script language="JavaScript" src="http://rec6.via6.com/link.php?action=widget&url=http://www.nomedojogo.dreamhosters.com/2007/03/16/educacao-financeira-as-funcoes-da-moeda/" type="text/javascript"></script>
</div>


<p>Neste caso a moeda, facilita a troca de produtos, diminuindo o tempo para a realiza&ccedil;ão de transa&ccedil;ões e facilitando o transporte.</p>

<p><strong>Unidade de valor
</strong>Como cada produto ou servi&ccedil;o tem o seu valor, a moeda torna poss&iacute;vel um sistema de pre&ccedil;os. Novamente entramos no ponto de que se não existisse a moeda, seria necessário sempre negociar para chegar a uma concessão quanto ao valor de cada mercadoria.</p>

<p>Isto torna poss&iacute;vel a existência de uma economia. Onde todos os produtos e servi&ccedil;os são reduzidos a um denominador comum, no caso a moeda.</p>

<p><strong>Reserva de valor</strong>
Imagine viver sem a moeda&#8230; Você &eacute; um pescador e pescou mais do que precisava. Você não pode simplesmente armazenar os peixes como uma reserva para futuras trocas. Al&eacute;m do mau cheiro, eles tamb&eacute;m podem estragar com o tempo.</p>

<p>Com a moeda &eacute; diferente, você pode gastar comprando alguma coisa, ou guardar para um uso futuro (poupar).</p>

<p>Estas são as três fun&ccedil;ões básicas da moeda. Mas não acabou por aqui, ainda precisamos entender o <strong>sistema econ&ocirc;mico</strong>.</p>
</div>
  
  


    </article>
  
  
    <article>
      
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/16/diretorio-de-plugins-do-wordpress/">Diretório de plugins do WordPress</a></h1>
    
    
      <p class="meta">
        





  



<time datetime="2007-03-16T00:00:00-03:00" pubdate  data-updated="true" >16 de Março de 2007</time>
        
      </p>
    
  </header>


  <div class="entry-content"><div style="width: 63px; margin: 4px 20px 4px 10px; float: right;">
<script language="JavaScript" src="http://rec6.via6.com/link.php?action=widget&url=http://www.nomedojogo.dreamhosters.com/2007/03/16/diretorio-de-plugins-do-wordpress/" type="text/javascript"></script>
</div>


<p>Uma das coisas mais legais no WordPress &eacute; a enorme quantidade de plugins. O problema &eacute; encontrar os plugins. Quais são os mais usados, os mais confiáveis, os mais legais?</p>

<p>O <a target="_blank" href="http://wordpress.org" title="WordPress">WordPress.org</a> lan&ccedil;ou um diret&oacute;rio de plugins onde você pode navegar, dar uma nota e comentar sobre todos os seus plugins favoritos.</p>

<p>&Eacute; ideal para termos certeza da qualidade e compatibilidade do plugin. O WordPress ainda promete que no futuro teremos um mecanismo de alerta para quando houver uma nova versão do plugin que estamos utilizando.</p>

<p>Confira o novo diret&oacute;rio <a target="_blank" href="http://wordpress.org/extend/plugins/" title="WordPress">clicando aqui</a>.</p>
</div>
  
  


    </article>
  
  
    <article>
      
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/15/tecnologia-permite-visualizar-veias-antes-de-aplicar-injecoes/">Tecnologia permite visualizar veias antes de aplicar injeções</a></h1>
    
    
      <p class="meta">
        





  



<time datetime="2007-03-15T00:00:00-03:00" pubdate  data-updated="true" >15 de Março de 2007</time>
        
      </p>
    
  </header>


  <div class="entry-content"><p><img align="left" src="http://old.nomedojogo.com/wp-content/uploads/2007/03/boyhand.gif" alt="boyhand.gif" title="boyhand.gif" />As estat&iacute;sticas dizem que no mundo todo são realizadas mais de 1 bilhão de aplica&ccedil;ões todo ano como parte de diversos procedimentos m&eacute;dicos, e dificilmente os cl&iacute;nicos encontram uma veia na primeira tentativa.</p>

<p>Nem precisamos falar do desconforto e do stress que &eacute; para o paciente que recebe as várias agulhadas at&eacute; que o enfermeiro acerte.</p>

<p>O <a target="_blank" href="http://www.luminetx.com/main/content.aspx?mnu=veinviewer" title="VeinViewer">VeinViewer</a> da Luminetx promete melhorar a vida de pacientes e m&eacute;dicos. Veja no <a target="_blank" href="http://www.luminetx.com/main/content.aspx?mnu=veinviewer" title="VeinViewer">site da empresa</a>, mais detalhes sobre esta inven&ccedil;ão.</p>
</div>
  
  


    </article>
  
  
    <article>
      
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/15/educacao-financeira-o-que-precisamos-saber/">Educação financeira: O que precisamos saber</a></h1>
    
    
      <p class="meta">
        





  



<time datetime="2007-03-15T00:00:00-03:00" pubdate  data-updated="true" >15 de Março de 2007</time>
        
      </p>
    
  </header>


  <div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/03/money.jpg" title="Dinheiro" alt="Dinheiro" align="right" />Para que possamos administrar de forma adequada nosso dinheiro, precisamos conhecer o básico sobre economia. De acordo com o Wikipedia:</p>

<blockquote><a href="http://pt.wikipedia.org/wiki/Moeda" title="Moeda" target="_blank">Moeda </a>&eacute; o meio atrav&eacute;s do qual são efetuadas as transa&ccedil;ões monetárias. &Eacute; todo ativo que constitua forma imediata de solver d&eacute;bitos, com aceitabilidade geral e disponibilidade imediata, e que confere ao seu titular um direito de saque sobre o produto social.</blockquote>


<p>Em outras palavras, moeda &eacute; qualquer mercadoria ou produto que funcione como meio de troca, um padrão de valor ou reserva de valor e que &eacute; aceito por todos para pagamento de d&iacute;vidas ou de transa&ccedil;ões.</p>

<p>Diversas mercadorias já foram usadas como &quot;moeda&quot; no passado. O trigo, a aveia, o centeio, tecidos, gado, mel e at&eacute; peixe seco. Mas o problema &eacute; que estas moedas não funcionaram, pois algumas delas se deterioravam com o tempo, e outras tinham um manuseio complicado (sem contar o cheiro) ou eram pesadas demais.</p>

<p>Precisávamos de algo que fosse de simples manuseio e não se deteriorasse para usarmos como moeda. &Eacute; por isto que se decidiu usar o metal.</p>

<p>Hoje, por&eacute;m, a moeda já evoluiu muito. Agora você tem em sua carteira c&eacute;dulas de papel, cartões de cr&eacute;dito e d&eacute;bito, e já estamos falando de moeda virtual e eletr&ocirc;nica. E para armazenar a sua fortuna, temos os bancos.</p>

<p>Mais uma vez recorremos ao Wikipedia:</p>

<blockquote><a href="http://pt.wikipedia.org/wiki/Banco" title="Banco" target="_blank">Banco </a>&eacute; uma institui&ccedil;ão financeira que aceita dep&oacute;sitos e concede empr&eacute;stimos. Dentre as principais fun&ccedil;ões dos bancos atualmente podemos destacar:
*   Dep&oacute;sitos: são as contas correntes ou poupan&ccedil;a realizadas pelos correntistas;
*   Transa&ccedil;ões: aceite de cheques, transferências entre contas correntes e pagamentos;
*   Empr&eacute;stimos;
*   Cofres: guarda de valores para seus clientes;
*   C&acirc;mbio: troca de moedas estrangeiras.</blockquote>


<p>A palavra &quot;banco&quot; vem do alemão bank, que era um banco de madeira usado pelas pessoas que trocavam ou emprestavam dinheiro. A partir da Idade M&eacute;dia, as casas que realizavam atividades similares herdaram o nome.</p>

<p>Agora que já sabemos o que &eacute; moeda e banco, a pergunta &eacute;: Como a moeda &eacute; usada na economia?</p>
</div>
  
  


    </article>
  
  
    <article>
      
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/15/cinco-minutos/">Cinco minutos</a></h1>
    
    
      <p class="meta">
        





  



<time datetime="2007-03-15T00:00:00-03:00" pubdate  data-updated="true" >15 de Março de 2007</time>
        
      </p>
    
  </header>


  <div class="entry-content"><p><img align="left" width="250" src="http://old.nomedojogo.com/wp-content/uploads/2007/03/melancolia.jpg" alt="Melancolia" style="width: 250px" title="Melancolia" />Por que tentamos achar o que dizer quando as palavras já não podem dizer nada? Ningu&eacute;m sabe o porquê numa conversa de uma hora dizemos o que quer&iacute;amos dizer nos últimos cinco minutos. O que cinco minutos podem contar?</p>


<p>A tensão que antecede o momento nos faz despreparados. Onde estava tudo que planejávamos dizer? A noite não termina. Antecipo os sinais e encaixo as palavras e tudo parece tão fácil, as frases todas elaboradas.</p>


<p>Não importa se sou fluente ou desarticulado. Nada me preparou para esta hora. E lá estamos&#8230;</div>
  
  
    <footer>
      <a rel="full-article" href="/2007/03/15/cinco-minutos/">Continue lendo &rarr;</a>
    </footer>
  


    </article>
  
  
    <article>
      
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/15/5-maneiras-de-trabalhar-menos-e-fazer-mais/">5 maneiras de trabalhar menos e fazer mais</a></h1>
    
    
      <p class="meta">
        





  



<time datetime="2007-03-15T00:00:00-03:00" pubdate  data-updated="true" >15 de Março de 2007</time>
        
      </p>
    
  </header>


  <div class="entry-content"><p>Estas dicas valem principalmente para quem trabalha em casa ou por conta pr&oacute;pria.</p>

<ul>
    <li>Restrinja seus horários para produzir mais. Nada de trabalhar mais de 8 horas por dia.</li>
    <li>Crie uma lista de atividades para o dia.</li>
    <li>Agende horários para ler os seus e-mails. E cumpra estes horários.</li>
    <li>Relaxe e não cobre demais de si mesmo.</li>
    <li>Tire uma folga.</li>
</ul>


<p>via <a href="http://www.901am.com/2007/5-ways-to-work-less-and-get-more-done-online.html" title="9Âº1am" target="_blank">9Âº1am</a></p>
</div>
  
  


    </article>
  
  
    <article>
      
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/14/enquanto-isso-em-outros-blogs/">Enquanto isso em outros blogs&#8230;</a></h1>
    
    
      <p class="meta">
        





  



<time datetime="2007-03-14T00:00:00-03:00" pubdate  data-updated="true" >14 de Março de 2007</time>
        
      </p>
    
  </header>


  <div class="entry-content"><p>Veja alguns artigos interessantes postados em outros blogs:</p>

<ul>
    <li><a href="http://brasil.business-opportunities.biz/2007/03/13/empreendedor-transforma-persistencia-em-bom-negocio/#comment-73851" target="_blank">Empreendedor Transforma Persistência Em Bom Neg&oacute;cio</a></li>
    <li><a href="http://blog-ae.blogspot.com/2007/03/inovao-impulsiona-12-mil-empresas-no.html" target="_blank">Inova&ccedil;ão impulsiona 1,2 mil empresas no Pa&iacute;s</a></li>
    <li><a href="http://renata.org/post/coisas-que-nerds-precisam-para-amar-seu-emprego/" target="_blank">Coisas que Nerds Precisam para Amar seu Emprego</a></li>
    <li><a href="http://www.efetividade.net/2007/03/14/textarea-backup-nunca-mais-perca-um-e-mail-ou-post-de-blog-digitado-diretamente-no-navegador/" target="_blank">Textarea backup: Nunca mais perca um e-mail ou post de blog digitado diretamente no navegador</a></li>
    <li><a href="http://www.gigaudi.com/blog/?p=11" target="_blank">O que fazer no horário de descanso?</a></li>
</ul>

</div>
  
  


    </article>
  
  
    <article>
      
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/14/a-musica-tem-o-poder/">A musica tem o poder</a></h1>
    
    
      <p class="meta">
        





  



<time datetime="2007-03-14T00:00:00-03:00" pubdate  data-updated="true" >14 de Março de 2007</time>
        
      </p>
    
  </header>


  <div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/03/untitled.jpg" title="Norah Jones" alt="Norah Jones" align="right" />A música tem o poder.
Ela pode nos fazer sonhar acordados ou reavivar lembran&ccedil;as a muito esquecidas.
E cada momento tem sua can&ccedil;ão.</p>

<p>Eu sempre escolhi a melancolia como meu tema favorito.
Sabe as famosas musicas de &#8220;fossa&#8221;?
Pois &eacute;, elas sempre foram as primeiras da minha lista.</p>

<p>Encontrar musicas que toquem a alma &eacute; algo que s&oacute; cada um de n&oacute;s pode fazer por si mesmo.
A musica que me faz dan&ccedil;ar mesmo sentado ao escrever, não &eacute; a que faz você perder o f&ocirc;lego por alguns instantes.
Certas can&ccedil;ões parecem feitas sobre encomenda para momentos especiais.</p>

<p>Há alguns dias escrevi sobre a banda Sade.
Se você já escutou &#8220;No ordinary Love&#8221; sabe do que estou falando.</p>

<p>Hoje vou escrever sobre outra can&ccedil;ão que posso ouvir vez ap&oacute;s vez sem perder a suavidade e beleza.
&#8220;Come away with me&#8221;.</p>

<p>Norah Jones.</p>

<p>Não preciso dizer sobre o talento dessa mo&ccedil;a.
Os prêmios falam por si, e tamb&eacute;m os mais de 40 milhões de discos vendidos.</p>

<p>A musica &eacute; gostosa de ouvir.
Envolvente, bela e harmoniosa.
A voz  macia  junto com o piano e a bateria ao fundo a tornam perfeita para uma valsa silenciosa em qualquer lugar.
Experimente.
Deixe-a tocar e veja se em poucos  instantes não terá o desejo de estar com algu&eacute;m em seus bra&ccedil;os, ou sentados na rua vendo estrelas.</p>

<p>A música tem o poder&#8230;</p>
</div>
  
  


    </article>
  
  <div class="pagination">
    
      <a class="prev" href="/page/81/">&larr; Antigos</a>
    
    <a href="/blog/archives">Arquivo</a>
    
    <a class="next" href="/page/79/">Novos &rarr;</a>
    
  </div>
</div>
<aside class="sidebar">
  
    <section>
  <h1>Artigos Recentes</h1>
  <ul id="recent_posts">
    
      <li class="post">
        <a href="/2011/10/18/grok-podcast-extra-o-que-voce-achou/">Grok Podcast Extra - O que você achou?</a>
      </li>
    
      <li class="post">
        <a href="/2011/09/12/contratos-onde-todos-ganham/">Contratos onde todos ganham</a>
      </li>
    
      <li class="post">
        <a href="/2011/08/25/como-convencer-sua-equipe-a-usar-um-sistema-de-controle-de-vers-o/">Como convencer sua equipe a usar um sistema de controle de versão</a>
      </li>
    
      <li class="post">
        <a href="/2011/08/19/blogando-como-um-hacker/">Blogando como um hacker</a>
      </li>
    
      <li class="post">
        <a href="/2011/06/13/a-regra-direita-esquerda-do-c/">A Regra Direita-Esquerda do C</a>
      </li>
    
  </ul>
</section>

<section>
  <h1>Open Source</h1>
  <ul id="gh_repos">
    <li class="loading">Atualizando&#8230;</li>
  </ul>
  
  <a href="https://github.com/carlosbrando">@carlosbrando</a> no Github
  
  <script type="text/javascript">
    $.domReady(function(){
        if (!window.jXHR){
            var jxhr = document.createElement('script');
            jxhr.type = 'text/javascript';
            jxhr.src = '/javascripts/libs/jXHR.js';
            var s = document.getElementsByTagName('script')[0];
            s.parentNode.insertBefore(jxhr, s);
        }

        github.showRepos({
            user: 'carlosbrando',
            count: 4,
            skip_forks: false,
            target: '#gh_repos'
        });
    });
  </script>
  <script src="/javascripts/github.js" type="text/javascript"> </script>
</section>


<section>
  <h1>Últimos Tweets</h1>
  <ul id="tweets">
    <li class="loading">Atualizando&#8230;</li>
  </ul>
  <script type="text/javascript">
    $.domReady(function(){
      getTwitterFeed("carlosbrando", 4, false);
    });
  </script>
  <script src="/javascripts/twitter.js" type="text/javascript"> </script>
  
    <a href="http://twitter.com/carlosbrando" class="twitter-follow-button" data-width="208px" data-show-count="false">Siga @carlosbrando</a>
  
</section>


<section>
  <h1>Bookmarks</h1>
  <div id="delicious"></div>
  <script type="text/javascript" src="http://feeds.delicious.com/v2/json/cbrando?count=3&amp;sort=date&amp;callback=renderDeliciousLinks"></script>
  <p><a href="http://delicious.com/cbrando">Meus Bookmarks &raquo;</a></p>
</section>


<section class="googleplus googleplus-hidden">
  <h1>
    <a href="https://plus.google.com/109235566448786781079?rel=author">
      <img src="http://www.google.com/images/icons/ui/gprofile_button-32.png" width="32" height="32">
      Google+
    </a>
  </h1>
</section>



  
</aside>

    </div>
  </div>
  <footer role="contentinfo"><p>
  Copyright &copy; 2011 - Carlos Brando -
  <span class="credit">Powered by <a href="http://octopress.org">Octopress</a></span>
</p>

</footer>
  

<script type="text/javascript">
    
      var disqus_shortname = 'carlosbrando';
      
        
        var disqus_script = 'count.js';
      
    (function () {
      var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
      dsq.src = 'http://' + disqus_shortname + '.disqus.com/' + disqus_script;
      (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    }());
</script>


<div id="fb-root"></div>
<script>(function(d, s, id) {
  var js, fjs = d.getElementsByTagName(s)[0];
  if (d.getElementById(id)) {return;}
  js = d.createElement(s); js.id = id;
  js.src = "//connect.facebook.net/en_US/all.js#appId=212934732101925&xfbml=1";
  fjs.parentNode.insertBefore(js, fjs);
}(document, 'script', 'facebook-jssdk'));</script>


  <script type="text/javascript">
    (function() {
      var script = document.createElement('script'); script.type = 'text/javascript'; script.async = true;
      script.src = 'https://apis.google.com/js/plusone.js';
      var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(script, s);
    })();
  </script>



  <script type="text/javascript">
    (function(){
      var twitterWidgets = document.createElement('script');
      twitterWidgets.type = 'text/javascript';
      twitterWidgets.async = true;
      twitterWidgets.src = 'http://platform.twitter.com/widgets.js';
      document.getElementsByTagName('head')[0].appendChild(twitterWidgets);
    })();
  </script>





</body>
</html>
