
<!DOCTYPE html>
<!--[if IEMobile 7 ]><html class="no-js iem7"><![endif]-->
<!--[if lt IE 9]><html class="no-js lte-ie8"><![endif]-->
<!--[if (gt IE 8)|(gt IEMobile 7)|!(IEMobile)|!(IE)]><!--><html class="no-js" lang="en"><!--<![endif]-->
<head>
  <meta charset="utf-8">
  <title>Nome do Jogo</title>
  <meta name="author" content="Carlos Brando">
  

  <!-- http://t.co/dKP3o1e -->
  <meta name="HandheldFriendly" content="True">
  <meta name="MobileOptimized" content="320">
  <meta name="viewport" content="width=device-width, initial-scale=1">

  

  <link rel="canonical" href="http://nomedojogo.com/page/80/index.html"/>
  <link href="/favicon.png" rel="shortcut icon" />
  <link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
  <script src="/javascripts/modernizr-2.0.js"></script>
  <script src="http://s3.amazonaws.com/ender-js/jeesh.min.js"></script>
  <script src="/javascripts/octopress.js" type="text/javascript"></script>
  <link href="http://feeds2.feedburner.com/NomeDoJogo" rel="alternate" title="Nome do Jogo" type="application/atom+xml"/>
  
  <script type="text/javascript">
    var _gaq = _gaq || [];
    _gaq.push(['_setAccount', 'UA-1249636-1']);
    _gaq.push(['_trackPageview']);

    (function() {
      var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
      ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
      var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
    })();
  </script>


  
  <script type="text/javascript">
    (function() {
      var script = document.createElement('script'); script.type = 'text/javascript'; script.async = true;
      script.src = 'https://apis.google.com/js/plusone.js';
      var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(script, s);
    })();
  </script>


  
  <script type="text/javascript">
    (function(){
      var twitterWidgets = document.createElement('script');
      twitterWidgets.type = 'text/javascript';
      twitterWidgets.async = true;
      twitterWidgets.src = 'http://platform.twitter.com/widgets.js';
      document.getElementsByTagName('head')[0].appendChild(twitterWidgets);
    })();
  </script>


  <!--Fonts from Google's Web font directory at http://google.com/webfonts -->
<link href='http://fonts.googleapis.com/css?family=PT+Serif:regular,italic,bold,bolditalic' rel='stylesheet' type='text/css'>
<link href='http://fonts.googleapis.com/css?family=PT+Sans:regular,italic,bold,bolditalic' rel='stylesheet' type='text/css'>

</head>

<body  >
  <header><hgroup>
  <h1><a href="/">Nome do Jogo</a></h1>
  
    <h2>por Carlos Brando</h2>
  
</hgroup>

</header>
  <nav role=navigation><ul role=subscription data-subscription="rss">
  <li><a href="http://feeds2.feedburner.com/NomeDoJogo" rel="subscribe-rss" title="subscribe via RSS">RSS</a></li>
  
</ul>
<form action="http://google.com/search" method="get">
  <fieldset role="site-search">
    <input type="hidden" name="q" value="site:nomedojogo.com" />
    <input class="search" type="text" name="q" results="0" placeholder="Search"/>
  </fieldset>
</form>
<ul role=main-navigation>
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Arquivo</a></li>
</ul>

</nav>
  <div id="main">
    <div id="content">
      <div class="blog-index">



  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/16/educacao-financeira-as-funcoes-da-moeda/">Educação Financeira: As funções da moeda</a></h1>
    
    
      <p class="meta">




<time datetime="2007-03-16 00:00:00 -0300" pubdate  updated >16 de Março de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p><img align="right" src="http://old.nomedojogo.com/wp-content/uploads/2007/03/moeda.jpg" alt="Moeda" title="Moeda" />Basicamente a moeda tem tr&ecirc;s fun&ccedil;&otilde;es: intermediar trocas, servir de unidade de valor e de reserva de valor.</p>

<p><strong>Intermedi&aacute;ria de trocas</strong>
No mundo moderno onde cada pessoa &eacute; interdependente e tem o seu trabalho, a circula&ccedil;&atilde;o das mercadorias produzidas &eacute; promovida pela moeda. Imagine se ainda estiv&eacute;ssemos usando o sistema de troca de mercadorias&#8230; Sempre que precis&aacute;ssemos de algo, seria necess&aacute;rio negociar com a outra pessoa para se fazer uma troca justa, o que consome muito tempo, al&eacute;m do problema com o transporte das mercadorias.</p>

<div style="width: 63px; margin: 4px 20px 4px 10px; float: right;">
<script language="JavaScript" src="http://rec6.via6.com/link.php?action=widget&url=http://www.nomedojogo.dreamhosters.com/2007/03/16/educacao-financeira-as-funcoes-da-moeda/" type="text/javascript"></script>
</div>


<p>Neste caso a moeda, facilita a troca de produtos, diminuindo o tempo para a realiza&ccedil;&atilde;o de transa&ccedil;&otilde;es e facilitando o transporte.</p>

<p><strong>Unidade de valor
</strong>Como cada produto ou servi&ccedil;o tem o seu valor, a moeda torna poss&iacute;vel um sistema de pre&ccedil;os. Novamente entramos no ponto de que se n&atilde;o existisse a moeda, seria necess&aacute;rio sempre negociar para chegar a uma concess&atilde;o quanto ao valor de cada mercadoria.</p>

<p>Isto torna poss&iacute;vel a exist&ecirc;ncia de uma economia. Onde todos os produtos e servi&ccedil;os s&atilde;o reduzidos a um denominador comum, no caso a moeda.</p>

<p><strong>Reserva de valor</strong>
Imagine viver sem a moeda&#8230; Voc&ecirc; &eacute; um pescador e pescou mais do que precisava. Voc&ecirc; n&atilde;o pode simplesmente armazenar os peixes como uma reserva para futuras trocas. Al&eacute;m do mau cheiro, eles tamb&eacute;m podem estragar com o tempo.</p>

<p>Com a moeda &eacute; diferente, voc&ecirc; pode gastar comprando alguma coisa, ou guardar para um uso futuro (poupar).</p>

<p>Estas s&atilde;o as tr&ecirc;s fun&ccedil;&otilde;es b&aacute;sicas da moeda. Mas n&atilde;o acabou por aqui, ainda precisamos entender o <strong>sistema econ&ocirc;mico</strong>.</p>
</div>
  <footer>
    <a rel="full-article" href="/2007/03/16/educacao-financeira-as-funcoes-da-moeda/">Leia mais &rarr;</a>
  </footer>


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/16/diretorio-de-plugins-do-wordpress/">Diretório de plugins do WordPress</a></h1>
    
    
      <p class="meta">




<time datetime="2007-03-16 00:00:00 -0300" pubdate  updated >16 de Março de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><div style="width: 63px; margin: 4px 20px 4px 10px; float: right;">
<script language="JavaScript" src="http://rec6.via6.com/link.php?action=widget&url=http://www.nomedojogo.dreamhosters.com/2007/03/16/diretorio-de-plugins-do-wordpress/" type="text/javascript"></script>
</div>


<p>Uma das coisas mais legais no WordPress &eacute; a enorme quantidade de plugins. O problema &eacute; encontrar os plugins. Quais s&atilde;o os mais usados, os mais confi&aacute;veis, os mais legais?</p>

<p>O <a target="_blank" href="http://wordpress.org" title="WordPress">WordPress.org</a> lan&ccedil;ou um diret&oacute;rio de plugins onde voc&ecirc; pode navegar, dar uma nota e comentar sobre todos os seus plugins favoritos.</p>

<p>&Eacute; ideal para termos certeza da qualidade e compatibilidade do plugin. O WordPress ainda promete que no futuro teremos um mecanismo de alerta para quando houver uma nova vers&atilde;o do plugin que estamos utilizando.</p>

<p>Confira o novo diret&oacute;rio <a target="_blank" href="http://wordpress.org/extend/plugins/" title="WordPress">clicando aqui</a>.</p>
</div>
  <footer>
    <a rel="full-article" href="/2007/03/16/diretorio-de-plugins-do-wordpress/">Leia mais &rarr;</a>
  </footer>


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/15/tecnologia-permite-visualizar-veias-antes-de-aplicar-injecoes/">Tecnologia permite visualizar veias antes de aplicar injeções</a></h1>
    
    
      <p class="meta">




<time datetime="2007-03-15 00:00:00 -0300" pubdate  updated >15 de Março de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p><img align="left" src="http://old.nomedojogo.com/wp-content/uploads/2007/03/boyhand.gif" alt="boyhand.gif" title="boyhand.gif" />As estat&iacute;sticas dizem que no mundo todo s&atilde;o realizadas mais de 1 bilh&atilde;o de aplica&ccedil;&otilde;es todo ano como parte de diversos procedimentos m&eacute;dicos, e dificilmente os cl&iacute;nicos encontram uma veia na primeira tentativa.</p>

<p>Nem precisamos falar do desconforto e do stress que &eacute; para o paciente que recebe as v&aacute;rias agulhadas at&eacute; que o enfermeiro acerte.</p>

<p>O <a target="_blank" href="http://www.luminetx.com/main/content.aspx?mnu=veinviewer" title="VeinViewer">VeinViewer</a> da Luminetx promete melhorar a vida de pacientes e m&eacute;dicos. Veja no <a target="_blank" href="http://www.luminetx.com/main/content.aspx?mnu=veinviewer" title="VeinViewer">site da empresa</a>, mais detalhes sobre esta inven&ccedil;&atilde;o.</p>
</div>
  <footer>
    <a rel="full-article" href="/2007/03/15/tecnologia-permite-visualizar-veias-antes-de-aplicar-injecoes/">Leia mais &rarr;</a>
  </footer>


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/15/educacao-financeira-o-que-precisamos-saber/">Educação financeira: O que precisamos saber</a></h1>
    
    
      <p class="meta">




<time datetime="2007-03-15 00:00:00 -0300" pubdate  updated >15 de Março de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/03/money.jpg" title="Dinheiro" alt="Dinheiro" align="right" />Para que possamos administrar de forma adequada nosso dinheiro, precisamos conhecer o b&aacute;sico sobre economia. De acordo com o Wikipedia:</p>

<blockquote><a href="http://pt.wikipedia.org/wiki/Moeda" title="Moeda" target="_blank">Moeda </a>&eacute; o meio atrav&eacute;s do qual s&atilde;o efetuadas as transa&ccedil;&otilde;es monet&aacute;rias. &Eacute; todo ativo que constitua forma imediata de solver d&eacute;bitos, com aceitabilidade geral e disponibilidade imediata, e que confere ao seu titular um direito de saque sobre o produto social.</blockquote>


<p>Em outras palavras, moeda &eacute; qualquer mercadoria ou produto que funcione como meio de troca, um padr&atilde;o de valor ou reserva de valor e que &eacute; aceito por todos para pagamento de d&iacute;vidas ou de transa&ccedil;&otilde;es.</p>

<p>Diversas mercadorias j&aacute; foram usadas como &quot;moeda&quot; no passado. O trigo, a aveia, o centeio, tecidos, gado, mel e at&eacute; peixe seco. Mas o problema &eacute; que estas moedas n&atilde;o funcionaram, pois algumas delas se deterioravam com o tempo, e outras tinham um manuseio complicado (sem contar o cheiro) ou eram pesadas demais.</p>

<p>Precis&aacute;vamos de algo que fosse de simples manuseio e n&atilde;o se deteriorasse para usarmos como moeda. &Eacute; por isto que se decidiu usar o metal.</p>

<p>Hoje, por&eacute;m, a moeda j&aacute; evoluiu muito. Agora voc&ecirc; tem em sua carteira c&eacute;dulas de papel, cart&otilde;es de cr&eacute;dito e d&eacute;bito, e j&aacute; estamos falando de moeda virtual e eletr&ocirc;nica. E para armazenar a sua fortuna, temos os bancos.</p>

<p>Mais uma vez recorremos ao Wikipedia:</p>

<blockquote><a href="http://pt.wikipedia.org/wiki/Banco" title="Banco" target="_blank">Banco </a>&eacute; uma institui&ccedil;&atilde;o financeira que aceita dep&oacute;sitos e concede empr&eacute;stimos. Dentre as principais fun&ccedil;&otilde;es dos bancos atualmente podemos destacar:
*   Dep&oacute;sitos: s&atilde;o as contas correntes ou poupan&ccedil;a realizadas pelos correntistas;
*   Transa&ccedil;&otilde;es: aceite de cheques, transfer&ecirc;ncias entre contas correntes e pagamentos;
*   Empr&eacute;stimos;
*   Cofres: guarda de valores para seus clientes;
*   C&acirc;mbio: troca de moedas estrangeiras.</blockquote>


<p>A palavra &quot;banco&quot; vem do alem&atilde;o bank, que era um banco de madeira usado pelas pessoas que trocavam ou emprestavam dinheiro. A partir da Idade M&eacute;dia, as casas que realizavam atividades similares herdaram o nome.</p>

<p>Agora que j&aacute; sabemos o que &eacute; moeda e banco, a pergunta &eacute;: Como a moeda &eacute; usada na economia?</p>
</div>
  <footer>
    <a rel="full-article" href="/2007/03/15/educacao-financeira-o-que-precisamos-saber/">Leia mais &rarr;</a>
  </footer>


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/15/cinco-minutos/">Cinco minutos</a></h1>
    
    
      <p class="meta">




<time datetime="2007-03-15 00:00:00 -0300" pubdate  updated >15 de Março de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p><img align="left" width="250" src="http://old.nomedojogo.com/wp-content/uploads/2007/03/melancolia.jpg" alt="Melancolia" style="width: 250px" title="Melancolia" />Por que tentamos achar o que dizer quando as palavras j&aacute; n&atilde;o podem dizer nada? Ningu&eacute;m sabe o porqu&ecirc; numa conversa de uma hora dizemos o que quer&iacute;amos dizer nos &uacute;ltimos cinco minutos. O que cinco minutos podem contar?</p>


<p>A tens&atilde;o que antecede o momento nos faz despreparados. Onde estava tudo que planej&aacute;vamos dizer? A noite n&atilde;o termina. Antecipo os sinais e encaixo as palavras e tudo parece t&atilde;o f&aacute;cil, as frases todas elaboradas.</p>


<p>N&atilde;o importa se sou fluente ou desarticulado. Nada me preparou para esta hora. E l&aacute; estamos&#8230;</div>
  <footer>
    <a rel="full-article" href="/2007/03/15/cinco-minutos/">Leia mais &rarr;</a>
  </footer>


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/15/5-maneiras-de-trabalhar-menos-e-fazer-mais/">5 maneiras de trabalhar menos e fazer mais</a></h1>
    
    
      <p class="meta">




<time datetime="2007-03-15 00:00:00 -0300" pubdate  updated >15 de Março de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p>Estas dicas valem principalmente para quem trabalha em casa ou por conta pr&oacute;pria.</p>

<ul>
    <li>Restrinja seus hor&aacute;rios para produzir mais. Nada de trabalhar mais de 8 horas por dia.</li>
    <li>Crie uma lista de atividades para o dia.</li>
    <li>Agende hor&aacute;rios para ler os seus e-mails. E cumpra estes hor&aacute;rios.</li>
    <li>Relaxe e n&atilde;o cobre demais de si mesmo.</li>
    <li>Tire uma folga.</li>
</ul>


<p>via <a href="http://www.901am.com/2007/5-ways-to-work-less-and-get-more-done-online.html" title="9Âº1am" target="_blank">9Âº1am</a></p>
</div>
  <footer>
    <a rel="full-article" href="/2007/03/15/5-maneiras-de-trabalhar-menos-e-fazer-mais/">Leia mais &rarr;</a>
  </footer>


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/14/enquanto-isso-em-outros-blogs/">Enquanto isso em outros blogs&#8230;</a></h1>
    
    
      <p class="meta">




<time datetime="2007-03-14 00:00:00 -0300" pubdate  updated >14 de Março de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p>Veja alguns artigos interessantes postados em outros blogs:</p>

<ul>
    <li><a href="http://brasil.business-opportunities.biz/2007/03/13/empreendedor-transforma-persistencia-em-bom-negocio/#comment-73851" target="_blank">Empreendedor Transforma Persist&ecirc;ncia Em Bom Neg&oacute;cio</a></li>
    <li><a href="http://blog-ae.blogspot.com/2007/03/inovao-impulsiona-12-mil-empresas-no.html" target="_blank">Inova&ccedil;&atilde;o impulsiona 1,2 mil empresas no Pa&iacute;s</a></li>
    <li><a href="http://renata.org/post/coisas-que-nerds-precisam-para-amar-seu-emprego/" target="_blank">Coisas que Nerds Precisam para Amar seu Emprego</a></li>
    <li><a href="http://www.efetividade.net/2007/03/14/textarea-backup-nunca-mais-perca-um-e-mail-ou-post-de-blog-digitado-diretamente-no-navegador/" target="_blank">Textarea backup: Nunca mais perca um e-mail ou post de blog digitado diretamente no navegador</a></li>
    <li><a href="http://www.gigaudi.com/blog/?p=11" target="_blank">O que fazer no hor&aacute;rio de descanso?</a></li>
</ul>

</div>
  <footer>
    <a rel="full-article" href="/2007/03/14/enquanto-isso-em-outros-blogs/">Leia mais &rarr;</a>
  </footer>


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/14/a-musica-tem-o-poder/">A musica tem o poder</a></h1>
    
    
      <p class="meta">




<time datetime="2007-03-14 00:00:00 -0300" pubdate  updated >14 de Março de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/03/untitled.jpg" title="Norah Jones" alt="Norah Jones" align="right" />A m&uacute;sica tem o poder.
Ela pode nos fazer sonhar acordados ou reavivar lembran&ccedil;as a muito esquecidas.
E cada momento tem sua can&ccedil;&atilde;o.</p>

<p>Eu sempre escolhi a melancolia como meu tema favorito.
Sabe as famosas musicas de &#8220;fossa&#8221;?
Pois &eacute;, elas sempre foram as primeiras da minha lista.</p>

<p>Encontrar musicas que toquem a alma &eacute; algo que s&oacute; cada um de n&oacute;s pode fazer por si mesmo.
A musica que me faz dan&ccedil;ar mesmo sentado ao escrever, n&atilde;o &eacute; a que faz voc&ecirc; perder o f&ocirc;lego por alguns instantes.
Certas can&ccedil;&otilde;es parecem feitas sobre encomenda para momentos especiais.</p>

<p>H&aacute; alguns dias escrevi sobre a banda Sade.
Se voc&ecirc; j&aacute; escutou &#8220;No ordinary Love&#8221; sabe do que estou falando.</p>

<p>Hoje vou escrever sobre outra can&ccedil;&atilde;o que posso ouvir vez ap&oacute;s vez sem perder a suavidade e beleza.
&#8220;Come away with me&#8221;.</p>

<p>Norah Jones.</p>

<p>N&atilde;o preciso dizer sobre o talento dessa mo&ccedil;a.
Os pr&ecirc;mios falam por si, e tamb&eacute;m os mais de 40 milh&otilde;es de discos vendidos.</p>

<p>A musica &eacute; gostosa de ouvir.
Envolvente, bela e harmoniosa.
A voz  macia  junto com o piano e a bateria ao fundo a tornam perfeita para uma valsa silenciosa em qualquer lugar.
Experimente.
Deixe-a tocar e veja se em poucos  instantes n&atilde;o ter&aacute; o desejo de estar com algu&eacute;m em seus bra&ccedil;os, ou sentados na rua vendo estrelas.</p>

<p>A m&uacute;sica tem o poder&#8230;</p>
</div>
  <footer>
    <a rel="full-article" href="/2007/03/14/a-musica-tem-o-poder/">Leia mais &rarr;</a>
  </footer>


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/14/a-importancia-da-educacao-financeira/">A importância da educação financeira</a></h1>
    
    
      <p class="meta">




<time datetime="2007-03-14 00:00:00 -0300" pubdate  updated >14 de Março de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/03/moneytree.gif" title="&Aacute;rvore de dinheiro" alt="&Aacute;rvore de dinheiro" align="right" />Durante nossa vida estamos sempre aprendendo. Aprendemos a conviver com as pessoas, aprendemos uma profiss&atilde;o e aprendemos como a vida e o mundo funciona.</p>

<p>Na escola tivemos uma forma&ccedil;&atilde;o cultural e profissional, mas aqui no Brasil, dificilmente tivemos uma educa&ccedil;&atilde;o financeira.</p>

<p>Sem ser materialista, podemos dizer que uma boa administra&ccedil;&atilde;o do dinheiro &eacute; essencial para um melhor planejamento e qualidade de vida. Lembre-se de quantas vezes se viu em dificuldades por n&atilde;o ter tido informa&ccedil;&otilde;es suficientes que lhe auxiliassem a conviver melhor com os problemas do consumo e poupan&ccedil;a, principalmente se voc&ecirc; depende de seu sal&aacute;rio para viver.</p>

<p>Da mesma forma como na empresa em que voc&ecirc; trabalha, seu dinheiro deve ser gerenciado de forma adequada, para que voc&ecirc; possa viver com menos preocupa&ccedil;&otilde;es, muitas vezes geradas pela falta de reservas financeiras.</p>

<p>Evitar problemas financeiros, ter mais autonomia para tomar suas decis&otilde;es, planejar o seu futuro e de seus filhos, ter prazer em consumir produtos, servi&ccedil;os e bens que voc&ecirc; necessita. Tudo isto &eacute; importante para termos uma vida equilibrada.</p>

<p>O &quot;Nome do Jogo&quot; inicia agora uma s&eacute;rie de artigos sobre educa&ccedil;&atilde;o financeira, e voc&ecirc; pode participar deixando o seu coment&aacute;rio e dicas.</p>

<p>Inicialmente os artigos s&atilde;o resumos de informa&ccedil;&otilde;es colhidas no curso do &#39;Projeto Educar&#39;, uma iniciativa da <a href="http://www.bovespa.com.br/Principal.asp" title="Bovespa" target="_blank">Bovespa</a>.</p>

<p>O tema de amanh&atilde; &eacute;: &quot;O que precisamos saber&quot;.</p>
</div>
  <footer>
    <a rel="full-article" href="/2007/03/14/a-importancia-da-educacao-financeira/">Leia mais &rarr;</a>
  </footer>


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/14/11-dicas-para-melhorar-suas-senhas/">11 dicas para aumentar a segurança de suas senhas</a></h1>
    
    
      <p class="meta">




<time datetime="2007-03-14 00:00:00 -0300" pubdate  updated >14 de Março de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><div style="width: 63px; margin: 4px 40px 4px 10px; float: left;">
<script language="JavaScript" src="http://rec6.via6.com/link.php?action=widget&url=http://www.nomedojogo.dreamhosters.com/2007/03/14/11-dicas-para-melhorar-suas-senhas/" type="text/javascript"></script>
</div>


<p><img align="right" src="http://old.nomedojogo.com/wp-content/uploads/2007/03/securelock.jpg" alt="Senha" title="Senha" />Onze dicas para aumentar a seguran&ccedil;a de suas senhas pessoais.</p>

<ol>
    <li>Trate suas senhas como voc&ecirc; trata suas roupas intimas. Troque frequentemente e n&atilde;o deixa a vista.</li>
    <li>Nunca envie sua senha para um amigo ou familiar pela internet.</li>
    <li>Uma boa senha n&atilde;o pode ser encontrada em nenhum dicion&aacute;rio, de nenhuma l&iacute;ngua.</li>
    <li>Nunca use nomes e data com significado em suas senhas.</li>
    <li>Se voc&ecirc; tem uma senha padr&atilde;o para todas as coisas, mude imediatamente.</li>
    <li>Nunca use a mesma senha para tudo. Use sempre uma senha diferente.</li>
    <li>Use programas de armazenamento de senha com uma senha longa (+ de 20 caracteres) para guardar suas senhas.</li>
    <li>Quanto maior a senha, melhor.</li>
    <li>Senhas devem conter letras, n&uacute;mero e s&iacute;mbolos, em mai&uacute;sculo e min&uacute;sculo.</li>
    <li>Use geradores de senhas.</li>
    <li>Nunca anote uma senha.</li>
</ol>


<p>Via <a target="_blank" href="http://www.dailycupoftech.com/11-password-tips/">Daily Cup of Tech</a></p>
</div>
  <footer>
    <a rel="full-article" href="/2007/03/14/11-dicas-para-melhorar-suas-senhas/">Leia mais &rarr;</a>
  </footer>


  </article>

<nav role="pagination">
  <div>
    
      <a class="prev" href="/page/81/">&larr; Antigos</a>
    
    <a href="/blog/archives">Arquivo</a>
    
    <a class="next" href="/page/79/">Novos &rarr;</a>
    
  </div>
</nav>

<script type="text/javascript">
    var disqus_shortname = 'carlosbrando';
    (function () {
      var s = document.createElement('script'); s.async = true;
      s.type = 'text/javascript';
      s.src = 'http://' + disqus_shortname + '.disqus.com/count.js';
      (document.getElementsByTagName('HEAD')[0] || document.getElementsByTagName('BODY')[0]).appendChild(s);
    }());
</script>

</div>
<aside role=sidebar>
  
    <section>
  <h1>Recent Posts</h1>
  <ul id="recent_posts">
    
      <li class="post">
        <a href="/2011/08/25/como-convencer-sua-equipe-a-usar-um-sistema-de-controle-de-vers-o/">Como convencer sua equipe a usar um sistema de controle de versão</a>
      </li>
    
      <li class="post">
        <a href="/2011/08/19/blogando-como-um-hacker/">Blogando como um hacker</a>
      </li>
    
      <li class="post">
        <a href="/2011/06/13/a-regra-direita-esquerda-do-c/">A Regra Direita-Esquerda do C</a>
      </li>
    
      <li class="post">
        <a href="/2011/06/03/colorific/">Colorific</a>
      </li>
    
      <li class="post">
        <a href="/2011/03/29/quem-disse-que-gravar-um-podcast-e-facil/">Quem disse que gravar um podcast é fácil?</a>
      </li>
    
  </ul>
</section>

<section>
  <h1>Latest Tweets</h1>
  <ul id="tweets">
    <li class="loading">Status updating&#8230;</li>
  </ul>
  <script type="text/javascript">
    $.domReady(function(){
      getTwitterFeed("carlosbrando", 4, false);
    });
  </script>
  <script src="/javascripts/twitter.js" type="text/javascript"> </script>
  
    <a href="http://twitter.com/carlosbrando" class="twitter-follow-button" data-width="208px" data-show-count="false">Follow @carlosbrando</a>
  
</section>




  
</aside>

    </div>
  </div>
  <footer><p>
  Copyright &copy; 2011 - Carlos Brando -
  <span class="credit">Powered by <a href="http://octopress.org">Octopress</a></span>
</p>

</footer>
</body>
</html>
