
<!DOCTYPE html>
<!--[if IEMobile 7 ]><html class="no-js iem7"><![endif]-->
<!--[if lt IE 9]><html class="no-js lte-ie8"><![endif]-->
<!--[if (gt IE 8)|(gt IEMobile 7)|!(IEMobile)|!(IE)]><!--><html class="no-js" lang="en"><!--<![endif]-->
<head>
  <meta charset="utf-8">
  <title>Nome do Jogo</title>
  <meta name="author" content="Carlos Brando">
  

  <!-- http://t.co/dKP3o1e -->
  <meta name="HandheldFriendly" content="True">
  <meta name="MobileOptimized" content="320">
  <meta name="viewport" content="width=device-width, initial-scale=1">

  

  <link rel="canonical" href="http://carlosbrando.github.com/page81/index.html"/>
  <link href="/favicon.png" rel="shortcut icon" />
  <link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
  <script src="/javascripts/modernizr-2.0.js"></script>
  <script src="http://s3.amazonaws.com/ender-js/jeesh.min.js"></script>
  <script src="/javascripts/octopress.js" type="text/javascript"></script>
  
  <link href="http://feeds2.feedburner.com/NomeDoJogo" rel="alternate" title="Nome do Jogo" type="application/atom+xml"/>
  
  <script type="text/javascript">
    var _gaq = _gaq || [];
    _gaq.push(['_setAccount', 'UA-1249636-1']);
    _gaq.push(['_trackPageview']);

    (function() {
      var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
      ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
      var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
    })();
  </script>


  
  <script type="text/javascript">
    (function() {
      var script = document.createElement('script'); script.type = 'text/javascript'; script.async = true;
      script.src = 'https://apis.google.com/js/plusone.js';
      var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(script, s);
    })();
  </script>


  
  <script type="text/javascript">
    (function(){
      var twitterWidgets = document.createElement('script');
      twitterWidgets.type = 'text/javascript';
      twitterWidgets.async = true;
      twitterWidgets.src = 'http://platform.twitter.com/widgets.js';
      document.getElementsByTagName('head')[0].appendChild(twitterWidgets);
    })();
  </script>


  <!--Fonts from Google's Web font directory at http://google.com/webfonts -->
<link href='http://fonts.googleapis.com/css?family=PT+Serif:regular,italic,bold,bolditalic' rel='stylesheet' type='text/css'>
<link href='http://fonts.googleapis.com/css?family=PT+Sans:regular,italic,bold,bolditalic' rel='stylesheet' type='text/css'>

</head>

<body  >
  <header><hgroup>
  <h1><a href="/">Nome do Jogo</a></h1>
  
    <h2>por Carlos Brando</h2>
  
</hgroup>

</header>
  <nav role=navigation><ul role=subscription data-subscription="rss">
  <li><a href="http://feeds2.feedburner.com/NomeDoJogo" rel="subscribe-rss" title="subscribe via RSS">RSS</a></li>
  
</ul>
<form action="http://google.com/search" method="get">
  <fieldset role="site-search">
    <input type="hidden" name="q" value="site:carlosbrando.github.com" />
    <input class="search" type="text" name="q" results="0" placeholder="Search"/>
  </fieldset>
</form>
<ul role=main-navigation>
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
</ul>

</nav>
  <div id="main">
    <div id="content">
      <div class="blog-index">



  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/12/violencia-urbana/">Violência  Urbana</a></h1>
    
    
      <p class="meta">




<time datetime="2007-03-12 00:00:00 -0300" pubdate  updated >Mar 12<span>th</span>, 2007</time>


</p>
    
  </header>


  <div class="entry-content"><img src="http://www.nomedojogo.com/wp-content/uploads/2007/03/482007031212261115alanafabiomotta12marw.jpg" title="482007031212261115alanafabiomotta12marw.jpg" alt="482007031212261115alanafabiomotta12marw.jpg" align="left" />Eu tenho medo de ir ao Rio de Janeiro.
Antes de qualquer mal-entendido, quero dizer que isso n&atilde;o &eacute; uma critica ao estado do Rio de Janeiro, que eu n&atilde;o conhe&ccedil;o e nem aos cidad&atilde;os que tamb&eacute;m s&atilde;o ref&eacute;ns da viol&ecirc;ncia Urbana.
Estou somente escrevendo do ponto de vista de quem acompanha os notici&aacute;rios na TV.
Talvez quem more no Rio sinta o mesmo medo de vir a S&atilde;o Paulo, conhecida por seus  seq&uuml;estros rel&acirc;mpagos e ataques do PCC.
N&atilde;o duvido que o Rio tenha uma beleza exuberante encontrada em raros lugares do mundo e nem que seus moradores sejam pessoas de bem e alegres, mas como n&atilde;o sentir medo de passar por  exemplo minhas f&eacute;rias l&aacute;?
Qual &eacute; o limite entre a viol&ecirc;ncia de policiais e bandidos e a vida urbana de seus moradores?
Hoje se completa uma semana que a estudante de apenas 12 anos  de idade Alana Ezequiel foi baleada e faleceu.
Confronto entre policiais e marginais.
Da onde veio o tiro?
Na mesma semana mais tr&ecirc;s pessoas perderam suas vidas pelo mesmo motivo:
Uma bala perdida.
Uma vida perdida.
<blockquote>Eu vivo sem saber at&eacute; quando estou vivo&#8230;
Sem saber o calibre do perigo, eu n&atilde;o sei da onde vem o tiro.</blockquote>
Como ficar impass&iacute;vel a morte brutal do menino Jo&atilde;o H&eacute;lio de seis anos de idade depois de ser arrastado por 7 km pelas ruas da zona norte do Rio?
Pode ser um assunto repetitivo.
Os programas da televis&atilde;o j&aacute; o debateram exaustivamente.
De quem cobrar?
O que podemos esperar?
Vi em algum lugar algu&eacute;m escrever que n&atilde;o deveria haver carnaval esse ano no Rio como uma express&atilde;o de luto por causa da viol&ecirc;ncia.
No entanto &quot;comemoramos como idiotas, mais um fevereiro e  feriado&#8230;&#8221;

Sei que parece tardio escrever sobre isso agora, mas n&atilde;o quis escrever antes para n&atilde;o ter meu racioc&iacute;nio corrompido pelo sensacionalismo em histeria dos programas de notici&aacute;rios policiais.

E voc&ecirc;, tamb&eacute;m tem medo de ir ao Rio de Janeiro, ou discorda  desse pensamento?
</div>
  <footer>
    <a rel="full-article" href="/2007/03/12/violencia-urbana/">Read on &rarr;</a>
  </footer>


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/12/dicas-de-sites/">Dicas de sites</a></h1>
    
    
      <p class="meta">




<time datetime="2007-03-12 00:00:00 -0300" pubdate  updated >Mar 12<span>th</span>, 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p><a target="_blank" href="http://www.famfamfam.com/lab/icons/">Famfamfam</a> - Uma rela&ccedil;&atilde;o de &iacute;cones gratuitos para usar no seu site.<br />
<a target="_blank" href="http://www.crazyegg.com/">Crazyegg</a> - Descubra as &aacute;reas quentes do seu site.<br />
<a target="_blank" href="http://logopond.com/">Logopond</a> - Modelos de logotipos para ajudar os designers a ter uma inspira&ccedil;&atilde;o.</p>
</div>
  <footer>
    <a rel="full-article" href="/2007/03/12/dicas-de-sites/">Read on &rarr;</a>
  </footer>


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/12/deixe-as-imagens-do-seu-site-mais-bonitas-usando-flash/">Deixe as imagens do seu site mais bonitas usando flash</a></h1>
    
    
      <p class="meta">




<time datetime="2007-03-12 00:00:00 -0300" pubdate  updated >Mar 12<span>th</span>, 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p>O <a href="http://www.swfir.com/" title="swfIr" target="_blank">swfIR</a> (swf Image Replacement) promete acabar com as limita&ccedil;&otilde;es de tratamento de imagens no seu site. Usando flash e javascript a ferramenta permite que voc&ecirc; aplique efeitos visuais interessantes nas imagens.</div>
  <footer>
    <a rel="full-article" href="/2007/03/12/deixe-as-imagens-do-seu-site-mais-bonitas-usando-flash/">Read on &rarr;</a>
  </footer>


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/11/profissionais-liberais-e-consultores-nao-podem-ficar-doentes/">Profissionais liberais e consultores não podem ficar doentes</a></h1>
    
    
      <p class="meta">




<time datetime="2007-03-11 00:00:00 -0300" pubdate  updated >Mar 11<span>th</span>, 2007</time>


</p>
    
  </header>


  <div class="entry-content"><img src="http://www.nomedojogo.com/wp-content/uploads/2007/03/ab1py1.jpg" title="Acidente" alt="Acidente" align="left" />Li um artigo no <a href="http://www.efetividade.net/2007/03/07/como-voce-e-sua-empresa-lidam-com-ausencias-por-doenca/" title="Efetividade.net" target="_blank">efetividade.net</a> que me fez lembrar de algo interessante. O artigo considerava o fato de ser muito mais produtivo um funcion&aacute;rio doente ficar em casa e se recuperar, do que ir trabalhar nestas condi&ccedil;&otilde;es e &quot;contaminar&quot; o ambiente de trabalho com sua doen&ccedil;a e/ou indisposi&ccedil;&atilde;o.

H&aacute; alguns anos atr&aacute;s me lembro de um caso inusitado onde um funcion&aacute;rio da empresa onde trabalhava foi atropelado e teve uma perna e bra&ccedil;o quebrados. Acontece que alguns dias depois do incidente, o funcion&aacute;rio apareceu na empresa, com os dois bra&ccedil;os engessados e com uma muleta, pronto para o trabalho! Uma cena rid&iacute;cula!

Claro que n&atilde;o o deixaram trabalhar e mandaram-no para casa. Mas, por que uma pessoa nestas condi&ccedil;&otilde;es ainda queria trabalhar?</div>
  <footer>
    <a rel="full-article" href="/2007/03/11/profissionais-liberais-e-consultores-nao-podem-ficar-doentes/">Read on &rarr;</a>
  </footer>


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/10/a-crise-do-clima/">A crise do clima</a></h1>
    
    
      <p class="meta">




<time datetime="2007-03-10 00:00:00 -0300" pubdate  updated >Mar 10<span>th</span>, 2007</time>


</p>
    
  </header>


  <div class="entry-content"><img src="http://www.nomedojogo.com/wp-content/uploads/2007/03/3220e.jpg" title="Aquecimento Global" alt="Aquecimento Global" align="left" />Aquecimento global &eacute; f&aacute;cil de explicar agora, depois que vi o document&aacute;rio <a href="http://www.nomedojogo.com/?p=7" title="Uma verdade incoveniente" target="_blank">Uma verdade inconveniente </a>de Al Gore.

Mas o que EU posso fazer para ajudar? Esperar os governantes resolverem o problema? A vida real &eacute; bem diferente de Hollywood. O fim pode ser desastroso. Veja uma lista triste de conseq&uuml;&ecirc;ncias para este fen&ocirc;meno no <a href="http://pt.wikipedia.org/wiki/Aquecimento_global#Curiosidades" title="Curiosidades sobre aquecimento global" target="_blank">wikipedia</a>.

O que voc&ecirc; vai fazer a respeito?

Est&aacute; pronto para mudar sua forma de viver?
A crise do clima pode ser resolvida.

Aqui diz como come&ccedil;ar:</div>
  <footer>
    <a rel="full-article" href="/2007/03/10/a-crise-do-clima/">Read on &rarr;</a>
  </footer>


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/09/estranhos-conhecidos/">Estranhos conhecidos</a></h1>
    
    
      <p class="meta">




<time datetime="2007-03-09 00:00:00 -0300" pubdate  updated >Mar 9<span>th</span>, 2007</time>


</p>
    
  </header>


  <div class="entry-content"><img align="left" src="http://www.nomedojogo.com/wp-content/uploads/2007/03/untitled.bmp" alt="Estranhos conhecidos" title="Estranhos conhecidos" />Uma vez li um artigo que diz que em apenas um dia de nossas vidas, vemos mais pessoas que um campon&ecirc;s da idade-m&eacute;dia veria durante toda sua exist&ecirc;ncia.
Quantas pessoas entram e saem de um vag&atilde;o de trem?
Eu recorro ao trem todos os dias como meio de transporte para vir ao trabalho.
As pessoas na esta&ccedil;&atilde;o caminham silenciosas lado a lado.
O que pensam? Para onde v&atilde;o?
&#8220;Cada um traz consigo sua pr&oacute;pria dor e todos t&ecirc;m seus pr&oacute;prios sonhos e temores&#8221;
Olho pela janela do vag&atilde;o.
A cidade inteira parece caminhar sozinha.
O trem chega todos os dias no mesmo hor&aacute;rio.
Ele n&atilde;o atrasa, a n&atilde;o ser em dias de chuva.
Hoje ele n&atilde;o atrasou.
Sento-me todos os dias no mesmo lugar e vejo as mesmas pessoas.
Elas est&atilde;o comigo de segunda a sexta.
Eu mal vejo meu irm&atilde;o e minha m&atilde;e todos os dias..
Conhe&ccedil;o seus rostos, seus h&aacute;bitos, sei o que l&ecirc;em.
Vejo onde elas descem e quem as espera.
Mas quem &eacute;?
Eu n&atilde;o saberia dizer um nome sequer.
N&atilde;o h&aacute; &#8220;bom dia, como vai?&#8221;
Eu silenciosamente as observo.</div>
  <footer>
    <a rel="full-article" href="/2007/03/09/estranhos-conhecidos/">Read on &rarr;</a>
  </footer>


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/08/y-%25e2%2580%2593-o-ultimo-homem/">Y - O Último Homem</a></h1>
    
    
      <p class="meta">




<time datetime="2007-03-08 00:00:00 -0300" pubdate  updated >Mar 8<span>th</span>, 2007</time>


</p>
    
  </header>


  <div class="entry-content"><img border="0" src="http://bp2.blogger.com/_qPFTWwym1uQ/RfBQUCnobeI/AAAAAAAAATc/NuVFW5i4SGY/s400/y_the_last_man_16.jpg" style="float: left; margin: 0pt 10px 10px 0pt" id="BLOGGER_PHOTO_ID_5039616288258289122" />Yorick Brown, um homem como qualquer outro (apesar de que n&atilde;o concordo que os homens sejam todos iguais), tem seu trabalho, uma noiva e um macaquinho de estima&ccedil;&atilde;o (Ampersand). At&eacute; o dia em que de um uma forma s&uacute;bita, o que aparenta ser uma praga mata todos os mam&iacute;feros com cromossomo Y (entenda-se machos) da terra, incluindo embri&otilde;es e at&eacute; mesmo espermatoz&oacute;ides, com exce&ccedil;&atilde;o de Yorick e seu macaco.

&Eacute; assim que come&ccedil;a a trama desenvolvida por <span style="font-weight: bold">Brian K. Vaughan</span> e desenhada por <span style="font-weight: bold">Pia Guerra</span>.

Imaginem, um mundo s&oacute; com mulheres! No quadrinho, o personagem sai em busca da sua noiva que estava em uma expedi&ccedil;&atilde;o na Austr&aacute;lia, e acaba se envolvendo em um jogo pol&iacute;tico para descobrir a &quot;cura&quot;.

Yorick &eacute; extremamente fiel, mas como se manter assim num mundo onde voc&ecirc; &eacute; o &uacute;ltimo homem?

E o que dizer do resto do mundo? Ao contrario do que podem parecer, as guerras e viol&ecirc;ncia continuam. Grupos de &quot;Amazonas&quot; (mulheres que acreditam que a morte dos homens foi uma providencia divina) espalham o terror, uma corrida armamentista se inicia atr&aacute;s do &uacute;ltimo homem.
<a href="http://bp0.blogger.com/_qPFTWwym1uQ/RfBQvinobgI/AAAAAAAAATs/mib_z8Ccleo/s1600-h/y-thelastman.gif" onblur="try {parent.deselectBloggerImageGracefully();} catch(e) {}"><img border="0" src="http://bp0.blogger.com/_qPFTWwym1uQ/RfBQvinobgI/AAAAAAAAATs/mib_z8Ccleo/s200/y-thelastman.gif" style="float: right; margin: 0pt 0pt 10px 10px; cursor: pointer" id="BLOGGER_PHOTO_ID_5039616760704691714" /></a>
A religi&atilde;o fica sem seus principais instigadores, j&aacute; que todos os padres, mu&ccedil;ulmanos, pastores, etc. morreram.

At&eacute; onde um mundo s&oacute; de mulheres pode chegar? Quais seriam as conseq&uuml;&ecirc;ncias? Quem abrir&aacute; os potes de maionese de agora em diante?

Uma leitura din&acirc;mica e agrad&aacute;vel, com um tema novo e interessante. O autor promete que a saga durar&aacute; 60 edi&ccedil;&otilde;es. Pela internet voc&ecirc; pode encontrar at&eacute; a edi&ccedil;&atilde;o 46 em portugu&ecirc;s.
</div>
  <footer>
    <a rel="full-article" href="/2007/03/08/y-%25e2%2580%2593-o-ultimo-homem/">Read on &rarr;</a>
  </footer>


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/08/hello-world/">A origem do dia da mulher</a></h1>
    
    
      <p class="meta">




<time datetime="2007-03-08 00:00:00 -0300" pubdate  updated >Mar 8<span>th</span>, 2007</time>


</p>
    
  </header>


  <div class="entry-content"><img border="0" src="http://bp1.blogger.com/_qPFTWwym1uQ/RfBHhynobdI/AAAAAAAAATU/BZ268QsWl_0/s400/untitled.bmp" style="float: left; margin: 0pt 10px 10px 0pt" id="BLOGGER_PHOTO_ID_5039606628876840402" />O dia 8 de Mar&ccedil;o &eacute;, desde 1975, comemorado pelas Na&ccedil;&otilde;es Unidas como Dia Internacional da Mulher Neste dia, do ano de 1857, as oper&aacute;rias t&ecirc;xteis de uma f&aacute;brica de Nova Iorque entraram em greve ocupando a f&aacute;brica, para reivindicarem a redu&ccedil;&atilde;o de um hor&aacute;rio de mais de 16 horas por dia para 10 horas. Estas oper&aacute;rias, que recebiam menos de um ter&ccedil;o do sal&aacute;rio dos homens, foram fechadas na f&aacute;brica onde, se diz que os donos e os policiais as assassinaram, queimando a fabrica, e se declara que cerca de 130 mulheres morreram queimadas.

Em 1903, profissionais liberais norte-americanas criaram a Women&#8217;s Trade Union League. Esta associa&ccedil;&atilde;o tinha como principal objetivo ajudar todas as trabalhadoras a exigirem melhores condi&ccedil;&otilde;es de trabalho. Em 1908, mais de 14 mil mulheres marcharam nas ruas de Nova Iorque: reivindicaram o mesmo que as oper&aacute;rias no ano de 1857, bem como o direito de voto. Caminhavam com o slogan &#8220;P&atilde;o e Rosas&#8221;, em que o p&atilde;o simbolizava a estabilidade econ&ocirc;mica e as rosas uma melhor qualidade de vida. Em 1910, numa confer&ecirc;ncia internacional de mulheres realizada na Dinamarca, foi decidido, em homenagem &agrave;quelas mulheres, comemorar o 8 de Mar&ccedil;o como &#8220;Dia Internacional da Mulher&#8221;.</div>
  <footer>
    <a rel="full-article" href="/2007/03/08/hello-world/">Read on &rarr;</a>
  </footer>


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/07/transforme-suas-imagens-em-obras-de-arte-ascii/">Transforme suas imagens em obras de arte ASCII</a></h1>
    
    
      <p class="meta">




<time datetime="2007-03-07 00:00:00 -0300" pubdate  updated >Mar 7<span>th</span>, 2007</time>


</p>
    
  </header>


  <div class="entry-content"><a href="http://bp3.blogger.com/_qPFTWwym1uQ/Re8HMNqShKI/AAAAAAAAATM/ja5djwEBWto/s1600-h/imagens.jpg" onblur="try {parent.deselectBloggerImageGracefully();} catch(e) {}"><img src="http://bp3.blogger.com/_qPFTWwym1uQ/Re8HMNqShKI/AAAAAAAAATM/ja5djwEBWto/s400/imagens.jpg" style="margin: 0px auto 10px; display: block; text-align: center; cursor: pointer" id="BLOGGER_PHOTO_ID_5039254414457734306" border="0" /></a>

O site <a href="http://www.glassgiant.com/">GlassGiant.com</a> disponibilizou uma ferramenta bem divertida, um Conversor de imagens para texto <font style="font-weight: bold">ASCII</font>. Voc&ecirc; pode enviar uma foto ou informar o caminho dela na internet e o gerador abre uma p&aacute;gina com a foto no formato texto.

&Eacute; bem legal para se colocar fotos em f&oacute;runs ou e-mails.

Para usar acessar o site <a href="http://www.glassgiant.com/ascii/">clique aqui</a>.
</div>
  <footer>
    <a rel="full-article" href="/2007/03/07/transforme-suas-imagens-em-obras-de-arte-ascii/">Read on &rarr;</a>
  </footer>


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/07/o-mundo-esta-pegando-fogo/">O mundo esta pegando fogo&#8230;</a></h1>
    
    
      <p class="meta">




<time datetime="2007-03-07 00:00:00 -0300" pubdate  updated >Mar 7<span>th</span>, 2007</time>


</p>
    
  </header>


  <div class="entry-content"><img border="0" src="http://bp3.blogger.com/_qPFTWwym1uQ/Re775dqShJI/AAAAAAAAATE/KC_eZHKgYas/s400/imagens.png" style="display: block; margin: 0px auto 10px; text-align: center" id="BLOGGER_PHOTO_ID_5039241997707281554" />
Ao assistir o filme diamante de sangue fiquei chocado ao ver o treinamento para tornar crian&ccedil;as em assassinos sem sentimentos.
O que acontece no mundo?
Porque essas coisas s&atilde;o t&atilde;o pouco noticiadas?

Eu chego em casa e ligo a TV, esta sempre passando um videoclipe de algum cantor de Black.
Nada contra o estilo musical, mas algu&eacute;m j&aacute; parou para pensar no estilo de vida que eles cultuam?
Carr&otilde;es, mans&otilde;es, brincos, pulseiras, colares e at&eacute; uma coisa nojenta nos dentes, tudo de ouro.
Mulheres e muita vontade de dizer &#8220;eu sou o cara&#8221;.
Um v&iacute;deo Clipe destes custa no m&iacute;nimo $ 150.000.
OK estamos falando em mais ou menos meio milh&atilde;o de reais.

O que daria pra fazer com esse dinheiro?

A cantora canadense Sarah Mclachlan junto com a diretora Sophie Muller, deram uma resposta a esta quest&atilde;o no videoclipe World on Fire, que custou a incr&iacute;vel soma de $ 15.
O clipe j&aacute; tem algum tempo, mas todos fariam bem em assistir ao menos uma vez&#8230;

A l&oacute;gica &eacute; simples.
$150.000 podem fazer a diferen&ccedil;a para 1.000.000 de pessoas no mundo todo.
Acha dif&iacute;cil?
Veja s&oacute; alguns exemplos:

Um dia de um produtor assistente custa $ 200,00 = 100 crian&ccedil;as na escola na Eti&oacute;pia.
Maquiagem e cabelo custam $ 5.000 = 1 ano de escola para 145 meninas no Afeganist&atilde;o.
Supervisor Produtor custa $ 3.500 = Tiraria 70 crian&ccedil;as da guerra em Serra Leoa.
Um dia de aluguel em um set em L.A = Poderia ajudar 10.950 crian&ccedil;as de rua em Calcut&aacute;.
Departamento de c&acirc;mera $ 15.000 = Uma ambul&acirc;ncia que faria a diferen&ccedil;a para 150.000 pessoas na &iacute;ndia.
Produ&ccedil;&atilde;o Final $ 7.500 = Seis meses de medicamentos para 5.000 pacientes na &Aacute;frica.

O clipe ainda mostra uma m&atilde;e em gana que trabalha em dois empregos, 16 horas por dia, 7dias na semana para tentar manter o seu filho na escola por um ano.
Em um dos empregos ela vende laranjas. 50 laranjas rendem $1.

Ok, n&atilde;o estou falando que todo mundo deveria vender tudo que tem e doar, (o que n&atilde;o seria um id&eacute;ia t&atilde;o ruim &#8230;) mas poder&iacute;amos repensar sobre o estilo de vida que almejamos, e estar satisfeitos com o muito que temos.
D&uacute;vida que &eacute; muito?
Assista ao v&iacute;deo clipe&#8230;


<object height="350" width="425"><param name="movie" value="http://www.youtube.com/v/hzoNInZ2ClQ"><param name="wmode" value="transparent"><embed src="http://www.youtube.com/v/hzoNInZ2ClQ" type="application/x-shockwave-flash" wmode="transparent" height="350" width="425" /></object>
</div>
  <footer>
    <a rel="full-article" href="/2007/03/07/o-mundo-esta-pegando-fogo/">Read on &rarr;</a>
  </footer>


  </article>

<nav role="pagination">
  <div>
    
      <a class="prev" href="/page82/">&larr; Older</a>
    
    <a href="/blog/archives">Blog Archives</a>
    
      <a class="next" href="/page80/">Newer &rarr;</a>
    
  </div>
</nav>

<script type="text/javascript">
    var disqus_shortname = 'carlosbrando';
    (function () {
      var s = document.createElement('script'); s.async = true;
      s.type = 'text/javascript';
      s.src = 'http://' + disqus_shortname + '.disqus.com/count.js';
      (document.getElementsByTagName('HEAD')[0] || document.getElementsByTagName('BODY')[0]).appendChild(s);
    }());
</script>

</div>
<aside role=sidebar>
  
    <section>
  <h1>Recent Posts</h1>
  <ul id="recent_posts">
    
      <li class="post">
        <a href="/2011/06/13/a-regra-direita-esquerda-do-c/">A Regra Direita-Esquerda do C</a>
      </li>
    
      <li class="post">
        <a href="/2011/06/03/colorific/">Colorific</a>
      </li>
    
      <li class="post">
        <a href="/2011/03/29/quem-disse-que-gravar-um-podcast-e-facil/">Quem disse que gravar um podcast é fácil?</a>
      </li>
    
      <li class="post">
        <a href="/2011/03/24/convite-para-o-grok-podcast/">Convite para o Grok Podcast!</a>
      </li>
    
      <li class="post">
        <a href="/2011/02/08/quatro-anos-de-nome-do-jogo/">Quatro anos de Nome do Jogo</a>
      </li>
    
  </ul>
</section>

<section>
  <h1>Latest Tweets</h1>
  <ul id="tweets">
    <li class="loading">Status updating&#8230;</li>
  </ul>
  <script type="text/javascript">
    $.domReady(function(){
      getTwitterFeed("carlosbrando", 4, false);
    });
  </script>
  <script src="/javascripts/twitter.js" type="text/javascript"> </script>
  
    <a href="http://twitter.com/carlosbrando" class="twitter-follow-button" data-width="208px" data-show-count="false">Follow @carlosbrando</a>
  
</section>




  
</aside>

    </div>
  </div>
  <footer><p>
  Copyright &copy; 2011 - Carlos Brando -
  <span class="credit">Powered by <a href="http://octopress.org">Octopress</a></span>
</p>

</footer>
</body>
</html>
