
<!DOCTYPE html>
<!--[if IEMobile 7 ]><html class="no-js iem7"><![endif]-->
<!--[if lt IE 9]><html class="no-js lte-ie8"><![endif]-->
<!--[if (gt IE 8)|(gt IEMobile 7)|!(IEMobile)|!(IE)]><!--><html class="no-js" lang="en"><!--<![endif]-->
<head>
  <meta charset="utf-8">
  <title>Nome do Jogo</title>
  <meta name="author" content="Carlos Brando">
  

  <!-- http://t.co/dKP3o1e -->
  <meta name="HandheldFriendly" content="True">
  <meta name="MobileOptimized" content="320">
  <meta name="viewport" content="width=device-width, initial-scale=1">

  

  <link rel="canonical" href="http://nomedojogo.com/page/77/index.html"/>
  <link href="/favicon.png" rel="shortcut icon" />
  <link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
  <script src="/javascripts/modernizr-2.0.js"></script>
  <script src="http://s3.amazonaws.com/ender-js/jeesh.min.js"></script>
  <script src="/javascripts/octopress.js" type="text/javascript"></script>
  <link href="http://feeds2.feedburner.com/NomeDoJogo" rel="alternate" title="Nome do Jogo" type="application/atom+xml"/>
  
  <script type="text/javascript">
    var _gaq = _gaq || [];
    _gaq.push(['_setAccount', 'UA-1249636-1']);
    _gaq.push(['_trackPageview']);

    (function() {
      var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
      ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
      var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
    })();
  </script>


  
  <script type="text/javascript">
    (function() {
      var script = document.createElement('script'); script.type = 'text/javascript'; script.async = true;
      script.src = 'https://apis.google.com/js/plusone.js';
      var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(script, s);
    })();
  </script>


  
  <script type="text/javascript">
    (function(){
      var twitterWidgets = document.createElement('script');
      twitterWidgets.type = 'text/javascript';
      twitterWidgets.async = true;
      twitterWidgets.src = 'http://platform.twitter.com/widgets.js';
      document.getElementsByTagName('head')[0].appendChild(twitterWidgets);
    })();
  </script>


  <!--Fonts from Google's Web font directory at http://google.com/webfonts -->
<link href='http://fonts.googleapis.com/css?family=PT+Serif:regular,italic,bold,bolditalic' rel='stylesheet' type='text/css'>
<link href='http://fonts.googleapis.com/css?family=PT+Sans:regular,italic,bold,bolditalic' rel='stylesheet' type='text/css'>

</head>

<body  >
  <header><hgroup>
  <h1><a href="/">Nome do Jogo</a></h1>
  
    <h2>por Carlos Brando</h2>
  
</hgroup>

</header>
  <nav role=navigation><ul role=subscription data-subscription="rss">
  <li><a href="http://feeds2.feedburner.com/NomeDoJogo" rel="subscribe-rss" title="assine via RSS">RSS</a></li>
  
</ul>
<form action="http://google.com/search" method="get">
  <fieldset role="site-search">
    <input type="hidden" name="q" value="site:nomedojogo.com" />
    <input class="search" type="text" name="q" results="0" placeholder="Pesquisar"/>
  </fieldset>
</form>
<ul role=main-navigation>
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Arquivo</a></li>
</ul>

</nav>
  <div id="main">
    <div id="content">
      <div class="blog-index">



  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/05/16/alteracao-no-layout-do-carreirati/">Alteração no layout do carreiraTI</a></h1>
    
    
      <p class="meta">




<time datetime="2007-05-16 00:00:00 -0300" pubdate  updated >16 de Maio de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p>O <a href="http://www.carreirati.com">carreiraTI</a> est&aacute; em constante evolu&ccedil;&atilde;o. Tenho mil id&eacute;ias na cabe&ccedil;a, mas n&atilde;o posso trocar os p&eacute;s pelas m&atilde;os. Preciso ir com calma e fazendo somente o que for necess&aacute;rio.</p>

<p>Hoje fiz uma grande altera&ccedil;&atilde;o na interface do site. Desta vez deve ser definitiva, pois j&aacute; deixei tudo preparado para o que pretendo fazer.</p>

<p>O <strong>Ruby on Rails</strong> &eacute; excelente para altera&ccedil;&otilde;es deste tipo. Todo o c&oacute;digo est&aacute; separado em outro arquivo e &eacute; muito f&aacute;cil mudar o layout HTML sem afetar nada.</p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/05/15/construa-software-com-seu-proprio-dinheiro/">Construa software com seu próprio dinheiro</a></h1>
    
    
      <p class="meta">




<time datetime="2007-05-15 00:00:00 -0300" pubdate  updated >15 de Maio de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/05/tired.jpg" title="tired.jpg" alt="tired.jpg" align="right" />Seguindo a linha do &uacute;ltimo post. Para construir software para voc&ecirc; mesmo, um  ponto importante &eacute;: use o seu dinheiro para isto.</p>

<p>Existe uma grande desvantagem em adquirir fundos de investidores: eles querem  o dinheiro de volta. Isto gera um grau de responsabilidade muito grande no seu  desenvolvimento. Voc&ecirc; ser&aacute; pressionado a dar resultados.</p>

<p>O segredo do grande software &eacute; a paix&atilde;o. J&aacute; trabalhei em muitos projetos  durante minha vida, e posso dizer que s&oacute; escrevi software de qualidade quando  estava apaixonado pelo que estava fazendo. Quando realmente se tem vontade de  desenvolver algo, voc&ecirc; se preocupa com os detalhes, faz c&oacute;digo bonito e limpo. E  isto n&atilde;o &eacute; verdade quando se desenvolve apenas pelo sal&aacute;rio.</p>

<p>Quando estiver desenvolvendo algo por conta pr&oacute;pria, evite a todo custo  aceitar dinheiro de fora, por mais tentador que isto possa parecer. Ningu&eacute;m vai  lhe dar dinheiro de gra&ccedil;a, ele v&atilde;o se meter no seu software.</p>

<p>Fa&ccedil;a meio software, mas n&atilde;o fa&ccedil;a um software meia boca. O que voc&ecirc; consegue  fazer em suas horas vagas, depois do trabalho? Fa&ccedil;a! Acredite, &eacute; muito mais  dif&iacute;cil divulgar e vender o que voc&ecirc; fez, do que termin&aacute;-lo. Fa&ccedil;a o necess&aacute;rio e  deixe as pessoas usarem, assim voc&ecirc; pode medir as rea&ccedil;&otilde;es e a aceita&ccedil;&atilde;o.</p>

<p>Foi assim que constru&iacute; o <a href="http://www.carreirati.com">carreiraTI</a>. E posso garantir que estou tendo muito  mais dificuldade para divulgar o site do que tive para faz&ecirc;-lo. Mas tudo bem!</p>

<p>N&atilde;o estou ganhando nada, mas tamb&eacute;m n&atilde;o devo para ningu&eacute;m.</p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/05/11/construa-software-para-voce-mesmo/">Construa software para você mesmo</a></h1>
    
    
      <p class="meta">




<time datetime="2007-05-11 00:00:00 -0300" pubdate  updated >11 de Maio de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/05/d176.JPG" title="d176.JPG" alt="d176.JPG" align="right" />J&aacute; faz alguns anos que trabalho com programa&ccedil;&atilde;o e todas as vezes que precisei mudar de emprego, sempre usei o mesmo site de ofertas de empregos. E confesso que fui bem sucedido em todos os casos.</p>

<p>Acontece que este site (se voc&ecirc; trabalha com inform&aacute;tica, voc&ecirc; j&aacute; sabe qual &eacute;) n&atilde;o sofre uma atualiza&ccedil;&atilde;o por pelo menos unsÂ 5 ouÂ 6 anos. Isto &eacute; muito para a internet. Este site n&atilde;o possui nem mesmo um mecanismo simples de busca (conseguiram complicar at&eacute; isto) e as vagas oferecidas s&oacute; duram um dia.</p>

<p>Depois de muitas sugest&otilde;es dadas e nenhuma ouvida, decidi que estava na hora de fazer algo a respeito: Construir software para mim mesmo.</p>

<p>Eu queria um site de empregos para profissionais de tecnologia que me oferecesse recursos importantes, como pelo menos um sistema de busca que funcione.</p>

<p>Em apenas duas semanas, trabalhando nas horas de folga criei o <a href="http://www.carreirati.com" target="_blank">carreiraTI</a>. &Eacute; um site simples, que permite o cadastro de vagas e pesquisa. Para exibi&ccedil;&atilde;o usei o mesmo conceito de blog, j&aacute; bem conhecido. O site &eacute; totalmente gr&aacute;tis e n&atilde;o precisa de nenhum cadastro para enviar curr&iacute;culos.</p>

<p>Apenas 4 dias depois do lan&ccedil;amento, percebi que n&atilde;o era apenas eu que estava precisando disto, o site j&aacute; ultrapassa a margem de 1.000 visitas di&aacute;rias e tem mais de 100 ofertas de emprego cadastradas. Tudo isto em 4 dias.</p>

<p>Criei software para mim mesmo e n&atilde;o &eacute; que ele serve para voc&ecirc; tamb&eacute;m?</p>

<p><a href="http://www.carreirati.com">Para conhecer o carreiraTI, clique aqui!</a></p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/05/10/paginando-com-estilo/">Paginando com estilo</a></h1>
    
    
      <p class="meta">




<time datetime="2007-05-10 00:00:00 -0300" pubdate  updated >10 de Maio de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p>Acho legal a implementa&ccedil;&atilde;o do Rails para pagina&ccedil;&atilde;o. O problema &eacute; que n&atilde;o d&aacute; para formatar direito o paginador usando CSS ou outros meios.</p>

<p>Mas&#8230; &eacute; muito f&aacute;cil criar um paginador personalizado.</p>

<center><img src="http://old.nomedojogo.com/wp-content/uploads/2007/05/windowslivewriterpaginandocomestilo-cee5pagination3.jpg" height="44" width="356" /></center>


<p>No meu caso, criei um m&eacute;todo chamado <strong>pagination_links_with_css</strong> em um dos helpers da minha aplica&ccedil;&atilde;o.Meu c&oacute;digo ficou assim:
[source:ruby]
  def pagination_links_with_css(paginator, options={}, html_options={})</p>

<pre><code>name = options[:name] || ActionView::Helpers::PaginationHelper::DEFAULT_OPTIONS[:name]
params = (options[:params] || ActionView::Helpers::PaginationHelper::DEFAULT_OPTIONS[:params]).clone

options[:link_to_current_page] = true
atual_page = options[:atual_page] || 1

pagination_links_each(paginator, options) do |n|
  params[name] = n

  if n.to_s.to_i == atual_page.to_i
    "&lt;span class='current'&gt;#{n.to_s}&lt;/span&gt;"
  else
    link_to("#{n.to_s}", params, html_options)
  end
end
</code></pre>

<p>  end
[/source]</p>

<p>O que fa&ccedil;o &eacute; bem simples. Como preciso pegar a p&aacute;gina corrente, deixo a op&ccedil;&atilde;o link_to_current_page como verdadeira. Tamb&eacute;m recupero o n&uacute;mero da p&aacute;gina atual (:atual_page) que informo na chamada do m&eacute;todo na view (neste ponto chamo aten&ccedil;&atilde;o, porque n&atilde;o consegui recuperar este valor de outra forma, voc&ecirc; sabe como?).</p>

<p>Ent&atilde;o, percorro todas as p&aacute;ginas e posso formatar o retorno de cada uma da maneira como desejo (&#8220;&lt;span class=&#8217;current&#8217;&gt;#{n.to_s}&lt;/span&gt;&#8221;).</p>

<p>No view, a &uacute;nica coisa que tenho de fazer &eacute; chamar o m&eacute;todo novo:</p>

<p>[source:ruby]
&lt;%= pagination_links_with_css @job_pages, {:window_size =&gt; 10, :atual_page =&gt; params[:page] } %&gt;
[/source]</p>

<p>&Eacute; por isto que sou um entusiasta do Rails. Mesmo quando o framework n&atilde;o pode fazer algo, &eacute; muito f&aacute;cil implementar.</p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/05/09/extraindo-trechos-de-texto-de-um-arquivo/">Extraindo trechos de texto de um arquivo</a></h1>
    
    
      <p class="meta">




<time datetime="2007-05-09 00:00:00 -0300" pubdate  updated > 9 de Maio de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p>O problema era o seguinte: Tenho um arquivo de texto com um monte de  informa&ccedil;&otilde;es in&uacute;teis e precisava ler este arquivo e retirar o texto que me  interessa, gravando em outro arquivo.</p>

<p>Para ler um arquivo de texto &eacute; f&aacute;cil:
[source:ruby]
f = File.open(&#8220;arquivo.txt&#8221;)
begin
  linhas = f.readlines
  todas_linhas = linhas.join
end
f.close
[/source]</p>

<p>Pronto agora tenhos o arquivo inteiro na string <strong>todas_linhas</strong>. O pr&oacute;ximo passo &eacute; localizar o texto que preciso extrair.</p>

<p>Dentro do bloco begin..end:
[source:ruby]
  retorno = &#8220;&#8221;
  todas_linhas.scan /regular_expression/ do |texto|</p>

<pre><code>retorno = "#{retorno}#{texto}\n"
</code></pre>

<p>  end
[/source]
Pronto! A vari&aacute;vel retorno j&aacute; cont&eacute;m somente o texto que me interessa.</p>

<p>O m&eacute;todo <strong>scan</strong> varre toda a string procurando por valores que combinem com a regular expression passada. Eu simplesmente pego este valor e separo.</p>

<p>No fim para gravar um novo arquivo&#8230;
[source:ruby]
  x = File.new(&#8220;retorno.txt&#8221;, File::CREAT|File::TRUNC|File::RDWR, 0644)
  begin</p>

<pre><code>x.puts retorno
</code></pre>

<p>  end
  x.close
[/source]</p>

<p>Conhece um jeito mais f&aacute;cil? Comenta a&iacute;!</p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/05/08/meses-em-portugus-no-rails-parte-2/">Meses em português no Rails - parte 2</a></h1>
    
    
      <p class="meta">




<time datetime="2007-05-08 00:00:00 -0300" pubdate  updated > 8 de Maio de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p>Dois amigos se pronunciaram e compartilharam suas id&eacute;ias sobre qual a melhor forma de se ajustar o m&eacute;todo strftime para trabalhar com datas em portugu&ecirc;s.</p>

<p>O primeiro foi o <a href="http://leonardofaria.net/2007/05/06/manipulando-datas-no-rails/">Leonardo Faria</a> que publicou no seu blog (<a href="http://leonardofaria.net/2007/05/06/manipulando-datas-no-rails/">clique aqui</a>) uma solu&ccedil;&atilde;o melhor que a minha.</p>

<p>Mas, a melhor op&ccedil;&atilde;o em minha opini&atilde;o foi a sugest&atilde;o dada pelo <a href="http://www.arthurgeek.net/">Arthur</a>:
[source:ruby]silence_warnings do</p>

<pre><code>Date::MONTHNAMES = [nil] + %w(Janeiro Fevereiro Mar&amp;ccedil;o Abril Maio Junho Julho Agosto Setembro Outubro Novembro Dezembro)
Date::DAYNAMES = %w(Domingo Segunda-Feira Ter&amp;ccedil;a-Feira Quarta-Feira Quinta-Feira Sexta-Feira S&amp;aacute;bado)
Date::ABBR_MONTHNAMES = [nil] + %w(Jan Fev Mar Abr Mai Jun Jul Aug Set Out Nov Dez)
Date::ABBR_DAYNAMES = %w(Dom Seg Ter Qua Qui Sex Sab)

Time::MONTHNAMES = Date::MONTHNAMES
Time::DAYNAMES = Date::DAYNAMES
Time::ABBR_MONTHNAMES = Date::ABBR_MONTHNAMES
Time::ABBR_DAYNAMES = Date::ABBR_DAYNAMES
</code></pre>

<p>end[/source]</p>

<p>Este c&oacute;digo funcionou e considerei o menos intrusivo. Por isto a melhor op&ccedil;&atilde;o!</p>

<p>Obrigado pela ajuda amigos!</p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/05/07/carreirati-veja-ofertas-de-emprego-da-mesma-cidade/">carreiraTI: veja ofertas de emprego da mesma cidade</a></h1>
    
    
      <p class="meta">




<time datetime="2007-05-07 00:00:00 -0300" pubdate  updated > 7 de Maio de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p>Sei que muita gente ainda n&atilde;o conhece o <a href="http://www.carreirati.com/">carreiraTI</a>. Basicamente &eacute; um site <a href="http://www.carreirati.com/">de empregos</a> para a &aacute;rea de tecnologia em geral (programadores, t&eacute;cnicos, designers, analistas, gerentes, administradores de banco de dados, etc..).</p>


<p> <p>Inclu&iacute; hoje uma nova funcionalidade hoje: ao ver uma vaga de emprego, voc&ecirc; pode clicar no link da cidade e ver apenas as ofertas da mesma cidade.  <p> <center><a href="http://old.nomedojogo.com/wp-content/uploads/2007/05/windowslivewritercarreirativejaofertasdeempregodamesmacid-7aaduntitled15.jpg" atomicselection="true"><img style="border-right: 0px; border-top: 0px; border-left: 0px; border-bottom: 0px" height="128" src="http://old.nomedojogo.com/wp-content/uploads/2007/05/windowslivewritercarreirativejaofertasdeempregodamesmacid-7aaduntitled-thumb13.jpg" width="432" border="0"></a></center> <p></p> <p>Uma funcionalidade simples, mas que agiliza o processo de busca.  <p>Muita coisa ainda precisa ser feita. Mas tudo no seu tempo.  <p>Come&ccedil;amos&nbsp;a funcionar na quinta-feira passada e j&aacute; temos pelo menos uma d&uacute;zia de vagas.  <p>Quem ainda n&atilde;o conhece <a href="http://www.carreirati.com/">clique aqui</a> e quem sabe n&atilde;o tem alguma vaga que te interesse.</p></p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/05/05/meses-em-portugus-no-rails/">Meses em português no Rails</a></h1>
    
    
      <p class="meta">




<time datetime="2007-05-05 00:00:00 -0300" pubdate  updated > 5 de Maio de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/writer/MesesemportugusnoRails_E4B3/img_6596_1_1.jpg" style="border-width: 0px" align="right" border="0" height="180" width="240" /> Um dos maiores problemas que encontro quando crio algo com o Ruby on Rails &eacute; a falta de uma internacionaliza&ccedil;&atilde;o nos componentes existentes.</p>

<p>Ent&atilde;o, vivo tendo de criar ou alterar algo para funcionar do jeito que preciso.</p>

<p>No meu site (<a href="http://www.carreirati.com/">carreiraTI</a>) eu queria exibir a abrevia&ccedil;&atilde;o do m&ecirc;s em que a oferta de emprego foi publicada. Para isto bastaria usar o m&eacute;todo <strong>strftime</strong> do pr&oacute;prio objeto <strong>Time</strong>.
[source:ruby]t.strftime(&#8220;%b&#8221;)[/source]
Isto funciona desde que seu site seja em ingl&ecirc;s. O que n&atilde;o &eacute; o meu caso.</p>

<p>Pesquisei as bibliotecas do pr&oacute;prio Ruby para ver como este m&eacute;todo funcionava, e encontrei a seguinte constante:
[source:ruby]ABBR_MONTHNAMES = [nil] + %w(Jan Fev Mar Abr Mai Jun Jul Ago Set Out Nov Dez)[/source]
O problema aqui &eacute; n&atilde;o quero alterar as classes originais do Ruby e tamb&eacute;m n&atilde;o consigo alterar os valores da constante depois. Mesmo usando o m&eacute;todo <strong>const_set</strong> do objeto <strong>Module</strong>.</p>

<p>A solu&ccedil;&atilde;o que encontrei foi criar o meu pr&oacute;prio m&eacute;todo para exibir a abrevia&ccedil;&atilde;o da data:
[source:ruby]
module ActionView</p>

<pre><code>module Helpers
    module DateHelper

        BR_ABBR_MONTHNAMES = [nil] + %w(Jan Fev Mar Abr Mai Jun Jul Ago Set Out Nov Dez)

        def abbr_month_name(month)
            BR_ABBR_MONTHNAMES[month]
        end
    end
end
</code></pre>

<p>end
[/source]
Se algu&eacute;m tiver uma solu&ccedil;&atilde;o melhor que esta, por favor se pronuncie.</p>

<p>Para ver como ficou <a href="http://www.carreirati.com/">clique aqui</a>.</p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/05/04/carreirati-empregos-para-profissionais-de-ti/">carreiraTI: Empregos para profissionais de TI</a></h1>
    
    
      <p class="meta">




<time datetime="2007-05-04 00:00:00 -0300" pubdate  updated > 4 de Maio de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p> <center><a href="http://www.carreirati.com/" atomicselection="true"><img height="30" src="http://old.nomedojogo.com/wp-content/uploads/writer/carreiraTIEmpregosparaprofissionaisdeTI_297B/logo_principal12.png" width="184"></a></center> <p></p> <p>Meu projeto inteiro em Rails.</p> <p>Claro que ainda n&atilde;o est&aacute; totalmente finalizado, mas &eacute; um come&ccedil;o. Trata-se de um site de empregos para a &aacute;rea de tecnologia da informa&ccedil;&atilde;o. Muita coisa ainda h&aacute; de vir, mas por enquanto este &eacute; o b&aacute;sico.</p> <p>Segui a linha de que &eacute; melhor lan&ccedil;ar meio produto do que um produto meia boca.</p> <p>Aguardem novidades para a pr&oacute;xima semana.</p> <p>H&aacute;&#8230; bem que os amigos podiam me ajudar a divulgar&#8230; Tamb&eacute;m aceito sugest&otilde;es!</p> <p><a href="http://www.carreirati.com/">Clique aqui</a> para acessar.</p>

</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/04/26/papel-de-parede-ruby-on-rails/">Papel de Parede: Ruby on Rails</a></h1>
    
    
      <p class="meta">




<time datetime="2007-04-26 00:00:00 -0300" pubdate  updated >26 de Abril de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p>Sempre estou mudando o papel de parede do meu notebook, e costumo colocar&nbsp;imagens que reflitam meus momentos. Procurando por um papel de parede novo, vejam o que encontrei:</p>


<p> <p> <center><img style="border-top-width: 0px; border-left-width: 0px; border-bottom-width: 0px; border-right-width: 0px" height="150" src="http://old.nomedojogo.com/wp-content/uploads/writer/PapeldeParedeRubyonRails_9F3F/56883622_18f242e1141.jpg" width="240" border="0"></center> <p></p> <p>Lindo n&atilde;o?</p> <p>Para baixar a vers&atilde;o em alta resolu&ccedil;&atilde;o, <a href="http://wiki.huihoo.com/images/f/fa/Ruby-on-rails.jpg" target="_blank">clique aqui</a>.</p></p>
</div>
  
  


  </article>

<nav role="pagination">
  <div>
    
      <a class="prev" href="/page/78/">&larr; Antigos</a>
    
    <a href="/blog/archives">Arquivo</a>
    
    <a class="next" href="/page/76/">Novos &rarr;</a>
    
  </div>
</nav>

<script type="text/javascript">
    var disqus_shortname = 'carlosbrando';
    (function () {
      var s = document.createElement('script'); s.async = true;
      s.type = 'text/javascript';
      s.src = 'http://' + disqus_shortname + '.disqus.com/count.js';
      (document.getElementsByTagName('HEAD')[0] || document.getElementsByTagName('BODY')[0]).appendChild(s);
    }());
</script>

</div>
<aside role=sidebar>
  
    <section>
  <h1>Artigos Recentes</h1>
  <ul id="recent_posts">
    
      <li class="post">
        <a href="/2011/08/25/como-convencer-sua-equipe-a-usar-um-sistema-de-controle-de-vers-o/">Como convencer sua equipe a usar um sistema de controle de versão</a>
      </li>
    
      <li class="post">
        <a href="/2011/08/19/blogando-como-um-hacker/">Blogando como um hacker</a>
      </li>
    
      <li class="post">
        <a href="/2011/06/13/a-regra-direita-esquerda-do-c/">A Regra Direita-Esquerda do C</a>
      </li>
    
      <li class="post">
        <a href="/2011/06/03/colorific/">Colorific</a>
      </li>
    
      <li class="post">
        <a href="/2011/03/29/quem-disse-que-gravar-um-podcast-e-facil/">Quem disse que gravar um podcast é fácil?</a>
      </li>
    
  </ul>
</section>

<section>
  <h1>Últimos Tweets</h1>
  <ul id="tweets">
    <li class="loading">Atualizando&#8230;</li>
  </ul>
  <script type="text/javascript">
    $.domReady(function(){
      getTwitterFeed("carlosbrando", 4, false);
    });
  </script>
  <script src="/javascripts/twitter.js" type="text/javascript"> </script>
  
    <a href="http://twitter.com/carlosbrando" class="twitter-follow-button" data-width="208px" data-show-count="false">Siga @carlosbrando</a>
  
</section>


<section>
  <h1>Open Source</h1>
  <ul id="gh_repos">
    <li class="loading">Atualizando&#8230;</li>
  </ul>
  
  <a href="https://github.com/carlosbrando">@carlosbrando</a> no Github
  
  <script type="text/javascript">
    $.domReady(function(){
        if (!window.jXHR){
            var jxhr = document.createElement('script');
            jxhr.type = 'text/javascript';
            jxhr.src = '/javascripts/libs/jXHR.js';
            var s = document.getElementsByTagName('script')[0];
            s.parentNode.insertBefore(jxhr, s);
        }

        github.showRepos({
            user: 'carlosbrando',
            count: 4,
            skip_forks: false,
            target: '#gh_repos'
        });
    });
  </script>
  <script src="/javascripts/github.js" type="text/javascript"> </script>
</section>




  
</aside>

    </div>
  </div>
  <footer><p>
  Copyright &copy; 2011 - Carlos Brando -
  <span class="credit">Powered by <a href="http://octopress.org">Octopress</a></span>
</p>

</footer>
</body>
</html>
