
<!DOCTYPE html>
<!--[if IEMobile 7 ]><html class="no-js iem7"><![endif]-->
<!--[if lt IE 9]><html class="no-js lte-ie8"><![endif]-->
<!--[if (gt IE 8)|(gt IEMobile 7)|!(IEMobile)|!(IE)]><!--><html class="no-js" lang="en"><!--<![endif]-->
<head>
  <meta charset="utf-8">
  <title>Nome do Jogo</title>
  <meta name="author" content="Carlos Brando">
  

  <!-- http://t.co/dKP3o1e -->
  <meta name="HandheldFriendly" content="True">
  <meta name="MobileOptimized" content="320">
  <meta name="viewport" content="width=device-width, initial-scale=1">

  
  
    <link rel="canonical" href="http://nomedojogo.com/page/70/">
  <link href="/favicon.png" rel="shortcut icon" />
  <link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
  <script src="/javascripts/modernizr-2.0.js"></script>
  <script src="http://s3.amazonaws.com/ender-js/jeesh.min.js"></script>
  <script src="/javascripts/octopress.js" type="text/javascript"></script>
  <link href="http://feeds2.feedburner.com/NomeDoJogo" rel="alternate" title="Nome do Jogo" type="application/atom+xml"/>
  <!--Fonts from Google's Web font directory at http://google.com/webfonts -->
<link href='http://fonts.googleapis.com/css?family=PT+Serif:regular,italic,bold,bolditalic' rel='stylesheet' type='text/css'>
<link href='http://fonts.googleapis.com/css?family=PT+Sans:regular,italic,bold,bolditalic' rel='stylesheet' type='text/css'>

</head>

<body  >
  <header><hgroup>
  <h1><a href="/">Nome do Jogo</a></h1>
  
    <h2>por Carlos Brando</h2>
  
</hgroup>

</header>
  <nav role=navigation><ul role=subscription data-subscription="rss">
  <li><a href="http://feeds2.feedburner.com/NomeDoJogo" rel="subscribe-rss" title="assine via RSS">RSS</a></li>
  
</ul>
<form action="http://google.com/search" method="get">
  <fieldset role="site-search">
    <input type="hidden" name="q" value="site:nomedojogo.com" />
    <input class="search" type="text" name="q" results="0" placeholder="Pesquisar"/>
  </fieldset>
</form>
<ul role=main-navigation>
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Arquivo</a></li>
</ul>

</nav>
  <div id="main">
    <div id="content">
      <div class="blog-index">



  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/08/23/webcasts-gratuitos-sobre-ruby-on-rails/">Webcasts gratuitos sobre Ruby on Rails</a></h1>
    
    
      <p class="meta">





  



<time datetime="2007-08-23T00:00:00-03:00" pubdate  data-updated="true" >23 de Agosto de 2007</time></p>
    
  </header>


  <div class="entry-content"><p> <center><img height="105" alt="home_logo" src="http://old.nomedojogo.com/wp-content/uploads/2007/08/home-logo.gif" width="152" border="0"> <img height="66" alt="home_logo2" src="http://old.nomedojogo.com/wp-content/uploads/2007/08/home-logo2.gif" width="229" border="0"></center> <p></p> <p>O site <a href="http://webcast.berkeley.edu/event_details.php?webcastid=20854">webcast.berkeley</a> disponibilizou uma s&eacute;rie de webcasts sobre Ruby on Rails.</p> <p>Os webcasts mostram os conceitos b&aacute;sicos do Ruby e do framework Rails. S&atilde;o ao todo 6 epis&oacute;dios com uma hora de dura&ccedil;&atilde;o cada.</p> <ul> <li><a href="http://webcast.berkeley.edu:8080/ramgen/events/eecs/eecs_20070816_1.rm"><b>Hello World</b></a>  <li><a href="http://webcast.berkeley.edu:8080/ramgen/events/eecs/eecs_20070816_2.rm"><b>Just Enough Ruby</b></a>  <li><a href="http://webcast.berkeley.edu:8080/ramgen/events/eecs/eecs_20070816_3.rm"><b>Basics of Rails</b></a>  <li><a href="http://webcast.berkeley.edu:8080/ramgen/events/eecs/eecs_20070816_4.rm"><b>Advanced Model Relations</b></a>  <li><a href="http://webcast.berkeley.edu:8080/ramgen/events/eecs/eecs_20070816_5.rm"><b>AJAX &amp; Testing</b></a>  <li><a href="http://webcast.berkeley.edu:8080/ramgen/events/eecs/eecs_20070816_6.rm"><b>Configuration &amp; Deployment</b></a></li></ul> <p>Al&eacute;m disto voc&ecirc; pode obter todo o material do curso <a href="http://radlab.cs.berkeley.edu/wiki/Ruby_on_Rails_1-day_course">aqui</a>.</p>

</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/08/23/rails-vs-net/">Rails vs .Net</a></h1>
    
    
      <p class="meta">





  



<time datetime="2007-08-23T00:00:00-03:00" pubdate  data-updated="true" >23 de Agosto de 2007</time></p>
    
  </header>


  <div class="entry-content"><p><embed src="http://www.youtube.com/v/528BCJiRkks" width="425" height="350" type="application/x-shockwave-flash" wmode="transparent"></embed></p>


<p> <p>Vi primeiro no <a href="http://samirmamude.com/2007/8/23/rails-envy-rails-vs-net">blog do Samir</a>.</p></p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/08/22/sua-empresa-ainda-no-aceitou-ruby-on-rails-que-tipo-de-evangelista-voc/">Sua empresa ainda não aceitou Ruby on Rails? Que tipo de evangelista é você?</a></h1>
    
    
      <p class="meta">





  



<time datetime="2007-08-22T00:00:00-03:00" pubdate  data-updated="true" >22 de Agosto de 2007</time></p>
    
  </header>


  <div class="entry-content"><p><img src="http://farm2.static.flickr.com/1034/888412358_2ab312e766.jpg?v=0">  <p>Voc&ecirc; pode desenvolver qualquer tipo de sistema com Ruby? Sim, pode. Vale a pena? N&atilde;o, n&atilde;o vale. <p>Tenho um sistema web para ser desenvolvido na minha empresa a partir do zero, devo usar Ruby on Rails? Voc&ecirc; s&oacute; n&atilde;o far&aacute; isto se for burro.  <p>Se voc&ecirc; j&aacute; viu todo o potencial do Rails e &eacute; dono da sua empresa, realmente voc&ecirc; &eacute; um&nbsp;idiota se ainda n&atilde;o est&aacute; criando nada com este framework. &Eacute; simplesmente indiscut&iacute;vel os ganhos em se usar Ruby em projetos de pequeno/m&eacute;dio porte para web.  <p>Mas se voc&ecirc; &eacute; um simples empregado de uma grande corpora&ccedil;&atilde;o, precisa primeiro de tudo, convencer a sua empresa de que apostar no Rails ser&aacute; bom para os neg&oacute;cios. A regra &eacute;: Morda um peda&ccedil;o de cada vez. N&atilde;o tente ir com toda a sede ao pote, isto vai assust&aacute;-los.  <p>Quando me deparei com Ruby on Rails pela primeira vez, confesso que ria muito &agrave; medida que estudava. Tudo era muito simples e r&aacute;pido, de um jeito que parecia brincadeira. Hoje, j&aacute; com alguns produtos criados e um conhecimento um pouco maior da linguagem e do ambiente, n&atilde;o dou mais risada. Dou gargalhada. Por este motivo, quando vou falar com algu&eacute;m que n&atilde;o conhece Rails, me empolgo muito, quero mostrar tudo que &eacute; poss&iacute;vel ser feito, e isto realmente assusta as pessoas.  <p>Comece montando algo pequeno para mostrar como &eacute; r&aacute;pido o desenvolvimento. N&atilde;o pe&ccedil;a permiss&atilde;o. Simplesmente fa&ccedil;a. Mostre resultados reais.  <p>Deixe claro para seus superiores que Ruby on Rails &eacute; uma alternativa de baixo risco e de baixo investimento para testar novos conceitos.  <p>Teve uma id&eacute;ia interessante? Crie algo na suas horas de folga, depois mostre para seu chefe. Qualquer pessoa de bom senso vai perceber que deve pelo menos olhar com mais calma para o Rails.  <p>Ainda n&atilde;o consegui a mudan&ccedil;a que queria aqui no trabalho, mas mostrando os <a href="www.carreirati.com ">produtos</a> que criei para mim mesmo, e revelando o tempo gasto com o desenvolvimento, j&aacute; consegui alguns resultados.</p>

</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/08/21/working-with-rails-ultrapassa-a-marca-de-8000-programadores/">Working with Rails ultrapassa a marca de 8000 programadores.</a></h1>
    
    
      <p class="meta">





  



<time datetime="2007-08-21T00:00:00-03:00" pubdate  data-updated="true" >21 de Agosto de 2007</time></p>
    
  </header>


  <div class="entry-content"><p><img src="http://l.yimg.com/www.flickr.com/images/home_photo_notsogoodphotography.jpg">  <p>A&iacute; est&aacute; um servi&ccedil;o muito interessante. N&atilde;o conhe&ccedil;o nenhuma outra comunidade de linguagem de programa&ccedil;&atilde;o que tenha uma rede social deste n&iacute;vel s&oacute; para ela.  <p>&Eacute; claro que o <a href="http://www.workingwithrails.com">WWR</a> n&atilde;o &eacute; tudo isto, mas tem alguns recursos bem interessantes, como uma lista com os <a href="http://workingwithrails.com/browse/railsplugins/usage">plugins</a> e <a href="http://workingwithrails.com/browse/rubygems/usage ">gems</a> mais usados pelos desenvolvedores no mundo. <p>Voc&ecirc; tamb&eacute;m pode acompanhar um rank de popularidade entre os principais <a href="http://www.workingwithrails.com/browse/popular/people">evangelistas e contribuidores</a> do framework no mundo todo. <p>Outro recurso legal &eacute; poder ver os <a href="http://workingwithrails.com/browse/railsplugins/usage/authority/ ">plugins</a> e <a href="http://workingwithrails.com/browse/rubygems/usage/authority/">gems</a> mais usados levando em considera&ccedil;&atilde;o o grau de autoridade das pessoas na linguagem.  <p>Se voc&ecirc; j&aacute; usa o Rails profissionalmente, com certeza j&aacute; deve conhecer o site, mas mesmo para quem ainda est&aacute; aprendendo, este &eacute; com certeza um &oacute;timo ambiente para se freq&uuml;entar.  <p>P.S.: Ah, e para quem quiser me recomendar &eacute; s&oacute; <a href="http://workingwithrails.com/recommendation/new/person/8137-carlos-brando">clicar aqui</a>.</p>

</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/08/19/ruby-on-rails-coloque-as-coisas-no-seu-devido-lugar/">Ruby on Rails: Coloque as coisas no seu devido lugar.</a></h1>
    
    
      <p class="meta">





  



<time datetime="2007-08-19T00:00:00-03:00" pubdate  data-updated="true" >19 de Agosto de 2007</time></p>
    
  </header>


  <div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/08/459207903-d5ce64f14a.jpg" style="border: 0px none " alt="459207903_d5ce64f14a" border="0" height="333" width="500" /> </p>


<p>Regra: Coloque sempre links para stylesheets e javascript dentro da tag HEAD do HTML.</p>


<p>N&atilde;o &eacute; que isto seja obrigat&oacute;rio, mas eu gosto de deixar as coisas bonitas. O problema com Rails neste caso &eacute; que quando uso o m&eacute;todo <strong>stylesheet_link_tag</strong> na p&aacute;gina que estou desenvolvendo, quando ela for renderizada, o link do css&nbsp;ficar&aacute; bem no meio da p&aacute;gina por causa do <strong>yield</strong> da p&aacute;gina de layout.</p>


<p>Mas como tudo no Rails, existe uma solu&ccedil;&atilde;o muito simples para isto. Podemos usar o m&eacute;todo <strong>content_for</strong>.</p>


<p>Para fazer o teste, crie um view de layout com o seguinte c&oacute;digo:</p>


<p>[source:html]
<html>
    <head>
        <%= yield :css %>
    </head>
    <body>
        <%= yield %>
    </body>
</html>
[/source]</p>
<p>Veja que a p&aacute;gina tem dois yield, sendo que o primeiro recebe um par&acirc;metro <strong>:css</strong>.</p>
<p>Agora crie outra&nbsp;view da seguinte forma:</p>
<p>[source:html]
<% content_for :css do %>
    <%= stylesheet_link_tag 'css_da_minha_pagina' %>
<% end %>
<h2>Minha P&aacute;gina</h2>
[/source]</p>
<p>Rode e veja como fica sua p&aacute;gina. Pronto, tudo no seu devido lugar.</p>

</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/08/19/links-de-domingo/">Links de domingo</a></h1>
    
    
      <p class="meta">





  



<time datetime="2007-08-19T00:00:00-03:00" pubdate  data-updated="true" >19 de Agosto de 2007</time></p>
    
  </header>


  <div class="entry-content"><p><img src="http://farm1.static.flickr.com/58/183689226_4e71fc9f7d.jpg?v=0"> </p>


<p> <p><a href="http://www.softiesonrails.com/2007/8/19/ruby-101-substrings-in-ruby">Ruby 101: Substrings in Ruby</a>: Jeff Cohen ensina como recuperar trechos de uma string no <strong>Ruby</strong>. &Eacute; uma dica interessante, principalmente para quem ainda est&aacute; trabalhando com C#, e pode se confundir um pouco na hora de fazer o mesmo com Ruby.</p> <p><a href="http://www.rubyinside.com/yelp-api-for-ruby-581.html"></a><a href="http://scrubyt.org/scrapin-google-in-no-sec/">Scrapin&#39; Google in no sec</a>: CopperMonkey mostra como recuperar dados do <a href="http://www.google.com.br">Google</a> em 0 (zero) segundos usando o <strong><font color="#ff0000">scRUBYt!</font></strong>.</p></p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/08/18/post-rpido-prototype-160-release-candidate/">Post Rápido: Prototype 1.6.0 release candidate</a></h1>
    
    
      <p class="meta">





  



<time datetime="2007-08-18T00:00:00-03:00" pubdate  data-updated="true" >18 de Agosto de 2007</time></p>
    
  </header>


  <div class="entry-content"><p>Saiu um release candidate da nova vers&atilde;o (1.6.0) do Prototype. Para ver as novidades, <a href="http://prototypejs.org/2007/8/15/prototype-1-6-0-release-candidate">clique aqui</a>.</p>


<p> <p>Para fazer o download, <a href="http://prototypejs.org/assets/2007/8/15/prototype.js">clique aqui</a>.</p></p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/08/16/todo-mundo-pode-ver-minha-senha-nos-arquivos-de-log-do-rails/">Todo mundo pode ver minha senha nos arquivos de log do Rails&#8230;</a></h1>
    
    
      <p class="meta">





  



<time datetime="2007-08-16T00:00:00-03:00" pubdate  data-updated="true" >16 de Agosto de 2007</time></p>
    
  </header>


  <div class="entry-content"><p></p>


<p><img src="http://farm2.static.flickr.com/1039/1101698626_d15d566a94.jpg?v=0"> </p>


<p>Um recurso muito &uacute;til no <strong>Rails</strong> s&atilde;o os arquivos de log. Por meio deles n&oacute;s podemos acompanhar exatamente o que est&aacute; acontecendo com nosso software, vendo inclusive os comandos <strong>SQL</strong> enviados para o banco de dados.</p>


<p>Mas este recurso tem um s&eacute;rio problema de seguran&ccedil;a. Uma simples p&aacute;gina de login ou cadastro de usu&aacute;rios, pode fazer com que o <strong>Rails</strong> grave a senha do usu&aacute;rio nos arquivos de log. Quando enviamos dados via post (usado nestes casos) o <strong>Rails</strong> grava todos os parametros enviados no arquivo de log, inclusive sua senha. Fa&ccedil;a o teste e comprove.</p>


<p>Para evitar este tipo de problema, voc&ecirc; pode utilizar um filtro no seu arquivo de controller:</p>


<p>[source:ruby]
class WelcomeController < ApplicationController
    filter_parameter_logging "password"
end
[/source]</p>
<p>Onde <strong>&#8220;password&#8221;</strong> &eacute; o nome do campo que voc&ecirc; est&aacute; usando para armazenar sua senha.</p>
<p>Agora fa&ccedil;a o teste novamente. Ao inv&eacute;s de o <strong>Rails</strong> registrar a senha do usu&aacute;rio no log, ele trocar&aacute; por <strong>[FILTERED]</strong>.</p>

</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/08/16/c-30-se-voc-gosta-do-rails-deve-ler-este-post/">C# 3.0 - Se você gosta do Rails, deve ler este post.</a></h1>
    
    
      <p class="meta">





  



<time datetime="2007-08-16T00:00:00-03:00" pubdate  data-updated="true" >16 de Agosto de 2007</time></p>
    
  </header>


  <div class="entry-content"><p><img src='http://old.nomedojogo.com/wp-content/uploads/2007/08/mono-logo-thumb.png' alt='mono-logo-thumb.png' /> </p>


<p>Nestes &uacute;ltimos dias temos falado muito de <strong>C#</strong> e <strong>Ruby</strong> aqui no blog. Alguns deram suas opini&otilde;es e mostraram paix&atilde;o tanto pelo Ruby quanto pelo <strong>C#</strong>. Eu volto mais uma vez a frisar que voc&ecirc; n&atilde;o deve ser fan&aacute;tico, deve ter a mente aberta para tudo. &Eacute; isto que torna voc&ecirc; um excelente profissional.</p>


<p>Pesquisando o que tem de novo no <strong>C# 3.0</strong> me deparei com um recurso muito legal: Extens&otilde;es.</p>


<p>N&oacute;s que programamos em <strong>Ruby</strong> estamos acostumados a fazer algo assim:</p>


<p>
[source:ruby]
10.days.ago

100.megabytes + 50.kbytes
[/source]
</p>


<p>Mas em <strong>C#</strong> isto simplesmente n&atilde;o &eacute; poss&iacute;vel, ou melhor n&atilde;o era&#8230; Na nova vers&atilde;o 3.0 voc&ecirc; pode criar extens&otilde;es para tipos prim&aacute;rios:</p>


<p>
[source:csharp]
    public static class Extensions
    {
        public static int Megabytes(this int value)
        {
            return value * 1024 * 1024;
        }

        public static int Kilobytes(this int value)
        {
            return value * 1024;
        }

        public static int Days(this int value)
        {
            return value * 24 * 60 * 60 * 1000;
        }

        public static DateTime Ago(this int value)
        {
            return DateTime.Now.AddMilliseconds(-value);
        }
    }
[/source]
</p>


<p>E usar da seguinte maneira:</p>


<p>
[source:csharp]
DateTime x = 10.Days().Ago();

int bytes = 100.Megabytes() + 50.Kilobytes();
[/source]
</p>


<p>E a&iacute;, o que achou? Legal n&eacute;?</p>


<p>Para finalizar o assunto, n&atilde;o aja como um fan&aacute;tico religioso com respeito a sua linguagem de programa&ccedil;&atilde;o favorita. Seja sempre aberto a novas descobertas. <strong>C#</strong> &eacute; uma linguagem e tanto, e com recursos como este que acabamos de ver, mais o lan&ccedil;amento do <strong>DLR</strong> que deve acontecer em breve, podemos portar todas as funcionalidades do Rails para ele, incluindo as m&aacute;gicas do <strong>ActiveRecord</strong>.</p>


<p>Minha opini&atilde;o? Estude <strong>Ruby on Rails</strong>, estude <strong>C#</strong> e&nbsp;estude <strong>Java</strong>.</p>

</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/08/14/net-vs-rails-qual-o-melhor-mesmo/">.Net vs Rails&#8230; Qual é o melhor mesmo?</a></h1>
    
    
      <p class="meta">





  



<time datetime="2007-08-14T00:00:00-03:00" pubdate  data-updated="true" >14 de Agosto de 2007</time></p>
    
  </header>


  <div class="entry-content"><p><img src="http://farm1.static.flickr.com/219/492822792_38c5456179.jpg?v=0"> </p>


<p> <p>Quando escrevi este <a href="http://www.nomedojogo.com/2007/08/11/por-que-net-melhor-do-que-rails/">post</a>, a id&eacute;ia era deixar claro que voc&ecirc; nunca deve apostar todas suas fichas apenas em uma tecnologia. Estude <strong>Rails</strong>, aprenda, divirta-se e se conseguir ganhe dinheiro com isto.</p> <p>Mas se voc&ecirc; ainda n&atilde;o est&aacute; ganhando dinheiro, n&atilde;o gaste todo seu tempo com <strong>Ruby on Rails</strong>, distribua uma parte deste tempo se atualizando com a linguagem de programa&ccedil;&atilde;o que voc&ecirc; j&aacute; conhece e trabalha (ganha dinheiro) at&eacute; chegar o dia em que voc&ecirc; consiga sobreviver s&oacute; com <strong>Rails</strong>.</p> <p>N&atilde;o corra o risco de ficar para tr&aacute;s no mercado.</p> <p><a href="http://samirmamude.com/2007/8/12/porque-rails-%C3%A9-melhor-que-asp-net-">Rails &eacute; melhor que .Net?</a> Depende. Se voc&ecirc; estiver construindo software para a internet do zero, sim.</p> <p><a href="http://eduardomiranda.net/blogs/dotnet/">ASP.Net &eacute; melhor do Rails?</a> Depende. Se voc&ecirc; estiver construindo um servi&ccedil;o para Windows, sim.</p> <p>O <strong>C#</strong> &eacute; uma excelente linguagem de programa&ccedil;&atilde;o. O <strong>Visual Studio</strong> &eacute; a melhor ferramenta Rad que existe.</p> <p>Mas eu gosto mais de programar em <strong>Ruby</strong>. E ningu&eacute;m pode negar que o <strong>Rails</strong> &eacute; uma revolu&ccedil;&atilde;o na forma de se construir software para a Web.</p> <p>Cada um na sua.</p></p>
</div>
  
  


  </article>

<nav role="pagination">
  <div>
    
      <a class="prev" href="/page/71/">&larr; Antigos</a>
    
    <a href="/blog/archives">Arquivo</a>
    
    <a class="next" href="/page/69/">Novos &rarr;</a>
    
  </div>
</nav>

<script type="text/javascript">
    var disqus_shortname = 'carlosbrando';
    (function () {
      var s = document.createElement('script'); s.async = true;
      s.type = 'text/javascript';
      s.src = 'http://' + disqus_shortname + '.disqus.com/count.js';
      (document.getElementsByTagName('HEAD')[0] || document.getElementsByTagName('BODY')[0]).appendChild(s);
    }());
</script>

</div>
<aside role=sidebar>
  
    <section>
  <h1>Artigos Recentes</h1>
  <ul id="recent_posts">
    
      <li class="post">
        <a href="/2011/09/12/contratos-onde-todos-ganham/">Contratos onde todos ganham</a>
      </li>
    
      <li class="post">
        <a href="/2011/08/25/como-convencer-sua-equipe-a-usar-um-sistema-de-controle-de-vers-o/">Como convencer sua equipe a usar um sistema de controle de versão</a>
      </li>
    
      <li class="post">
        <a href="/2011/08/19/blogando-como-um-hacker/">Blogando como um hacker</a>
      </li>
    
      <li class="post">
        <a href="/2011/06/13/a-regra-direita-esquerda-do-c/">A Regra Direita-Esquerda do C</a>
      </li>
    
      <li class="post">
        <a href="/2011/06/03/colorific/">Colorific</a>
      </li>
    
  </ul>
</section>

<section>
  <h1>Últimos Tweets</h1>
  <ul id="tweets">
    <li class="loading">Atualizando&#8230;</li>
  </ul>
  <script type="text/javascript">
    $.domReady(function(){
      getTwitterFeed("carlosbrando", 4, false);
    });
  </script>
  <script src="/javascripts/twitter.js" type="text/javascript"> </script>
  
    <a href="http://twitter.com/carlosbrando" class="twitter-follow-button" data-width="208px" data-show-count="false">Siga @carlosbrando</a>
  
</section>


<section>
  <h1>Open Source</h1>
  <ul id="gh_repos">
    <li class="loading">Atualizando&#8230;</li>
  </ul>
  
  <a href="https://github.com/carlosbrando">@carlosbrando</a> no Github
  
  <script type="text/javascript">
    $.domReady(function(){
        if (!window.jXHR){
            var jxhr = document.createElement('script');
            jxhr.type = 'text/javascript';
            jxhr.src = '/javascripts/libs/jXHR.js';
            var s = document.getElementsByTagName('script')[0];
            s.parentNode.insertBefore(jxhr, s);
        }

        github.showRepos({
            user: 'carlosbrando',
            count: 4,
            skip_forks: false,
            target: '#gh_repos'
        });
    });
  </script>
  <script src="/javascripts/github.js" type="text/javascript"> </script>
</section>




  
</aside>

    </div>
  </div>
  <footer><p>
  Copyright &copy; 2011 - Carlos Brando -
  <span class="credit">Powered by <a href="http://octopress.org">Octopress</a></span>
</p>

</footer>
  
  <script type="text/javascript">
    var _gaq = _gaq || [];
    _gaq.push(['_setAccount', 'UA-1249636-1']);
    _gaq.push(['_trackPageview']);

    (function() {
      var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
      ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
      var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
    })();
  </script>


  
  <script type="text/javascript">
    (function() {
      var script = document.createElement('script'); script.type = 'text/javascript'; script.async = true;
      script.src = 'https://apis.google.com/js/plusone.js';
      var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(script, s);
    })();
  </script>


  
  <script type="text/javascript">
    (function(){
      var twitterWidgets = document.createElement('script');
      twitterWidgets.type = 'text/javascript';
      twitterWidgets.async = true;
      twitterWidgets.src = 'http://platform.twitter.com/widgets.js';
      document.getElementsByTagName('head')[0].appendChild(twitterWidgets);
    })();
  </script>


</body>
</html>
