
<!DOCTYPE html>
<!--[if IEMobile 7 ]><html class="no-js iem7"><![endif]-->
<!--[if lt IE 9]><html class="no-js lte-ie8"><![endif]-->
<!--[if (gt IE 8)|(gt IEMobile 7)|!(IEMobile)|!(IE)]><!--><html class="no-js" lang="en"><!--<![endif]-->
<head>
  <meta charset="utf-8">
  <title>Nome do Jogo</title>
  <meta name="author" content="Carlos Brando">
  

  <!-- http://t.co/dKP3o1e -->
  <meta name="HandheldFriendly" content="True">
  <meta name="MobileOptimized" content="320">
  <meta name="viewport" content="width=device-width, initial-scale=1">

  
  
    <link rel="canonical" href="http://nomedojogo.com/page/64/">
  <link href="/favicon.png" rel="shortcut icon" />
  <link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
  <script src="/javascripts/modernizr-2.0.js"></script>
  <script src="http://s3.amazonaws.com/ender-js/jeesh.min.js"></script>
  <script src="/javascripts/octopress.js" type="text/javascript"></script>
  <link href="http://feeds2.feedburner.com/NomeDoJogo" rel="alternate" title="Nome do Jogo" type="application/atom+xml"/>
  <!--Fonts from Google's Web font directory at http://google.com/webfonts -->
<link href='http://fonts.googleapis.com/css?family=PT+Serif:regular,italic,bold,bolditalic' rel='stylesheet' type='text/css'>
<link href='http://fonts.googleapis.com/css?family=PT+Sans:regular,italic,bold,bolditalic' rel='stylesheet' type='text/css'>

</head>

<body  >
  <header><hgroup>
  <h1><a href="/">Nome do Jogo</a></h1>
  
    <h2>por Carlos Brando</h2>
  
</hgroup>

</header>
  <nav role=navigation><ul role=subscription data-subscription="rss">
  <li><a href="http://feeds2.feedburner.com/NomeDoJogo" rel="subscribe-rss" title="assine via RSS">RSS</a></li>
  
</ul>
<form action="http://google.com/search" method="get">
  <fieldset role="site-search">
    <input type="hidden" name="q" value="site:nomedojogo.com" />
    <input class="search" type="text" name="q" results="0" placeholder="Pesquisar"/>
  </fieldset>
</form>
<ul role=main-navigation>
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Arquivo</a></li>
</ul>

</nav>
  <div id="main">
    <div id="content">
      <div class="blog-index">



  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/11/07/personas-ou-pessoas-reais/">Personas ou pessoas reais?</a></h1>
    
    
      <p class="meta">





  



<time datetime="2007-11-07T00:00:00-02:00" pubdate  data-updated="true" > 7 de Novembro de 2007</time></p>
    
  </header>


  <div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/11/1896661471_33aacb975f.jpg" alt="1896661471_33aacb975f.jpg" /></p>

<p>Este artigo &eacute; uma tradu&ccedil;&atilde;o <a href="http://www.37signals.com/svn/posts/690-ask-37signals-personas">deste post</a> do blog <strong>Signal vs. Noise</strong>.</p>

<p>Scott pergunta:</p>

<blockquote>Voc&ecirc;s usam <a href="http://pt.wikipedia.org/wiki/Persona">personas</a> (neste caso persona se refere a um personagem fict&iacute;cio, que representa o usu&aacute;rio do software) quando pensam nos usu&aacute;rios de um novo aplicativo?</blockquote>


<p>N&atilde;o usamos personas. Usamos n&oacute;s mesmos. Acredito que personas levam a uma falsa sensa&ccedil;&atilde;o de entendimento.</p>

<p>Cada produto que constru&iacute;mos &eacute; um produto criado para resolver os nossos pr&oacute;prios problemas. Reconhecemos que os nossos problemas n&atilde;o s&atilde;o exclusivos. De fato, nossos problemas s&atilde;o provavelmente muito parecidos com os seus. Portanto, n&oacute;s solucionamos os nossos problemas na forma de um software para a Web e depois o vendemos para pessoas que possuem o mesmo problema.</p>

<p>Reconhecemos que nem todos compartilham dos nossos problemas, do nosso ponto de vista, ou da nossas opini&otilde;es, e isto tamb&eacute;m ser&aacute; verdade ser voc&ecirc; usar personas. Tomar decis&otilde;es baseadas em pareceres verdadeiros &eacute; melhor do que tomar decis&otilde;es baseadas em pareceres imagin&aacute;rios.</p>

<p>Eu nunca acreditei em personas. Eles s&atilde;o artificiais, abstratos e fict&iacute;cios. Eu n&atilde;o acho que voc&ecirc; conseguir&aacute; construir um grande produto para uma pessoa que n&atilde;o existe.</p>

<h3>Personas n&atilde;o s&atilde;o reais</h3>


<p>Personas n&atilde;o falam. Personas n&atilde;o respondem suas perguntas. Personas n&atilde;o tem opini&otilde;es. Personas n&atilde;o pode lhe dizer se uma coisa n&atilde;o est&aacute; legal. Personas n&atilde;o conseguem dizer quando uma frase n&atilde;o faz sentido. Personas n&atilde;o se sentem frustradas. Personas n&atilde;o sofrem press&atilde;o. Personas n&atilde;o podem clicar nas coisas. Personas n&atilde;o cometem erros. Personas n&atilde;o pode fazer julgamentos. Personas n&atilde;o usam produtos. Personas n&atilde;o s&atilde;o reais.</p>

<h3>Pessoas s&atilde;o reais</h3>


<p>Pessoas falam. Pessoas respondem &agrave; perguntas. Pessoas t&ecirc;m opini&otilde;es. Pessoas podem lhe avisar se alguma coisa est&aacute; errada. Pessoas podem lhe dizer quando uma frase n&atilde;o faz sentido. Pessoas se frustram. Pessoas s&atilde;o pressionadas. Pessoas clicam em coisas. Pessoas cometem erros. Pessoas fazem julgamentos. As pessoas usam produtos. Pessoas s&atilde;o reais.</p>

<h3>Caia na Real</h3>


<p>Portanto, se voc&ecirc; n&atilde;o consegue conceber algo para si pr&oacute;prio, crie algo para algu&eacute;m que voc&ecirc; conhe&ccedil;a. Envolva a pessoa ou as pessoas em seu projeto desde o in&iacute;cio. Basear suas decis&otilde;es em tra&ccedil;os de personalidade n&atilde;o &eacute; o que eu recomendaria se voc&ecirc; realmente deseja construir um &oacute;timo produto.</p>

<h3>O que eu acho</h3>


<p>Eu sempre acompanho de perto o que o pessoal da <strong>37signals</strong> est&aacute; fazendo. Na verdade eu admiro muito o trabalho deles, porque s&atilde;o uma empresa pequena que conseguiu criar alguns produtos excelentes e est&atilde;o fazendo o um nome. Eu gosto de pensar que posso fazer o mesmo se quiser. Eles cairam na real, entenderam que s&atilde;o pequenos e que devem agir como tal. De que iria adiantar se o <strong>Basecamp</strong> fosse um concorrente do <strong>Microsoft Project</strong>? Iria ser apenas mais um software gen&eacute;rico.</p>

<p>Mas eles fizeram algo diferente, criaram um software baseando-se nas necessidades deles, com as funcionalidades que ELES precisavam e perceberam que muita gente tamb&eacute;m tem os mesmos problemas.</p>

<p>Quer criar um produto? Crie algo para voc&ecirc;. Eu j&aacute; comecei, <a href="http://www.carreirati.com/">clique aqui</a>.</p>

<p>E aguardem, tem novidade vindo a&iacute;.</p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/11/07/dica-rapida-duas-listas-interessantes/">Dica rápida: Duas listas interessantes</a></h1>
    
    
      <p class="meta">





  



<time datetime="2007-11-07T00:00:00-02:00" pubdate  data-updated="true" > 7 de Novembro de 2007</time></p>
    
  </header>


  <div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/11/155884100_053e873db1.jpg" alt="155884100_053e873db1.jpg" /></p>

<p>Uma lista com <a href="http://www.zanypixel.com/blog/ruby-web-apps/">101 projetos criados em Ruby on Rails</a>. Vale a penas dar uma olhada.</p>

<p>E como a moda agora &eacute; comprar um Mac, um <a href="http://chris.pirillo.com/2007/11/06/top-100-mac-apps/">top 100 aplicativos para Mac</a>.</p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/11/06/radrails-091/">RadRails 0.9.1</a></h1>
    
    
      <p class="meta">





  



<time datetime="2007-11-06T00:00:00-02:00" pubdate  data-updated="true" > 6 de Novembro de 2007</time></p>
    
  </header>


  <div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/11/116415814_09936f50b6.jpg" alt="116415814_09936f50b6.jpg" /></p>

<p>A equipe de desenvolvimento do <strong>RadRaild</strong> acaba de <a href="http://www.aptana.com/blog/?p=199">anunciar</a> o lan&ccedil;amento da vers&atilde;o 0.9.1.</p>

<p>As principais novidades s&atilde;o uma melhor integra&ccedil;&atilde;o com o <strong>JRuby</strong> e uma instala&ccedil;&atilde;o mais simples. Agora o RadRails verifica se voc&ecirc; j&aacute; possui o <strong>Ruby</strong> instalado na m&aacute;quina e se for o caso, ele mesmo se encarrega de fazer isto. Ele tamb&eacute;m age da mesma maneira com o <strong>Mongrel</strong> e alguns <strong>gems</strong> como o <strong>ruby-debug-ide</strong>.</p>

<p>Voc&ecirc; pode fazer o download da <a href="http://www.aptana.com/download/">vers&atilde;o gratuita aqui</a>.</p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/11/06/deixando-meus-metodos-de-pesquisa-mais-espertos/">Deixando meus métodos de pesquisa mais espertos</a></h1>
    
    
      <p class="meta">





  



<time datetime="2007-11-06T00:00:00-02:00" pubdate  data-updated="true" > 6 de Novembro de 2007</time></p>
    
  </header>


  <div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/11/1858685882_35f2f01bca.jpg" alt="1858685882_35f2f01bca.jpg" /></p>

<p>Imagine o seguinte m&eacute;todo:</p>

<pre>
def count_users(type)
  User.count(:all, :conditions =&gt; ["type = ?", type])
end</pre>


<p>&Eacute; um m&eacute;todo simples, que ir&aacute; me retornar a quantidade de usu&aacute;rios de um determinado tipo. Agora, vamos testar nosso m&eacute;todo (preste aten&ccedil;&atilde;o aos comandos <strong>SQL</strong> gerados):</p>

<pre>
&gt;&gt; count_users(1)
=&gt; 2
SELECT count(*) AS count_all FROM users WHERE (type = 1)

&gt;&gt; count_users(2)
=&gt; 5
SELECT count(*) AS count_all FROM users WHERE (type = 2)</pre>


<p>Ok, at&eacute; aqui tudo funciona perfeitamente, mas e se eu desejasse contar todos os usu&aacute;rios que tivessem a coluna <strong>type</strong> com o valor <strong>NULL</strong>?</p>

<pre>
&gt;&gt; count_users(nil)
=&gt; 0
SELECT count(*) AS count_all FROM users WHERE (type = NULL)</pre>


<p>Opa, eu tenho um registro no meu banco com o valor <strong>NULL</strong>, mas o meu m&eacute;todo retornou zero. O que saiu errado? Note a <strong>query</strong> gerado pelo comando, <strong>type = NULL </strong>est&aacute; errado, dever&iacute;amos usar <strong>type IS NULL</strong>.</p>

<p>Preciso alterar meu m&eacute;todo:</p>

<pre>
def count_users(type)
  User.count(:all, :conditions =&gt; {:type =&gt; type})
end</pre>


<p>Note que alterei a forma como o par&acirc;metro <strong>:conditions</strong> estava sendo usado. Neste caso especifico, meu m&eacute;todo ficou muito mais robusto. Veja alguns exemplos:</p>

<pre>
&gt;&gt; count_users(1)
=&gt; 2
SELECT count(*) AS count_all FROM users WHERE (users."type" = 1)

&gt;&gt; count_users(2)
=&gt; 5
SELECT count(*) AS count_all FROM users WHERE (users."type" = 2)

&gt;&gt; count_users(nil)
=&gt; 1
SELECT count(*) AS count_all FROM users WHERE (users."type" IS NULL)

&gt;&gt; count_users([1,3])
=&gt; 3
SELECT count(*) AS count_all FROM users WHERE (users."type" IN (1,3))

&gt;&gt; count_users(1..3)
=&gt; 8
SELECT count(*) AS count_all FROM users WHERE (users."type" BETWEEN 1 AND 3)</pre>


<p>Note que agora, mesmo passando <strong>nil</strong> ou um <strong>array</strong> para o m&eacute;todo, ele criar&aacute; a <strong>query</strong> de pesquisa da forma correta de acordo com o tipo do objeto usado.</p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/11/05/precisando-de-ajuda/">Como era mesmo?</a></h1>
    
    
      <p class="meta">





  



<time datetime="2007-11-05T00:00:00-02:00" pubdate  data-updated="true" > 5 de Novembro de 2007</time></p>
    
  </header>


  <div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/11/1858060065_1ec99b56ca.jpg" alt="1858060065_1ec99b56ca.jpg" /></p>

<p>N&atilde;o tem jeito, ou voc&ecirc; programa com um livro do seu lado ou com algum site como o <a href="http://api.rubyonrails.com/">Rails Framework Documentation</a> aberto o tempo todo.</p>

<p>J&aacute; existe algumas ferramentas como o NetBeans que fornecem uma esp&eacute;cie de <a href="http://en.wikipedia.org/wiki/Autocompletion">code completion</a> para Ruby e Rails.  Mas para quem usa o TextMate como eu, &eacute; normal vez por outra se esquecer da sintaxe de algo ou quais parametros podem ser usados em um determinado m&eacute;todo e em que ordem.</p>

<p>Programadores Web sofrem muito mais com esse problema do que os outros. Al&eacute;m do Ruby e do Rails, voc&ecirc; ainda usa JavaScript, HTML, CSS e mais algumas coisinhas&#8230;</p>

<p>Conversando com alguns amigos, fui descobrindo que cada um tem o seu jeitinho para remediar este problema. Eu mesmo tenho comigo uma pasta cheia de cheat sheets que fui montando com o tempo. E quando eu falo pasta n&atilde;o estou me referindo a uma pasta no computador (diret&oacute;rio), e sim a uma pasta preta com pl&aacute;sticos cheia de papeis impressos com os cheats. Alguns deles eu fui pegando pela internet, outros eu mesmo montei. No meu caso &eacute; muito mais pr&aacute;tico assim.</p>

<p>Outra coisa que tem me ajudado bastante s&atilde;o sites como o <a href="http://www.noobkit.com/">Noobkit Docs</a>. O Noobkit &eacute; s&oacute; mais um site com a API do Ruby e do Rails, mas ele tem um recurso que me ajuda bastante na hora do aperto. Ele possui um <a href="http://www.noobkit.com/search/tools">plugin de pesquisa</a> para os principais navegadores, que torna muito mais r&aacute;pido procurar por algum m&eacute;todo especifico.</p>

<p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/11/firefox-search.png" alt="firefox-search.png" /></p>

<p>Outros sites que posso recomendar s&atilde;o:</p>

<ul>
    <li><a href="http://www.railsbrain.com/">RailsBrain</a>: Descobri este a pouco tempo. &Eacute; bem completo e parece que tenta se manter o mais atualizado poss&iacute;vel com as novas vers&otilde;es do Rails.</li>
    <li><a href="http://www.railsapi.org/">Ruby on Rails API</a>: Gosto do jeit&atilde;o deste site.</li>
    <li><a href="http://www.gotapi.com/html">gotAPI</a>: Este n&atilde;o &eacute; s&oacute; sobre RoR, aqui voc&ecirc; vai encontrar um pouco de tudo, HTML, CSS e at&eacute; Oracle e MySQL.</li>
</ul>


<p>&Eacute; assim que me viro na hora do esquecimento ou na falta de conhecimento mesmo. E voc&ecirc; como faz na hora do aperto?</p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/11/05/mac-no-pc/">Mac no PC</a></h1>
    
    
      <p class="meta">





  



<time datetime="2007-11-05T00:00:00-02:00" pubdate  data-updated="true" > 5 de Novembro de 2007</time></p>
    
  </header>


  <div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/11/2558193-6c3_display.jpg" alt="2558193-6c3_display.jpg" /></p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/11/03/quem-usa-radrails-deve-ler-o-blog-do-dr-nick/">Quem usa RadRails deve ler o blog do Dr. Nic</a></h1>
    
    
      <p class="meta">





  



<time datetime="2007-11-03T00:00:00-02:00" pubdate  data-updated="true" > 3 de Novembro de 2007</time></p>
    
  </header>


  <div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/11/130749539_89959dd059.jpg" alt="130749539_89959dd059.jpg" /></p>

<p>Existe uma coisa que n&atilde;o se discute na comunidade Rails, a IDE que cada um usa para desenvolver. Quem tem o seu <strong>Mac</strong>, na maior parte dos casos &eacute; un&acirc;nime quanto ao famoso <strong>TextMate</strong>. Mas aqueles que ainda est&atilde;o no Windows (blah) ou no Linux, a discuss&atilde;o &eacute; bem acirrada quanto &agrave; que IDE usar.</p>

<p>Tem muita gente usando o <strong>NetBeans</strong>, outros usam o <strong>Vim</strong>, <strong>Gedit</strong> e por a&iacute; vai. Antes de conhecer o TextMate eu experimentei cada um deles e o que usei por mais tempo foi o <strong>RadRails</strong> (ou Aptana+RadRails). No Windows ele &eacute; mais r&aacute;pido que o NetBeans e o Aptana tem algumas coisas bem legais para quem est&aacute; mechendo com HTML.</p>

<p>Parece que o <a href="http://drnicwilliams.com/category/radrails/">Dr. Nic</a> tamb&eacute;m gosta bastante do RadRails. De vez em quando ele d&aacute; algumas dicas bem legais para quem usa esta ferramenta. A sua &uacute;ltima dica foi <a href="http://radrailstemplates.com/">este site</a>, com templates para o RadRails.</p>

<p>Quem usa o RadRails com certeza vai gostar das dicas do <a href="http://drnicwilliams.com/">Dr. Nic</a>.</p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/11/02/333/">Magica no Ruby com blocos e símbolos</a></h1>
    
    
      <p class="meta">





  



<time datetime="2007-11-02T00:00:00-02:00" pubdate  data-updated="true" > 2 de Novembro de 2007</time></p>
    
  </header>


  <div class="entry-content"><p><center><img src="http://old.nomedojogo.com/wp-content/uploads/2007/11/392125498_7752990e1e.jpg" alt="392125498_7752990e1e.jpg" /></center></p>




<p>Sem d&uacute;vida nenhuma o Ruby tem algumas m&aacute;gicas que impressionam. Imagine por exemplo que eu queira pegar um <strong>array</strong> de <strong>strings</strong> e converter todas as palavras para mai&uacute;sculo, eu poderia fazer assim:</p>




<pre>
>> meu_array = %w(ruby on rails)
=> ["ruby", "on", "rails"]

>> meu_array = meu_array.map {|name| name.upcase}
=> ["RUBY", "ON", "RAILS"]
</pre>


<p>Bem simples. Para cada item do array eu executo o m&eacute;todo upcase e armazeno o resultado na vari&aacute;vel <strong>meu_array</strong>. Mas eu tamb&eacute;m poderia fazer assim:</p>

<pre>
>> meu_array = %w(ruby on rails)
=> ["ruby", "on", "rails"]

>> meu_array = meu_array.map(&:upcase)
=> ["RUBY", "ON", "RAILS"]
</pre>


<p>Acho que ficou ainda mais bonito: aplique o m&eacute;todo upcase para cada elemento de <strong>meu_array</strong>. O que acha?</p>

<p>Como isto funciona?</p>

<p>Quando usamos o operador <strong>&amp;</strong> na frente do nome de uma vari&aacute;vel estamos dizendo que esta vari&aacute;vel &eacute; um bloco. Mas no nosso caso <strong>:upcase</strong> n&atilde;o &eacute; um bloco e sim um s&iacute;mbolo. Neste caso o Ruby tenta converter nosso s&iacute;mbolo em um bloco chamando o m&eacute;todo <strong>to_proc</strong> da classe <strong>Symbol</strong>. Mas veja o c&oacute;digo do <a href="http://api.rubyonrails.org/classes/Symbol.html">m&eacute;todo</a> <strong>to_proc</strong>:</p>

<pre>
def to_proc
  Proc.new { |*args| args.shift.__send__(self, *args) }
end
</pre>


<p>J&aacute; entendeu? Este m&eacute;todo transforma o s&iacute;mbolo <strong>:upcase</strong> em um bloco, fazendo com que o exemplo acima na verdade seja executado desta maneira:</p>

<pre>
>> meu_array = meu_array.map {|*args| args.shift.__send__(:upcase, *args)}
=> ["RUBY", "ON", "RAILS"]
</pre>


<p>M&aacute;gica? Voc&ecirc; ainda n&atilde;o viu nada.</p>

<p>Agora imagine que eu tenha um classe <strong>User</strong> no Rails. Usando este recurso eu poderia fazer algo assim:</p>

<pre>
user = User.find(:all)

>> user.all?(&:valid?)
=> true

>> user.any?(&:valid?)
=> true

>> user.each(&:save!)
</pre>


<p>O <strong>Ruby</strong> tem as suas m&aacute;gicas e o <strong>Rails</strong> sabe usa-las muito bem.</p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/11/01/o-que-e-melhor-and-ou/">and ou &&, qual devo usar?</a></h1>
    
    
      <p class="meta">





  



<time datetime="2007-11-01T00:00:00-02:00" pubdate  data-updated="true" > 1 de Novembro de 2007</time></p>
    
  </header>


  <div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/11/217551252_423459c5c5.jpg" alt="217551252_423459c5c5.jpg" /></p>

<p>Tanto no Ruby como no Rails voc&ecirc; sempre vai encontrar muitas redund&acirc;ncias. Dois m&eacute;todos que fazem a mesma coisa ou duas formas diferentes de escrever o mesmo c&oacute;digo. E na maioria dos casos, voc&ecirc; vai at&eacute; analisar para ver se n&atilde;o existe uma pequena diferen&ccedil;a, mas vai descobrir, que n&atilde;o, realmente n&atilde;o existe nenhuma diferen&ccedil;a, s&atilde;o redund&acirc;ncias mesmo.</p>

<p>Algumas vezes isto complica, em outras ajuda. Mas quando se tem duas op&ccedil;&otilde;es para fazer a mesma coisa, qual usar?</p>

<p>H&aacute; alguns dias atr&aacute;s eu estava me perguntando, o que &eacute; melhor usar: a palavra chave <strong>and</strong> ou os s&iacute;mbolos <strong>&amp;&amp;</strong> e <strong>&amp;</strong>?</p>

<p>Na verdade, depende de quem est&aacute; programando, porque as duas op&ccedil;&otilde;es tem o mesmo resultado. Claro que os s&iacute;mbolos <strong>&amp;&amp;</strong> e <strong>&amp;</strong>, embora apresentem o mesmo resultado, tem uma leve diferen&ccedil;a. Basicamente o <strong>&amp;&amp;</strong> &eacute; mais inteligente que o <strong>&amp;</strong>, porque se a primeira afirma&ccedil;&atilde;o falhar, ele nem verifica a segunda, mais ou menos assim:</p>

<pre>
def metodo_a
  puts "metodo a"
  false
end

def metodo_b
  puts "metodo b"
  true
end

irb(main):011:0&gt; metodo_a &amp;&amp; metodo_b
metodo a
=&gt; false</pre>


<p>O <strong>&amp;</strong> j&aacute; &eacute; diferente, pois ele sempre vai verificar as duas condi&ccedil;&otilde;es independente do resultado da primeira.</p>

<pre>
irb(main):012:0&gt; metodo_a &amp; metodo_b
metodo a
metodo b
=&gt; false</pre>


<p>OK, mas e a&iacute;? Uso o <strong>&amp;&amp;</strong> ou a palavra-chave <strong>and</strong> nos meus c&oacute;digos? Tanto faz, &eacute; uma pura quest&atilde;o de est&eacute;tica. Mas para ajudar a tomar uma decis&atilde;o, d&ecirc; uma olhada na documenta&ccedil;&atilde;o do reposit&oacute;rio do Rails (<a href="http://dev.rubyonrails.org/#Sourcestyle">clique aqui</a>).</p>

<p>Como voc&ecirc; pode ver existe algumas recomenda&ccedil;&otilde;es para quem vai criar ou corrigir algo no c&oacute;digo do Rails, s&atilde;o:</p>

<ul>
    <li>Na tabula&ccedil;&atilde;o use dois espa&ccedil;os, n&atilde;o tab</li>
    <li> <font color="#008000">N&atilde;o use <strong>and</strong> ou <strong>or</strong> para testar booleanos, sempre use <strong>&amp;&amp;</strong> ou <strong>||</strong></font></li>
    <li><tt>MyClass.my_method(my_arg)</tt> &#8211; n&atilde;o <tt>my_method( my_arg )</tt> ou <tt>my_method my_arg</tt></li>
    <li>Siga as conven&ccedil;&otilde;es que voc&ecirc; encontrar no c&oacute;digo em volta.</li>
</ul>


<p>Eu optei por seguir as conven&ccedil;&otilde;es do Rails.</p>

<h3>[ATUALIZA&Ccedil;&Atilde;O]</h3>


<p>Conversando com o Akita, fizemos alguns testes e resolvi mostrar o porque da convens&atilde;o de se usar <strong>&amp;&amp;</strong> no Rails e n&atilde;o <strong>and</strong>.</p>

<p>Veja este exemplo:</p>

<pre>
>> x = true and false
=> false
</pre>


<p>Qual o valor da vari&aacute;vel x? Tem certeza?</p>

<pre>
>> x
=> true
</pre>


<p>Acontece que o operador <strong>=</strong> tem prioridade quanto ao <strong>and</strong>, no fim &eacute; como se a express&atilde;o fosse assim:</p>

<pre>
(x = true) and false
</pre>


<p>Exatamente para evitar estes problemas &eacute; melhor usar o <strong>&amp;&amp;</strong>.</p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/10/30/pingado-com-ruby/">Pingado com Ruby</a></h1>
    
    
      <p class="meta">





  



<time datetime="2007-10-30T00:00:00-02:00" pubdate  data-updated="true" >30 de Outubro de 2007</time></p>
    
  </header>


  <div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/10/504384364_4812cfa056.jpg" alt="504384364_4812cfa056.jpg" /></p>

<p>Precisei fazer isto agora pouco e como eu sei que pouca gente deve conhecer isto, resolvi postar. O software em que eu estou trabalhando no momento roda offline e realiza um sincronismo com o servidor quando est&aacute; online. Eu precisava ent&atilde;o criar um m&eacute;todo para verificar a conex&atilde;o no momento.</p>

<p>Como eu tamb&eacute;m nunca tinha precisado disto antes, fui pesquisar no Google, e no primeiro site que entrei descobri que nas bibliotecas padr&otilde;es do Ruby j&aacute; existe o que precisamos.</p>

<p>Veja como &eacute; simples:</p>

<pre class="textmate-source"><span class="source source_ruby source_ruby_rails"><span class="meta meta_require meta_require_ruby"><span class="keyword keyword_other keyword_other_special-method keyword_other_special-method_ruby">require</span> <span class="string string_quoted string_quoted_single string_quoted_single_ruby"><span class="punctuation punctuation_definition punctuation_definition_string punctuation_definition_string_begin punctuation_definition_string_begin_ruby">'</span>ping<span class="punctuation punctuation_definition punctuation_definition_string punctuation_definition_string_end punctuation_definition_string_end_ruby">'</span></span></span>

<span class="meta meta_function meta_function_method meta_function_method_without-arguments meta_function_method_without-arguments_ruby"><span class="keyword keyword_control keyword_control_def keyword_control_def_ruby">def</span> <span class="entity entity_name entity_name_function entity_name_function_ruby">is_online?</span></span>
  <span class="support support_class support_class_ruby">Ping</span><span class="punctuation punctuation_separator punctuation_separator_method punctuation_separator_method_ruby">.</span>pingecho <span class="string string_quoted string_quoted_double string_quoted_double_ruby"><span class="punctuation punctuation_definition punctuation_definition_string punctuation_definition_string_begin punctuation_definition_string_begin_ruby">"</span>google.com<span class="punctuation punctuation_definition punctuation_definition_string punctuation_definition_string_end punctuation_definition_string_end_ruby">"</span></span><span class="punctuation punctuation_separator punctuation_separator_object punctuation_separator_object_ruby">,</span> <span class="constant constant_numeric constant_numeric_ruby">5</span><span class="punctuation punctuation_separator punctuation_separator_object punctuation_separator_object_ruby">,</span> <span class="constant constant_numeric constant_numeric_ruby">80</span>
<span class="keyword keyword_control keyword_control_ruby">end</span></span></pre>


<p>&Eacute;, e tem gente que ainda n&atilde;o ama Ruby&#8230;</p>
</div>
  
  


  </article>

<nav role="pagination">
  <div>
    
      <a class="prev" href="/page/65/">&larr; Antigos</a>
    
    <a href="/blog/archives">Arquivo</a>
    
    <a class="next" href="/page/63/">Novos &rarr;</a>
    
  </div>
</nav>

<script type="text/javascript">
    var disqus_shortname = 'carlosbrando';
    (function () {
      var s = document.createElement('script'); s.async = true;
      s.type = 'text/javascript';
      s.src = 'http://' + disqus_shortname + '.disqus.com/count.js';
      (document.getElementsByTagName('HEAD')[0] || document.getElementsByTagName('BODY')[0]).appendChild(s);
    }());
</script>

</div>
<aside role=sidebar>
  
    <section>
  <h1>Artigos Recentes</h1>
  <ul id="recent_posts">
    
      <li class="post">
        <a href="/2011/09/12/contratos-onde-todos-ganham/">Contratos onde todos ganham</a>
      </li>
    
      <li class="post">
        <a href="/2011/08/25/como-convencer-sua-equipe-a-usar-um-sistema-de-controle-de-vers-o/">Como convencer sua equipe a usar um sistema de controle de versão</a>
      </li>
    
      <li class="post">
        <a href="/2011/08/19/blogando-como-um-hacker/">Blogando como um hacker</a>
      </li>
    
      <li class="post">
        <a href="/2011/06/13/a-regra-direita-esquerda-do-c/">A Regra Direita-Esquerda do C</a>
      </li>
    
      <li class="post">
        <a href="/2011/06/03/colorific/">Colorific</a>
      </li>
    
  </ul>
</section>

<section>
  <h1>Últimos Tweets</h1>
  <ul id="tweets">
    <li class="loading">Atualizando&#8230;</li>
  </ul>
  <script type="text/javascript">
    $.domReady(function(){
      getTwitterFeed("carlosbrando", 4, false);
    });
  </script>
  <script src="/javascripts/twitter.js" type="text/javascript"> </script>
  
    <a href="http://twitter.com/carlosbrando" class="twitter-follow-button" data-width="208px" data-show-count="false">Siga @carlosbrando</a>
  
</section>


<section>
  <h1>Open Source</h1>
  <ul id="gh_repos">
    <li class="loading">Atualizando&#8230;</li>
  </ul>
  
  <a href="https://github.com/carlosbrando">@carlosbrando</a> no Github
  
  <script type="text/javascript">
    $.domReady(function(){
        if (!window.jXHR){
            var jxhr = document.createElement('script');
            jxhr.type = 'text/javascript';
            jxhr.src = '/javascripts/libs/jXHR.js';
            var s = document.getElementsByTagName('script')[0];
            s.parentNode.insertBefore(jxhr, s);
        }

        github.showRepos({
            user: 'carlosbrando',
            count: 4,
            skip_forks: false,
            target: '#gh_repos'
        });
    });
  </script>
  <script src="/javascripts/github.js" type="text/javascript"> </script>
</section>




  
</aside>

    </div>
  </div>
  <footer><p>
  Copyright &copy; 2011 - Carlos Brando -
  <span class="credit">Powered by <a href="http://octopress.org">Octopress</a></span>
</p>

</footer>
  
  <script type="text/javascript">
    var _gaq = _gaq || [];
    _gaq.push(['_setAccount', 'UA-1249636-1']);
    _gaq.push(['_trackPageview']);

    (function() {
      var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
      ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
      var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
    })();
  </script>


  
  <script type="text/javascript">
    (function() {
      var script = document.createElement('script'); script.type = 'text/javascript'; script.async = true;
      script.src = 'https://apis.google.com/js/plusone.js';
      var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(script, s);
    })();
  </script>


  
  <script type="text/javascript">
    (function(){
      var twitterWidgets = document.createElement('script');
      twitterWidgets.type = 'text/javascript';
      twitterWidgets.async = true;
      twitterWidgets.src = 'http://platform.twitter.com/widgets.js';
      document.getElementsByTagName('head')[0].appendChild(twitterWidgets);
    })();
  </script>


</body>
</html>
