
<!DOCTYPE html>
<!--[if IEMobile 7 ]><html class="no-js iem7"><![endif]-->
<!--[if lt IE 9]><html class="no-js lte-ie8"><![endif]-->
<!--[if (gt IE 8)|(gt IEMobile 7)|!(IEMobile)|!(IE)]><!--><html class="no-js" lang="en"><!--<![endif]-->
<head>
  <meta charset="utf-8">
  <title>Nome do Jogo</title>
  <meta name="author" content="Carlos Brando">
  

  <!-- http://t.co/dKP3o1e -->
  <meta name="HandheldFriendly" content="True">
  <meta name="MobileOptimized" content="320">
  <meta name="viewport" content="width=device-width, initial-scale=1">

  

  <link rel="canonical" href="http://nomedojogo.com/page/79/index.html"/>
  <link href="/favicon.png" rel="shortcut icon" />
  <link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
  <script src="/javascripts/modernizr-2.0.js"></script>
  <script src="http://s3.amazonaws.com/ender-js/jeesh.min.js"></script>
  <script src="/javascripts/octopress.js" type="text/javascript"></script>
  <link href="http://feeds2.feedburner.com/NomeDoJogo" rel="alternate" title="Nome do Jogo" type="application/atom+xml"/>
  
  <script type="text/javascript">
    var _gaq = _gaq || [];
    _gaq.push(['_setAccount', 'UA-1249636-1']);
    _gaq.push(['_trackPageview']);

    (function() {
      var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
      ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
      var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
    })();
  </script>


  
  <script type="text/javascript">
    (function() {
      var script = document.createElement('script'); script.type = 'text/javascript'; script.async = true;
      script.src = 'https://apis.google.com/js/plusone.js';
      var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(script, s);
    })();
  </script>


  
  <script type="text/javascript">
    (function(){
      var twitterWidgets = document.createElement('script');
      twitterWidgets.type = 'text/javascript';
      twitterWidgets.async = true;
      twitterWidgets.src = 'http://platform.twitter.com/widgets.js';
      document.getElementsByTagName('head')[0].appendChild(twitterWidgets);
    })();
  </script>


  <!--Fonts from Google's Web font directory at http://google.com/webfonts -->
<link href='http://fonts.googleapis.com/css?family=PT+Serif:regular,italic,bold,bolditalic' rel='stylesheet' type='text/css'>
<link href='http://fonts.googleapis.com/css?family=PT+Sans:regular,italic,bold,bolditalic' rel='stylesheet' type='text/css'>

</head>

<body  >
  <header><hgroup>
  <h1><a href="/">Nome do Jogo</a></h1>
  
    <h2>por Carlos Brando</h2>
  
</hgroup>

</header>
  <nav role=navigation><ul role=subscription data-subscription="rss">
  <li><a href="http://feeds2.feedburner.com/NomeDoJogo" rel="subscribe-rss" title="subscribe via RSS">RSS</a></li>
  
</ul>
<form action="http://google.com/search" method="get">
  <fieldset role="site-search">
    <input type="hidden" name="q" value="site:nomedojogo.com" />
    <input class="search" type="text" name="q" results="0" placeholder="Search"/>
  </fieldset>
</form>
<ul role=main-navigation>
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Arquivo</a></li>
</ul>

</nav>
  <div id="main">
    <div id="content">
      <div class="blog-index">



  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/24/so-tenho-uma-coisa-a-dizer-ruby-on-rails/">Só tenho uma coisa a dizer: &#8220;Ruby on Rails&#8221;</a></h1>
    
    
      <p class="meta">




<time datetime="2007-03-24 00:00:00 -0300" pubdate  updated >24 de Março de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/03/stacks.jpg" alt="Ruby on Rails" title="Ruby on Rails" align="middle" /></p>

<p>vi no blog do <a href="http://rafael.adm.br/p/justificando-minha-escolha/" target="_blank" title="Rafael Lima">Rafael Lima</a></p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/23/temos-todo-tempo-do-mundo/">Temos todo tempo do mundo&#8230;</a></h1>
    
    
      <p class="meta">




<time datetime="2007-03-23 00:00:00 -0300" pubdate  updated >23 de Março de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><blockquote>O tempo &eacute; Merc&uacute;rio-Cromo
E tempo &eacute; tudo que somos&#8230;</blockquote>


<p><a atomicselection="true" href="http://old.nomedojogo.com/wp-content/uploads/writer/Temostodotempodomundo_C6D0/relsol4.jpg"><img border="0" align="left" width="240" src="http://old.nomedojogo.com/wp-content/uploads/writer/Temostodotempodomundo_C6D0/relsol_thumb2.jpg" height="159" style="border: 0px" /></a> O tempo pode abrandar a raiva, entender os erros, acalmar uma paix&atilde;o arrebatadora, mas ser&aacute; que nos faz esquecer?
Algumas feridas jamais cicatrizam.
O tempo n&atilde;o obedece a nenhum senhor e sempre tem vontade pr&oacute;pria.</p>

<p>Vez por outra sempre pensamos em como seria se pud&eacute;ssemos voltar no tempo.
O que eu faria diferente?
Meus erros e acertos passados s&atilde;o indubitavelmente tudo que sou hoje.
Houve um tempo em que acreditei que poderia moldar meu futuro.
Somos incapazes de moldar o presente.</p>

<p>Somos levianos na maioria das quest&otilde;es e o tempo n&atilde;o diminui seu ritmo para que possamos perceber.
Tudo ser&aacute; sempre uma quest&atilde;o de tempo&#8230;
E quanto tempo dura o para sempre?</p>

<p>Sempre t&atilde;o apressados, vamos de um lado para o outro sem se aperceber que tudo acontece agora.
N&atilde;o podemos voltar ao passado e nem moldar com exatid&atilde;o o futuro, s&oacute; podemos ser o que somos hoje.
&#8220;Basta a cada dia seu pr&oacute;prio mal&#8221;</p>

<p>No entanto toda vez que escuto algu&eacute;m dizer &quot;estou aprendendo a viver um dia de cada vez&#8221;, torno a me questionar se h&aacute; outro jeito.
Porque s&oacute; consigo pensar no que serei, e tudo que ficou para tr&aacute;s de algum modo ainda deixa suas marcas.</p>

<blockquote>Se temos todo tempo do mundo ent&atilde;o porque n&atilde;o temos tempo a perder?</blockquote>

</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/21/seu-blog-no-te-pertence/">Seu blog não te pertence</a></h1>
    
    
      <p class="meta">




<time datetime="2007-03-21 00:00:00 -0300" pubdate  updated >21 de Março de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/03/windowslivewriterseublognotepertence-782auntitled4.jpg" style="border-width: 0px" align="right" border="0" height="169" width="240" />As pessoas resolvem montar um blog por dois motivos:</p>

<ul>
    <li>expor suas id&eacute;ias e gostos pessoais.</li>
    <li>ganhar dinheiro.</li>
</ul>


<p>Independente do motivo escolhido, uma coisa &eacute; certa, precisamos de visitas. Sem visitas e coment&aacute;rios, ningu&eacute;m tem motiva&ccedil;&atilde;o para escrever, e muito menos vai ganhar algum dinheiro com blog.</p>

<p>Pensando por este ponto de vista, o blog que voc&ecirc; montou, pagou para ser hospedado em um lugar decente, escolheu o template mais adequado, fez um monte de altera&ccedil;&otilde;es para que ficasse com a sua cara, e escreve todo santo dia&#8230; <strong>N&Atilde;O TE PERTENCE</strong>.</p>

<p>Tudo no seu blog pertence o leitor. Quando escrever, pense nas pessoas que estar&atilde;o lendo. Corrija os erros de ortografia (<strike>ortogr&aacute;fica</strike>, olha eu pagando mico&#8230;), verifique se seu texto n&atilde;o est&aacute; sendo contradit&oacute;rio, e se suas frases fazem sentido.</p>

<p>O layout do blog tamb&eacute;m &eacute; t&atilde;o importante quanto o conte&uacute;do que voc&ecirc; publica. Blogs com fundo preto, cheios de imagens piscando, normalmente fazem as pessoas correrem. O melhor &eacute; ter uma p&aacute;gina limpa, que carregue r&aacute;pido e sem imagens ofensivas, as pessoas costumam navegar muito mais durante o expediente de trabalho e n&atilde;o entrar&atilde;o no seu blog se este chamar muita aten&ccedil;&atilde;o.</p>

<p>Esque&ccedil;a o dinheiro, pense na realiza&ccedil;&atilde;o pessoal. Escreva muito, escreva com o cora&ccedil;&atilde;o, mas n&atilde;o esque&ccedil;a para quem voc&ecirc; est&aacute; escrevendo, o blog pertence a quem o l&ecirc;.</p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/20/o-fim-do-mundo-mad-max-sem-mel-gibson/">É o fim do mundo! Mad Max sem Mel Gibson</a></h1>
    
    
      <p class="meta">




<time datetime="2007-03-20 00:00:00 -0300" pubdate  updated >20 de Março de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p></p></p>

<p><img style="border-top-width: 0px; border-left-width: 0px; border-bottom-width: 0px; border-right-width: 0px" height="150" src="http://old.nomedojogo.com/wp-content/uploads/writer/ofimdomundoMadMaxsemMelGibson_85AF/08937465003.jpg" width="240" align="right" border="0">AÂ coluna de entretenimento do Globo.comÂ publicouÂ a seguinte noticia:
<p>&#8220;O diretor da s&eacute;rie &#8220;Mad Max&#8221;, o australiano George Miller, pretende levar o her&oacute;i Mad de novo &agrave;s telas,Â mas n&atilde;oÂ mais comÂ Mel Gibson, que ele acha muito velho para o papel.</p>
<blockquote><p>N&atilde;o ser&aacute; Mel. Ele tinha 21 anos quando fez o primeiro filme. Agora est&aacute; muito mais velho e sua paix&atilde;o &eacute; dirigir filmes</p>
</blockquote>
<p>Disse Miller, citado pela ag&ecirc;ncia australiana AAP.</p>
<p>O novo Max Rockatansky ser&aacute; um ator jovem, com potencial para ser um astro, disse o cineasta, sem citar poss&iacute;veis candidatos.</p>
<p>Mad Max sem Mel Gibson?
<p>O mundo cinematogr&aacute;fico anda carente de her&oacute;is e de &iacute;cones com carisma verdadeiro.
<p>Vide a lista de personagens que est&atilde;o sendo ressuscitados:
<p>Rocky, John Mcclane o cara que nunca morre (Bruce Willis em Duro de matar), j&aacute; se fala de um novoÂ Â Rambo, e seÂ o Harrison Ford n&atilde;o morrer, ainda vamos ver o av&ocirc; Indiana Jones&#8230;
<p>Mas o Mad Max sem Mel Gibson? Aonde tudo isso vai parar?</p>

</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/20/curriculum-vitae-mostre-o-seu-blog/">Curriculum vitae? Mostre o seu blog</a></h1>
    
    
      <p class="meta">




<time datetime="2007-03-20 00:00:00 -0300" pubdate  updated >20 de Março de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p></p>


<p> <p><img style="border-right: 0px; border-top: 0px; border-left: 0px; border-bottom: 0px" height="240" src="http://old.nomedojogo.com/wp-content/uploads/writer/CurriculumvitaeAcesseomeublog_14716/Untitled13.jpg" width="166" align="left" border="0"> Li um post no <a title="Mem&oacute;ria Virtual" href="http://memoriavirtual.net/" target="_blank">mem&oacute;ria virtual</a> (um blog portugu&ecirc;s) que lan&ccedil;ava a seguinte pergunta: &#8220;Blogs s&atilde;o os novos curr&iacute;culos?&#8221;. <p>Os argumentos lan&ccedil;ados s&atilde;o que um blog d&aacute; uma imagem mais din&acirc;mica das capacidades do autor. Em contrapartida alguns empregadores podem n&atilde;o desejar ter em sua equipe uma pessoa &#8220;p&uacute;blica&#8221; e exposta &agrave; pol&ecirc;mica. <p>Particularmente acredito que isto depende muito do seu blog e da forma como voc&ecirc; o encara, al&eacute;m do trabalho que est&aacute; procurando. Se seu blog &eacute; profissional (n&atilde;o estou me referindo aos ProBloggers) no sentido de ter textos bem produzidos, pode ser uma porta de entrada desde que os assuntos abordados no blog sejam relevantes para a vaga desejada e mostrem seu profundo conhecimento no assunto. <p>De nada adianta exibir um blog de&nbsp;culin&aacute;ria ao ser entrevistado para uma vaga de gerente numa empresa de tecnologia. <p>Acredito que um blog est&aacute; mais para um cart&atilde;o de visitas do que um curr&iacute;culo. Leonel Vicente (outro blogger portugu&ecirc;s) disse que quando escrevemos para nossos blogs, tentamos passar a melhor impress&atilde;o poss&iacute;vel, mas &eacute; imposs&iacute;vel esconder nossa verdadeira personalidade, e isto pode contar na hora de uma entrevista.</p> <p>N&atilde;o podemos negar que ter um blog conhecido o torna uma referencia no assunto (tema) principal do seu blog. Se voc&ecirc; n&atilde;o &eacute; um blogger famoso, escreva o que lhe der na telha. Mas se voc&ecirc; j&aacute; adquiriu visibilidade, muito cuidado, voc&ecirc; est&aacute; escrevendo o seu cart&atilde;o de visitas.</p></p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/19/pesquisas-do-google-sero-annimas/">Pesquisas do Google serão anônimas</a></h1>
    
    
      <p class="meta">




<time datetime="2007-03-19 00:00:00 -0300" pubdate  updated >19 de Março de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p>Quando voc&ecirc; faz uma pesquisa no site do Google eles armazenam informa&ccedil;&otilde;es sobre a pesquisa realizada, seu endere&ccedil;o IP e cookies. Acontece <a href="http://old.nomedojogo.com/wp-content/uploads/writer/AspesquisasnoGoogleseroannimas_9566/Untitled12.jpg" atomicselection="true"><img src="http://old.nomedojogo.com/wp-content/uploads/writer/AspesquisasnoGoogleseroannimas_9566/Untitled1_thumb.jpg" style="border-width: 0px" align="left" border="0" height="240" width="162" /></a>que muita gente discorda disto e diz ser uma invas&atilde;o de privacidade.</p>

<p>Saiu no <a href="http://googleblog.blogspot.com/2007/03/taking-steps-to-further-improve-our.html" title="Google" target="_blank">blog oficial</a> do Google, que no prazo de at&eacute; um ano isto ser&aacute; alterado. Depois de um per&iacute;odo de 18 a 24 meses nossos dados continuar&atilde;o a ser armazenados, mas de uma forma an&ocirc;nima.</p>

<p>A partir da&iacute;, nossos dados somente ser&atilde;o coletados se desejarmos, com a finalidade de deixar as buscas mais personalizadas usando o <a href="http://www.google.com/searchhistory" title="Search History" target="_blank">Hist&oacute;rico de pesquisas</a>.</p>

<p>Claro que mesmo hoje j&aacute; podemos fazer pesquisas e navegar na internet anonimamente usando ferramentas como o <a href="http://tor.eff.org/" title="Tor" target="_blank">Tor</a>, ou <a href="http://www.samair.ru/proxy/" title="Proxys An&ocirc;nimos" target="_blank">proxys an&ocirc;nimos</a>.</p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/19/educao-financeira-fluxo-real-e-econmico/">Educação financeira: Fluxo real e econômico</a></h1>
    
    
      <p class="meta">




<time datetime="2007-03-19 00:00:00 -0300" pubdate  updated >19 de Março de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p>O sistema econômico funciona da seguinte maneira: As famílias fornecem seus recursos (mão de obra) às empresas e as empresas produzem e fornecem às famílias os bens e serviços de que necessitam. Chamamos isto de <strong>fluxo real</strong>.</p>

<p>Com o auxílio do dinheiro (moeda), as empresas pagam às famílias pelo serviço realizado e, por sua vez, as famílias, também com o auxilio do dinheiro, pagam às empresas os bens e serviços adquiridos, o que configura o <strong>fluxo monetário</strong>.</p>

<p>O fluxo real e o monetário interligam as famílias e as empresas, que são o que chamamos de <strong>agentes econômicos.</strong></p>

<p>Do lado do fluxo real estão o emprego dos recursos e o suprimento de bens e serviços necessários. Do lado monetário se dá a remuneração dos fatores de produção e o pagamento dos bens e serviços adquiridos.</p>

<p>Mas ainda existe mais um agente econômico que não mencionamos, mas deve ser incluído: <strong>o governo</strong>.</p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/18/blogueiros-iranianos-protestam-contra-o-filme-300/">Blogueiros iranianos protestam contra o filme 300</a></h1>
    
    
      <p class="meta">




<time datetime="2007-03-18 00:00:00 -0300" pubdate  updated >18 de Março de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p><a atomicselection="true" href="http://old.nomedojogo.com/wp-content/uploads/writer/Blogueirosiranianosprotestamcontraofilme_70/Untitled17.jpg"><img border="0" align="right" width="181" src="http://old.nomedojogo.com/wp-content/uploads/writer/Blogueirosiranianosprotestamcontraofilme_70/Untitled1_thumb5.jpg" height="240" style="border-width: 0px" /></a> O filme j&aacute; foi assunto de um <a target="_blank" href="http://www.nomedojogo.com/2007/02/28/300/" title="300">post antigo</a> aqui no blog. Acontece que a comunidade iraniana argumenta que o filme mostra uma P&eacute;rsia antiga irrespons&aacute;vel e distorcida. Dizem ainda que o filmeÂ seja um ataque a cultura iraniana.</p>

<p>Como forma de protesto, blogueiros do Ir&atilde; se uniram numa campanha contra o filme.</p>

<p>Pendar Yousefi, um blogueiro iraniano residente do Canad&aacute; criou um site revelando os fatos reais da cultura de seu pa&iacute;s, com uma bela galeria de imagens e uma s&eacute;rie de artigos sobre o assunto.Â E com a ajuda de mais de 600 outros blogueiros iranianos que colocaram links em seus blogs apontando para o site de Yousefi ele recebeu uma excelente classifica&ccedil;&atilde;o na pesquisa do Google sobre o tema do filme.</p>

<p>Para acessar o site do protesto <a target="_blank" href="http://300themovie.info/" title="Protesto">clique aqui</a>.</p>

<p>Isto mostra a for&ccedil;a que n&oacute;s, blogueiros temos. Sob um ideal comum, podemos fazer muito.</p>

<p>Veja um exemplo, lembra o caso do menino Jo&atilde;o H&eacute;lio, no Rio de Janeiro, que foi arrastado por 7 km preso ao cinto de seguran&ccedil;a de um carro? Que tal fazer um post no seu blog e colocar o link para o site &#8221;<a target="_blank" href="http://euvoufazeralgo.com.br/" title="Eu vou fazer algo">Eu vou fazer algo</a>&#8221;?</p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/17/faa-uma-favor-para-o-seu-blog-leia-mais/">Faça um favor para o seu blog: Leia Mais</a></h1>
    
    
      <p class="meta">




<time datetime="2007-03-17 00:00:00 -0300" pubdate  updated >17 de Março de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p>Todo mundo sabe que para escrever cada vez melhor, nada como escrever muito. Mas alguns se esquecem que para melhorar sua escrita tamb&eacute;m &eacute; necess&aacute;rio ler muito. N&atilde;o estou me referindo a ler os feeds do seu blog predileto, mas sim ler livros e revistas de qualidade, e bem escritos.</p>


<p> <p>Conhe&ccedil;o alguns blogueiros que n&atilde;o se d&atilde;o ao trabalho de ler nem mesmo o que acabaram de escrever. Se voc&ecirc; &eacute; um destes, pense o seguinte: Se nem voc&ecirc; mesmo gosta do que escreveu, porque outra pessoa iria gostar?</p> <p><img style="border-top-width: 0px; border-left-width: 0px; border-bottom-width: 0px; border-right-width: 0px" height="171" src="http://old.nomedojogo.com/wp-content/uploads/writer/FaaumafavorparaoseublogLeiaMais_E416/Untitled114.jpg" width="240" align="right" border="0">Mais importante do que escrever muito &eacute; ler muito. Leia tudo que puder, livros, revistas, propaganda, qualquer coisa, desde que tenha qualidade e compare com o que voc&ecirc; escreve.</p> <p>Uma escrita ruim ou com erros de portugu&ecirc;s pode transformar o mais interessante dos assuntos em algo chato. E o contr&aacute;rio tamb&eacute;m &eacute; uma verdade.</p> <p>Aceite o conselho: escreva muito, leia mais ainda.</p></p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/16/eu-queria-ser-um-don/">Eu queria ser um Don</a></h1>
    
    
      <p class="meta">




<time datetime="2007-03-16 00:00:00 -0300" pubdate  updated >16 de Março de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p><a href="http://old.nomedojogo.com/wp-content/uploads/2007/03/two-dons-sharma31oct03.gif" rel="lightbox" title="Two-Dons-Sharma31oct03.GIF"><img src="http://old.nomedojogo.com/wp-content/uploads/2007/03/two-dons-sharma31oct03-tn.jpg" style="DISPLAY: inline; FLOAT: right; WIDTH: 185px; HEIGHT: 200px" title="Two-Dons-Sharma31oct03.GIF" height="200" width="185" alt="Two-Dons-Sharma31oct03.GIF" border="0" id="urn:zoundry:jid:Two-Dons-Sharma31oct03.GIF"/></a>Todo homem gostaria de ser um Don.<br/>Isso significa proteger a fam&iacute;lia, ser reconhecido no trabalho e ter o respeito dos amigos.<br/>Don Vito conseguiu tudo isso, Don Michael n&atilde;o.<br/><br/>Que Don eu serei?<br/>Talvez um Anthony Soprano, tirando a parte dos assassinatos e da m&atilde;e louca&#8230;<br/><br/>Mesmo um Don pode ter ataques de p&acirc;nico, medo e incerteza.<br/>N&atilde;o vou procurar uma psicanalista.<br/>Ainda tenho o pr&eacute;-conceito que isso &eacute; coisa pra maluco, e que &eacute; muito caro.<br/><br/>A quest&atilde;o &eacute;:<br/>&Eacute; muito mais dif&iacute;cil hoje ser um Don do que era h&aacute; alguns anos atr&aacute;s&#8230;<br/>Na &eacute;poca do meu pai, que foi uma esp&eacute;cie peculiar de Don, os homens n&atilde;o conheciam o estresse e a depress&atilde;o.<br/>Isso n&atilde;o era coisa de Homem, era coisa de fresco.
</div>
  
  
    <footer>
      <a rel="full-article" href="/2007/03/16/eu-queria-ser-um-don/">Read on &rarr;</a>
    </footer>
  


  </article>

<nav role="pagination">
  <div>
    
      <a class="prev" href="/page/80/">&larr; Antigos</a>
    
    <a href="/blog/archives">Arquivo</a>
    
    <a class="next" href="/page/78/">Novos &rarr;</a>
    
  </div>
</nav>

<script type="text/javascript">
    var disqus_shortname = 'carlosbrando';
    (function () {
      var s = document.createElement('script'); s.async = true;
      s.type = 'text/javascript';
      s.src = 'http://' + disqus_shortname + '.disqus.com/count.js';
      (document.getElementsByTagName('HEAD')[0] || document.getElementsByTagName('BODY')[0]).appendChild(s);
    }());
</script>

</div>
<aside role=sidebar>
  
    <section>
  <h1>Recent Posts</h1>
  <ul id="recent_posts">
    
      <li class="post">
        <a href="/2011/08/25/como-convencer-sua-equipe-a-usar-um-sistema-de-controle-de-vers-o/">Como convencer sua equipe a usar um sistema de controle de versão</a>
      </li>
    
      <li class="post">
        <a href="/2011/08/19/blogando-como-um-hacker/">Blogando como um hacker</a>
      </li>
    
      <li class="post">
        <a href="/2011/06/13/a-regra-direita-esquerda-do-c/">A Regra Direita-Esquerda do C</a>
      </li>
    
      <li class="post">
        <a href="/2011/06/03/colorific/">Colorific</a>
      </li>
    
      <li class="post">
        <a href="/2011/03/29/quem-disse-que-gravar-um-podcast-e-facil/">Quem disse que gravar um podcast é fácil?</a>
      </li>
    
  </ul>
</section>

<section>
  <h1>Latest Tweets</h1>
  <ul id="tweets">
    <li class="loading">Status updating&#8230;</li>
  </ul>
  <script type="text/javascript">
    $.domReady(function(){
      getTwitterFeed("carlosbrando", 4, false);
    });
  </script>
  <script src="/javascripts/twitter.js" type="text/javascript"> </script>
  
    <a href="http://twitter.com/carlosbrando" class="twitter-follow-button" data-width="208px" data-show-count="false">Follow @carlosbrando</a>
  
</section>




  
</aside>

    </div>
  </div>
  <footer><p>
  Copyright &copy; 2011 - Carlos Brando -
  <span class="credit">Powered by <a href="http://octopress.org">Octopress</a></span>
</p>

</footer>
</body>
</html>
