
<!DOCTYPE html>
<!--[if IEMobile 7 ]><html class="no-js iem7"><![endif]-->
<!--[if lt IE 9]><html class="no-js lte-ie8"><![endif]-->
<!--[if (gt IE 8)|(gt IEMobile 7)|!(IEMobile)|!(IE)]><!--><html class="no-js" lang="en"><!--<![endif]-->
<head>
  <meta charset="utf-8">
  <title>Nome do Jogo</title>
  <meta name="author" content="Carlos Brando">
  

  <!-- http://t.co/dKP3o1e -->
  <meta name="HandheldFriendly" content="True">
  <meta name="MobileOptimized" content="320">
  <meta name="viewport" content="width=device-width, initial-scale=1">

  

  <link rel="canonical" href="http://nomedojogo.com/page/76/index.html"/>
  <link href="/favicon.png" rel="shortcut icon" />
  <link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
  <script src="/javascripts/modernizr-2.0.js"></script>
  <script src="http://s3.amazonaws.com/ender-js/jeesh.min.js"></script>
  <script src="/javascripts/octopress.js" type="text/javascript"></script>
  <link href="http://feeds2.feedburner.com/NomeDoJogo" rel="alternate" title="Nome do Jogo" type="application/atom+xml"/>
  
  <script type="text/javascript">
    var _gaq = _gaq || [];
    _gaq.push(['_setAccount', 'UA-1249636-1']);
    _gaq.push(['_trackPageview']);

    (function() {
      var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
      ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
      var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
    })();
  </script>


  
  <script type="text/javascript">
    (function() {
      var script = document.createElement('script'); script.type = 'text/javascript'; script.async = true;
      script.src = 'https://apis.google.com/js/plusone.js';
      var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(script, s);
    })();
  </script>


  
  <script type="text/javascript">
    (function(){
      var twitterWidgets = document.createElement('script');
      twitterWidgets.type = 'text/javascript';
      twitterWidgets.async = true;
      twitterWidgets.src = 'http://platform.twitter.com/widgets.js';
      document.getElementsByTagName('head')[0].appendChild(twitterWidgets);
    })();
  </script>


  <!--Fonts from Google's Web font directory at http://google.com/webfonts -->
<link href='http://fonts.googleapis.com/css?family=PT+Serif:regular,italic,bold,bolditalic' rel='stylesheet' type='text/css'>
<link href='http://fonts.googleapis.com/css?family=PT+Sans:regular,italic,bold,bolditalic' rel='stylesheet' type='text/css'>

</head>

<body  >
  <header><hgroup>
  <h1><a href="/">Nome do Jogo</a></h1>
  
    <h2>por Carlos Brando</h2>
  
</hgroup>

</header>
  <nav role=navigation><ul role=subscription data-subscription="rss">
  <li><a href="http://feeds2.feedburner.com/NomeDoJogo" rel="subscribe-rss" title="assine via RSS">RSS</a></li>
  
</ul>
<form action="http://google.com/search" method="get">
  <fieldset role="site-search">
    <input type="hidden" name="q" value="site:nomedojogo.com" />
    <input class="search" type="text" name="q" results="0" placeholder="Pesquisar"/>
  </fieldset>
</form>
<ul role=main-navigation>
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Arquivo</a></li>
</ul>

</nav>
  <div id="main">
    <div id="content">
      <div class="blog-index">



  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/05/28/construindo-software-faa-somente-o-necessrio/">Construindo Software: Faça somente o necessário</a></h1>
    
    
      <p class="meta">




<time datetime="2007-05-28 00:00:00 -0300" pubdate  updated >28 de Maio de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p> <center><img height="267" src="http://old.nomedojogo.com/wp-content/uploads/2007/05/windowslivewriterconstruindosoftwarefaasomenteonecessrio-8bf1keyboard-ctrl-alt-del1.jpg" width="433"></center> <p></p> <p>Antes de iniciar o desenvolvimento do <a href="http://www.carreirati.com">carreiraTI</a>, em minha mente eu tinha um milh&atilde;o de id&eacute;ias sobre o que exatamente deveria ser constru&iacute;do. Mas, quando comecei a desenvolver, percebi que tinha de tomar uma decis&atilde;o muito importante.</p> <p><strong>O que &eacute; essencial para meu produto, e o que deve ficar de fora?</strong>  <p>Como muita gente j&aacute; sabe, sou entusiasta do <a href="http://gettingreal.37signals.com/GR_por.php">Getting Real</a>, e resolvi seguir as dicas do livro para tomar esta decis&atilde;o.  <p>Durante o desenvolvimento, em alguns momentos voc&ecirc; diz: &#8220;Poxa, seria legal se o site tivesse isto&#8230;&#8221; ou &#8220;Caramba, se eu colocasse isto no site ia ficar legal&#8230;&#8221;. Acontece que <strong>&#8220;legal&#8221;</strong> n&atilde;o &eacute; necessariamente <strong>&#8220;essencial&#8221;</strong>.  <p>Comece a constru&ccedil;&atilde;o do seu software criando o que &eacute; essencial, aquilo que se n&atilde;o existir n&atilde;o tem software. E deixe o &#8220;legal&#8221; para a vers&atilde;o 2.0.  <p>No <a href="http://www.carreirati.com">carreiraTI</a>, eu tinha a id&eacute;ia de construir um cadastro de curr&iacute;culos, que permitisse o envio autom&aacute;tico para vagas dentro do meu perfil, se configurado para isto. Ia ser legal pra caramba ter esta funcionalidade, mas j&aacute; conseguem imaginar o trabalho que isto daria? Quanto tempo eu atrasaria a publica&ccedil;&atilde;o do site?  <p>Ainda tenho muitas id&eacute;ias para o <a href="http://www.carreirati.com">carreiraTI</a>, mas estou criando o essencial. O legal vai ficar mesmo para a vers&atilde;o 2.0.  <p>Afinal, o <a href="http://www.carreirati.com">carreiraTI</a> foi criado para ajudar as pessoas a conseguir um emprego melhor, e isto por si s&oacute; j&aacute; &eacute; algo muito legal!  <p>Aguardem que ainda tem muitas novidades por vir.</p>

</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/05/25/ruby-on-rails-novo-site-para-consulta-das-apis-do-rails/">Ruby on Rails: Novo site para consulta das APIs do Rails</a></h1>
    
    
      <p class="meta">




<time datetime="2007-05-25 00:00:00 -0300" pubdate  updated >25 de Maio de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p> <center><img height="227" src="http://old.nomedojogo.com/wp-content/uploads/writer/RubyonRailsNovositeparaconsultadasAPIsdo_EC06/Untitled1.jpg" width="500"></center> <p></p> <p>Foi lan&ccedil;ado ontem um novo site para consulta da documenta&ccedil;&atilde;o do Rails, o <a href="http://www.noobkit.com/">Noobkit Docs</a>. Por ter apenas um dia de vida o site ainda tem poucas informa&ccedil;&otilde;es, mas me pareceu bem interessante.</p> <p>A visualiza&ccedil;&atilde;o &eacute; feita por meio de uma &aacute;rvore de diret&oacute;rios e &eacute; baseada nos pakages/gems, modulos e classes do Rails.</p> <p>Os desenvolvedores ainda prometem que as paginas seguir&atilde;o o conceito wiki para atualiza&ccedil;&atilde;o, onde cada usu&aacute;rio pode complementar as informa&ccedil;&otilde;es e dar exemplos de utiliza&ccedil;&atilde;o.</p> <p>Vale a visita.</p>

</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/05/25/3-maneiras-de-fazer-dinheiro-com-seu-software/">3 maneiras de fazer dinheiro com seu software</a></h1>
    
    
      <p class="meta">




<time datetime="2007-05-25 00:00:00 -0300" pubdate  updated >25 de Maio de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p></p>


<p> <p>H&aacute; tr&ecirc;s maneiras b&aacute;sicas de se fazer dinheiro com seu software baseado na web. Vamos falar delas&#8230;  <p><strong>Propaganda</strong><br />Forne&ccedil;a seu produto de gra&ccedil;a e coloque propaganda em torno dele. Voc&ecirc; pode fazer isto com softwares para desktops (da mesma maneira como o MSN e outros fazem) ou softwares baseados na web.  <p>Esta &eacute; definitivamente a solu&ccedil;&atilde;o mais simples para softwares baseados na web: Apenas crie uma conta no Google Adsense e pronto, voc&ecirc; j&aacute; tem an&uacute;ncios. Mas colocar propaganda no seu produto n&atilde;o quer dizer que voc&ecirc; j&aacute; estar&aacute; faturando. A menos que seu site tenha muitas&nbsp;visitas, o rendimento pode ser muito baixo para se adotar esta estrat&eacute;gia.  <p>Esta op&ccedil;&atilde;o tamb&eacute;m n&atilde;o funciona para sistemas protegidos por senha, o sistema de login no sistema pode barrar o Google. Se voc&ecirc; quiser&nbsp;propaganda em um sistema protegido por senha, voc&ecirc; vai precisar correr atr&aacute;s dos an&uacute;ncios - o que vai consumir muito do seu tempo, e exigir que voc&ecirc; se dedique por tempo integral a isto.  <p><strong>Plano B: </strong>Pessoalmente eu n&atilde;o gosto deste modelo, porque ele joga suas prioridades&nbsp;no lixo&nbsp;- voc&ecirc; se preocupa demais com suas propagandas e deixa de lado o principal no seu neg&oacute;cio: seus clientes. &Eacute; dif&iacute;cil manter suas prioridades com este sistema. Seus anunciantes querem chamar a aten&ccedil;&atilde;o dos seus clientes, mas os clientes querem ser produtivos usando o seu produto. Um esquema ganha-ganha &eacute; dif&iacute;cil neste modelo. Poss&iacute;vel, mas dif&iacute;cil.  <p><strong>Sistema de assinatura (ou pagamento &uacute;nico) </strong><br />Esta op&ccedil;&atilde;o pede que o cliente pague pelo seu servi&ccedil;o. Neste modelo &eacute; como dizer: &#8220;n&oacute;s acreditamos que vale a pena pagar pelo nosso produto, e se voc&ecirc; concordar, n&oacute;s amaremos ter voc&ecirc; como nosso cliente.&#8221; Pode ser uma mensalidade/anuidade ou um valor &uacute;nico, assim como os softwares convencionais. Do ponto de vista do rendimento, o sistema de assinatura funciona.  <p>O problema &eacute; fazer as pessoas pagarem pelo seu produto. Alguns clientes est&atilde;o dispostos a pagar, mas quantos? Ser&aacute; o suficiente para te manter no jogo?  <p><strong>Plano A:</strong> Eu recomendo este modelo. Se voc&ecirc; inicia a constru&ccedil;&atilde;o do produto pensando em construir algo que as pessoas v&atilde;o querer pagar para usar, possivelmente voc&ecirc; vai construir algo bom, que as pessoas v&atilde;o querer pagar para usar. Claro, que mesmo boas id&eacute;ias &agrave;s vezes tamb&eacute;m n&atilde;o d&atilde;o certo. Mas este pensamento vai te colocar no caminho certo.  <p>Quero apenas dizer mais uma coisa sobre isto: Quando as pessoas pagam por seu produto, elas t&ecirc;m interesse em v&ecirc;-lo crescer. Elas querem ver seu investimento valer a pena.&nbsp;Elas passam a acreditar no seu produto, cuidam dele.&nbsp;Isto desperta paix&atilde;o e interesse em torno do que est&atilde;o fazendo e isto &eacute; muito bom.  <p><strong>Suporte</strong><br />Esta &eacute; a estrat&eacute;gia usada pela comunidade&nbsp;do c&oacute;digo aberto (open-source). SugarCRM &eacute; um bom exemplo disto. Seu software &eacute; gr&aacute;tis, mas se voc&ecirc; quiser um suporte para usar o produto, ter&aacute; de pagar por isto.  <p><strong>Plano C:</strong> Olhando por cima, parece uma boa id&eacute;ia. Mas para quem? Se o seu ganha-p&atilde;o&nbsp;depender de ajudar as pessoas, isto induz voc&ecirc; a fazer as coisas da forma mais dif&iacute;cil poss&iacute;vel, ao inv&eacute;s de simplificar para o cliente. Este modelo evita ferramentas intuitivas e f&aacute;ceis de usar. Voc&ecirc; acaba criando um produto complexo que s&oacute; algumas pessoas entendem. Isto &eacute; bom para voc&ecirc;, mas p&eacute;ssimo para seus clientes.  <p><strong>Um meio termo?</strong><br />H&aacute; varias outras maneiras de se ganhar dinheiro com seu software. Voc&ecirc; usar um meio termo entre duas ou mesmo as tr&ecirc;s op&ccedil;&otilde;es acima, ou voc&ecirc; pode vender seu software para outra empresa. Ou algo completamente diferente disto.  <p>Na verdade acreditamos que construir um software de qualidade que as pessoas estar&atilde;o dispostas a pagar &eacute; a melhor op&ccedil;&atilde;o. N&atilde;o ser&aacute; f&aacute;cil, mas se voc&ecirc; conseguir estar&aacute; no caminho de um software de sucesso.  <p>&nbsp;</p> <p>Este post &eacute; um tradu&ccedil;&atilde;o do artigo <a href="http://37signals.com/svn/archives2/3_ways_to_make_money_with_your_software.php">3 ways to make money with your software</a> publicado pelo blog Signal vs. Noise.</p> <p> <hr /> Procurando um emprego novo? Encontre no <a href="http://www.carreirati.com">carreiraTI.com</a></p></p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/05/24/novo-sistema-de-busca-no-carreirati/">Novo sistema de busca no carreiraTI</a></h1>
    
    
      <p class="meta">




<time datetime="2007-05-24 00:00:00 -0300" pubdate  updated >24 de Maio de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p> <center><img height="285" src="http://old.nomedojogo.com/wp-content/uploads/writer/NovosistemadebuscanocarreiraTI_1057A/Untitled13.jpg" width="500"></center> <p></p> <p>&nbsp;</p> <p>O sistema de busca do <a href="http://www.carreirati.com">carreiraTI</a> foi aprimorado, anteriormente n&atilde;o era poss&iacute;vel realizar uma busca por cidade por exemplo. Agora voc&ecirc; pode procurar por palavras chaves mais o nome da cidade onde voc&ecirc; quer trabalhar&nbsp;(<strong>C# S&atilde;o Paulo</strong>, por exemplo).</p> <p></p> <p>O sistema de busca utilizado &eacute; bem simples e baseado no <a href="http://wiki.rubyonrails.org/rails/pages/TextSearch">TextSearch</a>, um padr&atilde;o para busca em <strong>Rails</strong>. Inicialmente tentei utilizar o plugin <a href="http://wiki.rubyonrails.org/rails/pages/Active+Search+Plugin">Active Search</a>, mas seria necess&aacute;rio alterar muita coisa para funcionar do jeito que eu pretendia, al&eacute;m dele apresentar um erro na hora da grava&ccedil;&atilde;o do registro.</p> <p>O <a href="http://www.carreirati.com">carreiraTI</a> est&aacute; indo muito bem obrigado, mas ainda precisa de mais divulga&ccedil;&atilde;o. Nunca pensei como seria dif&iacute;cil esta parte. Criar o software foi f&aacute;cil, divulgar e o tornar conhecido &eacute; o grande problema.</p>

</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/05/22/vagas-recentes-no-carreirati/">Vagas recentes no carreiraTI</a></h1>
    
    
      <p class="meta">




<time datetime="2007-05-22 00:00:00 -0300" pubdate  updated >22 de Maio de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p>A <b>Systemplan Consultoria</b> est&aacute; procurando por um <a href="http://www.carreirati.com/jobs/exibir/219">analista de suporte</a> para trabalhar em hortol&atilde;ndia.</p>


<p> <p>A <b>Taisei Consultoria e Inform&aacute;tica Ltda</b> est&aacute; procurando por um <a href="http://www.carreirati.com/jobs/exibir/234">t&eacute;cnico de suporte</a> com conhecimentos em redes.</p> <p>A <b>Pitang Consultoria e Sistemas S/A</b> est&aacute; procurando por um <a href="http://www.carreirati.com/jobs/exibir/226">desenvolvedor pleno java</a>.</p> <p>A <b>Accenture do Brasil</b> est&aacute; procurando por um <a href="http://www.carreirati.com/jobs/exibir/229">analista SAP</a>.</p> <p>A <b>K2 Consulting</b> est&aacute; procurando por um <a href="http://www.carreirati.com/jobs/exibir/238?page=2">DBA Oracle</a>.</p></p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/05/22/receba-erros-do-seu-software-por-email/">Receba erros do seu software por email</a></h1>
    
    
      <p class="meta">




<time datetime="2007-05-22 00:00:00 -0300" pubdate  updated >22 de Maio de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p><center><img src="http://old.nomedojogo.com/wp-content/uploads/writer/Recebaerrosdoseusoftwareporemail_13317/bruce_on_rails3.jpg" height="304" width="411" /></center>Quando se cria um software como o <a href="http://www.carreirati.com">carreiraTI</a>, &eacute; dif&iacute;cil saber que erros as pessoas podem encontrar durante a navega&ccedil;&atilde;o. &Eacute; necess&aacute;rio ficar sempre analisando os arquivos de log para ver se tudo est&aacute; indo bem.Mas, o <strong>Ruby on Rails</strong> tem um plugin excelente que pode me ajudar nisto. &Eacute; o ExceptionNotification. Basicamente ele me envia um email toda vez que um erro ocorre em meu software.</p>


<p>Para us&aacute;-lo &eacute; muito f&aacute;cil (como diria DHH &eacute; tedioso).</p>


<p>Primeiro instale o plugin:</p>


<pre name="code" class="ruby">ruby script/plugin install exception_notification</pre>


<p>Depois, configure no arquivo environment.rb para onde o Rails deve enviar o email:</p>


<pre name="code" class="ruby">ExceptionNotifier.exception_recipients = %w(<a href="mailto:meuemail@dominio.com">meuemail@dominio.com</a>)</pre>


<p>Agora, basta colocar a seguinte declara&ccedil;&atilde;o nos controller que voc&ecirc; deseja monitorar, ou se forem todos, coloque no ApplicationController.</p>


<pre name="code" class="ruby">
class ApplicationController &lt; ActionController::Base
    include ExceptionNotifiable
end</pre>


<p>Para que o <strong>Rails</strong> possa enviar os emails, &eacute; necess&aacute;rio que isto j&aacute; tenha sido configurado antes, para saber como fazer isto veja o tutorial no <a href="http://wiki.rubyonrails.org/rails/pages/HowToSendEmailsWithActionMailer">site oficial</a>.</p>


<p>Pronto, a partir de agora, todos os erros que sua aplica&ccedil;&atilde;o gerar, voc&ecirc; receber&aacute; por email.</p>

</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/05/22/50-tutoriais-para-design-de-logotipos/">50 tutoriais para design de logotipos</a></h1>
    
    
      <p class="meta">




<time datetime="2007-05-22 00:00:00 -0300" pubdate  updated >22 de Maio de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/05/windowslivewriter50tutoriaisparadesigndelogotipos-7bd3tutorial-2003-04-4881.gif" alt="" width="206" height="210" align="right" /> O site <strong>E Logo Design</strong> montou uma lista com 50 tutoriais ensinando a desenhar logotipos.</p>

<p>Eu particularmente demoro muito tempo bolando os logos dos meus projetos (confesso que minha criatividade neste sentido é muito baixa).</p>

<p>Se você também não é um designer ou precisa de inspiração, aí está um bom link.</p>

<p><a href="http://www.elogodesign.com/logo-design-tutorials/">Clique aqui</a> para ver a lista.</p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/05/22/30-scripts-para-galerias-de-fotos-e-slides/">30 scripts para galerias de fotos e slides</a></h1>
    
    
      <p class="meta">




<time datetime="2007-05-22 00:00:00 -0300" pubdate  updated >22 de Maio de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/05/windowslivewriter30scriptsparagaleriasdefotoseslides-a171jondesignssmoothgallery11.jpg" alt="" width="450" height="347" /></p>

<p>O site Smashing Magazine publicou uma relação com 30 scripts para montar galerias de fotos e slides.</p>

<p>Os scripts usam desde ajax até css puro.</p>

<p>Vale a pena guardar nos favoritos: <a href="http://www.smashingmagazine.com/2007/05/18/30-best-solutions-for-image-galleries-slideshows-lightboxes/">clique aqui</a> para ver.</p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/05/21/categorias-e-rss-feed-no-carreirati/">Categorias e RSS Feed no carreiraTI</a></h1>
    
    
      <p class="meta">




<time datetime="2007-05-21 00:00:00 -0300" pubdate  updated >21 de Maio de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><center><img src="http://old.nomedojogo.com/wp-content/uploads/2007/05/carreirati.jpg" alt="carreirati.jpg" /></center>


<p>O <a href="http://www.carreirati.com">carreiraTI</a> conta agora com categorias de ofertas de emprego e RSS Feeds para visualizar as vagas. Os feeds tamb&eacute;m s&atilde;o categorizados.Para acompanhar o cadastro de vagas, basta clicar sobre o &iacute;cone do RSS. <center><img src="http://old.nomedojogo.com/wp-content/uploads/2007/05/rss.jpg" alt="rss.jpg" /></center>A navega&ccedil;&atilde;o entre as categorias &eacute; feita por meio de abas na parte superior do site. <center><img src="http://old.nomedojogo.com/wp-content/uploads/2007/05/abas.jpg" alt="abas.jpg" /></center> Clique aqui para conhecer o <a href="http://www.carreirati.com">carreiraTI.com</a></p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/05/21/apresentacoes-do-railsconf/">Apresentações do RailsConf</a></h1>
    
    
      <p class="meta">




<time datetime="2007-05-21 00:00:00 -0300" pubdate  updated >21 de Maio de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p><center><img src="http://old.nomedojogo.com/wp-content/uploads/2007/05/505387520_e314a7688a.jpg" title="505387520_e314a7688a.jpg" alt="505387520_e314a7688a.jpg" align="absmiddle" /></center></p>


<p>O RailsConf terminou ontem, e muito provavelmente voc&ecirc; n&atilde;o esteve presente,  n&atilde;o &eacute; mesmo? Pois &eacute;, eu tamb&eacute;m n&atilde;o. Mas se quer matar a curiosidade e saber o  que rolou por l&aacute;, voc&ecirc; pode fazer o download das apresenta&ccedil;&otilde;es no site do evento  (<a href="http://www.web2expo.com/pub/w/51/presentations.html" target="_blank">clique aqui</a>).</p>


<p>Algumas apresenta&ccedil;&otilde;es me chamaram aten&ccedil;&atilde;o, como: <strong><a href="http://www.web2expo.com/cs/rails2007/view/e_sess/11608">Clean  Code</a></strong>, feita por Robert Martin e <strong><a href="http://www.web2expo.com/cs/rails2007/view/e_sess/11652">Building  Community-focused Apps with Rails</a></strong> por Dan Benjamin.</p>

</div>
  
  


  </article>

<nav role="pagination">
  <div>
    
      <a class="prev" href="/page/77/">&larr; Antigos</a>
    
    <a href="/blog/archives">Arquivo</a>
    
    <a class="next" href="/page/75/">Novos &rarr;</a>
    
  </div>
</nav>

<script type="text/javascript">
    var disqus_shortname = 'carlosbrando';
    (function () {
      var s = document.createElement('script'); s.async = true;
      s.type = 'text/javascript';
      s.src = 'http://' + disqus_shortname + '.disqus.com/count.js';
      (document.getElementsByTagName('HEAD')[0] || document.getElementsByTagName('BODY')[0]).appendChild(s);
    }());
</script>

</div>
<aside role=sidebar>
  
    <section>
  <h1>Artigos Recentes</h1>
  <ul id="recent_posts">
    
      <li class="post">
        <a href="/2011/08/25/como-convencer-sua-equipe-a-usar-um-sistema-de-controle-de-vers-o/">Como convencer sua equipe a usar um sistema de controle de versão</a>
      </li>
    
      <li class="post">
        <a href="/2011/08/19/blogando-como-um-hacker/">Blogando como um hacker</a>
      </li>
    
      <li class="post">
        <a href="/2011/06/13/a-regra-direita-esquerda-do-c/">A Regra Direita-Esquerda do C</a>
      </li>
    
      <li class="post">
        <a href="/2011/06/03/colorific/">Colorific</a>
      </li>
    
      <li class="post">
        <a href="/2011/03/29/quem-disse-que-gravar-um-podcast-e-facil/">Quem disse que gravar um podcast é fácil?</a>
      </li>
    
  </ul>
</section>

<section>
  <h1>Últimos Tweets</h1>
  <ul id="tweets">
    <li class="loading">Atualizando&#8230;</li>
  </ul>
  <script type="text/javascript">
    $.domReady(function(){
      getTwitterFeed("carlosbrando", 4, false);
    });
  </script>
  <script src="/javascripts/twitter.js" type="text/javascript"> </script>
  
    <a href="http://twitter.com/carlosbrando" class="twitter-follow-button" data-width="208px" data-show-count="false">Siga @carlosbrando</a>
  
</section>




  
</aside>

    </div>
  </div>
  <footer><p>
  Copyright &copy; 2011 - Carlos Brando -
  <span class="credit">Powered by <a href="http://octopress.org">Octopress</a></span>
</p>

</footer>
</body>
</html>
