
<!DOCTYPE html>
<!--[if IEMobile 7 ]><html class="no-js iem7"><![endif]-->
<!--[if lt IE 9]><html class="no-js lte-ie8"><![endif]-->
<!--[if (gt IE 8)|(gt IEMobile 7)|!(IEMobile)|!(IE)]><!--><html class="no-js" lang="en"><!--<![endif]-->
<head>
  <meta charset="utf-8">
  <title>Nome do Jogo</title>
  <meta name="author" content="Carlos Brando">
  

  <!-- http://t.co/dKP3o1e -->
  <meta name="HandheldFriendly" content="True">
  <meta name="MobileOptimized" content="320">
  <meta name="viewport" content="width=device-width, initial-scale=1">

  

  <link rel="canonical" href="http://carlosbrando.github.com/page/82/index.html"/>
  <link href="/favicon.png" rel="shortcut icon" />
  <link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
  <script src="/javascripts/modernizr-2.0.js"></script>
  <script src="http://s3.amazonaws.com/ender-js/jeesh.min.js"></script>
  <script src="/javascripts/octopress.js" type="text/javascript"></script>
  <link href="http://feeds2.feedburner.com/NomeDoJogo" rel="alternate" title="Nome do Jogo" type="application/atom+xml"/>
  
  <script type="text/javascript">
    var _gaq = _gaq || [];
    _gaq.push(['_setAccount', 'UA-1249636-1']);
    _gaq.push(['_trackPageview']);

    (function() {
      var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
      ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
      var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
    })();
  </script>


  
  <script type="text/javascript">
    (function() {
      var script = document.createElement('script'); script.type = 'text/javascript'; script.async = true;
      script.src = 'https://apis.google.com/js/plusone.js';
      var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(script, s);
    })();
  </script>


  
  <script type="text/javascript">
    (function(){
      var twitterWidgets = document.createElement('script');
      twitterWidgets.type = 'text/javascript';
      twitterWidgets.async = true;
      twitterWidgets.src = 'http://platform.twitter.com/widgets.js';
      document.getElementsByTagName('head')[0].appendChild(twitterWidgets);
    })();
  </script>


  <!--Fonts from Google's Web font directory at http://google.com/webfonts -->
<link href='http://fonts.googleapis.com/css?family=PT+Serif:regular,italic,bold,bolditalic' rel='stylesheet' type='text/css'>
<link href='http://fonts.googleapis.com/css?family=PT+Sans:regular,italic,bold,bolditalic' rel='stylesheet' type='text/css'>

</head>

<body  >
  <header><hgroup>
  <h1><a href="/">Nome do Jogo</a></h1>
  
    <h2>por Carlos Brando</h2>
  
</hgroup>

</header>
  <nav role=navigation><ul role=subscription data-subscription="rss">
  <li><a href="http://feeds2.feedburner.com/NomeDoJogo" rel="subscribe-rss" title="subscribe via RSS">RSS</a></li>
  
</ul>
<form action="http://google.com/search" method="get">
  <fieldset role="site-search">
    <input type="hidden" name="q" value="site:carlosbrando.github.com" />
    <input class="search" type="text" name="q" results="0" placeholder="Search"/>
  </fieldset>
</form>
<ul role=main-navigation>
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Arquivo</a></li>
</ul>

</nav>
  <div id="main">
    <div id="content">
      <div class="blog-index">



  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/07/a-procura-da-felicidade/">A procura da felicidade</a></h1>
    
    
      <p class="meta">




<time datetime="2007-03-07 00:00:00 -0300" pubdate  updated > 7 de Março de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p><a href="http://bp1.blogger.com/_qPFTWwym1uQ/Re7Oz9qShII/AAAAAAAAAS8/_pdPv9dy55w/s1600-h/imagens.jpg" onblur="try {parent.deselectBloggerImageGracefully();} catch(e) {}"><img border="0" src="http://bp1.blogger.com/_qPFTWwym1uQ/Re7Oz9qShII/AAAAAAAAAS8/_pdPv9dy55w/s400/imagens.jpg" style="display: block; margin: 0px auto 10px; cursor: pointer; text-align: center" id="BLOGGER_PHOTO_ID_5039192425194751106" /></a></p>

<p>Assisti ao filme, gostei e me emocionei. Realmente &eacute; uma hist&oacute;ria interessante de supera&ccedil;&atilde;o e for&ccedil;a de vontade.</p>

<p>O filme retrata uma fase da vida de Christopher Paul Gardner (Chris Gardner), um homem que morou na rua e se tornou um milion&aacute;rio da bolsa de valores. Para saber mais sobre sua hist&oacute;ria, assista ao filme, ou leia o livro com o mesmo nome.</p>

<p>Mas o que quero ressaltar, n&atilde;o &eacute; exatamente sobre o filme, mas sim sobre a busca pela felicidade. No filme e na vida, Chris Gardner buscou a &quot;felicidade&quot; na forma de dinheiro. Mas at&eacute; que ponto o dinheiro est&aacute; relacionado com a felicidade?</p>

<p>Concordo que &eacute; muito dif&iacute;cil ser feliz sem um centavo no bolso, ou uma casa para se morar. Mas n&atilde;o posso deixar de me perguntar, por que no momento mais dif&iacute;cil de sua vida, ele n&atilde;o teve um amigo ou familiar com quem contar?</p>

<p>&Eacute; este o ponto que quero frisar, uma pessoa infeliz n&atilde;o &eacute; quem n&atilde;o tem dinheiro, mas sim quem n&atilde;o tem ningu&eacute;m. Mesmo sem dinheiro, muitas fam&iacute;lias t&ecirc;m uma vida simples e feliz. Como conseguem isto? Existe algo chamado auto-sufici&ecirc;ncia.</p>

<p>Auto-sufici&ecirc;ncia, diferente do que muita gente acredita ser, n&atilde;o &eacute; ter dinheiro suficiente para se viver e comprar as coisas que deseja. Auto-sufici&ecirc;ncia &eacute; estar feliz com o que tem.</p>

<p>N&atilde;o importa o quanto voc&ecirc; ganha. O que importa &eacute; estar feliz, junto com as pessoas que ama e se importam com voc&ecirc;. Evolua em sentido profissional, corra atr&aacute;s de conhecimento e supera&ccedil;&atilde;o, melhore seu relacionamento com seus amigos e fam&iacute;lia e seja feliz.</p>

<object height="350" width="425"><param name="movie" value="http://www.youtube.com/v/2tYV9iYr-DM"><param name="wmode" value="transparent"><embed src="http://www.youtube.com/v/2tYV9iYr-DM" type="application/x-shockwave-flash" wmode="transparent" height="350" width="425" /></object>

</div>
  <footer>
    <a rel="full-article" href="/2007/03/07/a-procura-da-felicidade/">Ler mais &rarr;</a>
  </footer>


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/06/uma-verdade-inconveniente/">Uma verdade inconveniente</a></h1>
    
    
      <p class="meta">




<time datetime="2007-03-06 00:00:00 -0300" pubdate  updated > 6 de Março de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p><img border="0" src="http://bp0.blogger.com/_qPFTWwym1uQ/Re1hC9qShGI/AAAAAAAAASs/6KttWrmeNiA/s400/imagens.jpg" style="display: block; margin: 0px auto 10px; text-align: center" id="BLOGGER_PHOTO_ID_5038790261637022818" /></p>

<p>Vice-presidente da Administra&ccedil;&atilde;o Clinton, Albert Arnold Gore Jr (Al Gore) foi o respons&aacute;vel pelo document&aacute;rio &#8220;Uma Verdade Inconveniente&#8221; (An Inconvenient Truth), ganhador do oscar de melhor document&aacute;rio em 2007.</p>

<p>Al Gore &eacute; um ativista ecol&oacute;gico, em fevereiro deste ano, unindo-se com o presidente da empresa Virgin, Richard Branson, lan&ccedil;ou uma competi&ccedil;&atilde;o: <a href="http://www.bbc.co.uk/portuguese/ciencia/story/2007/02/070209_bransonclimafn.shtml">R$ 50 milh&otilde;es para o cientista que apresentar a melhor proposta para limpar o ar do planeta</a>.</p>

<p>Assisti ao document&aacute;rio citado acima, e posso dizer com gosto, agora entendi realmente o que est&aacute; envolvido neste papo todo de aquecimento global.</p>

<p>Al Gore, embora n&atilde;o deixe de aproveitar o document&aacute;rio para dar umas alfinetadas em Bush (para quem perdeu as elei&ccedil;&otilde;es em 2000, em uma contagem pol&ecirc;mica de votos) nos d&aacute; uma explica&ccedil;&atilde;o excelente sobre o que &eacute; aquecimento global, como nos afeta e o que devemos fazer para superar isto (esta parte &eacute; um pouco americanizada demais).</p>

<p>Um excelente document&aacute;rio. Acredito que todos deveriam assistir tamb&eacute;m.
N&atilde;o sei se &eacute; poss&iacute;vel encontr&aacute;-lo em locadoras hoje, mas na internet voc&ecirc; consegue peg&aacute;-lo via torrent ou emule (acho que n&atilde;o preciso ensinar ningu&eacute;m a fazer isto, correto?) e a legenda pode ser pega no <a href="http://www.legendas.tv/">legendas.tv</a>.</p>

<object height="350" width="425"><param name="movie" value="http://www.youtube.com/v/QLW2T3QgJc0"><param name="wmode" value="transparent"><embed src="http://www.youtube.com/v/QLW2T3QgJc0" type="application/x-shockwave-flash" wmode="transparent" height="350" width="425" /></object>

</div>
  <footer>
    <a rel="full-article" href="/2007/03/06/uma-verdade-inconveniente/">Ler mais &rarr;</a>
  </footer>


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/03/05/diamante-de-sangue/">Diamante de Sangue</a></h1>
    
    
      <p class="meta">




<time datetime="2007-03-05 00:00:00 -0300" pubdate  updated > 5 de Março de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p><img border="0" src="http://bp1.blogger.com/_qPFTWwym1uQ/RexfLPgXc1I/AAAAAAAAASU/Qc0xSt0KnNs/s400/02.jpg" style="display: block; margin: 0px auto 10px; cursor: pointer; text-align: center" id="BLOGGER_PHOTO_ID_5038506729866228562" /></p>

<blockquote>Veio do centro da terra.
Uma pedra t&atilde;o rara que os homens fazem qualquer coisa para possu&iacute;-la&#8230;
E todos que a tocam ficam com sangue nas m&atilde;os.</blockquote>


<p>Tendo como pano de fundo o caos e a guerra civil que dominou Serra Leoa na d&eacute;cada de 1990, Diamante de Sangue conta a hist&oacute;ria de Danny Archer (LEOARDO DICAPRIO), um ex-mercen&aacute;rio do Zimb&aacute;bue, e Solomon Vandy (DJIMON HOUNSOU), um pescador da etnia Mende. Ambos s&atilde;o africanos, mas suas hist&oacute;rias e circunst&acirc;ncias de vida s&atilde;o totalmente diferentes at&eacute; que o destino os re&uacute;ne numa busca para recuperar um raro diamante rosa, o tipo de pedra que pode transformar uma vida&#8230; ou acabar com ela.</p>

<p>Solomon, que foi arrancado de sua fam&iacute;lia e for&ccedil;ado a trabalhar nos campos de diamante, encontra a pedra extraordin&aacute;ria e se arrisca a escond&ecirc;-la ciente de que, se for descoberto, ser&aacute; morto imediatamente. Mas ele tamb&eacute;m sabe que o diamante poderia n&atilde;o apenas fornecer os meios para salvar a esposa e as filhas de uma vida de refugiadas, como tamb&eacute;m ajudar a resgatar seu filho, Dia, de um destino muito pior como soldado infantil.</p>

<p>Archer, que vivia da troca de diamantes por armas, fica sabendo da pedra de Solomon enquanto est&aacute; na pris&atilde;o por contrabando. Ele sabe que um diamante como esse s&oacute; se encontra uma vez na vida - e vale o bastante para ser seu bilhete de sa&iacute;da da &Aacute;frica e do ciclo de viol&ecirc;ncia e corrup&ccedil;&atilde;o no qual ele era um jogador dedicado.</p>

<p>Ent&atilde;o surge Maddy Bowen (JENNIFER CONNELLY), uma jornalista americana idealista que est&aacute; em Serra Leoa para desvendar a verdade por tr&aacute;s dos diamantes de sangue, expondo a cumplicidade dos chefes da ind&uacute;stria das pedras, que optaram pelo lucro no lugar dos princ&iacute;pios. Maddy vai atr&aacute;s de Archer como fonte para seu artigo, por&eacute;m logo descobre que &eacute; ele quem precisa muito mais dela.</p>

<p>Com a ajuda de Maddy, Archer e Solomon se embrenham por uma perigosa trilha dentro do territ&oacute;rio rebelde. Archer precisa de Solomon para encontrar e recuperar o valioso diamante rosa, por&eacute;m Solomon anseia por algo muito mais precioso&#8230; Seu filho.</p>

<p>Diamante de Sangue &eacute; um filme de a&ccedil;&atilde;o e por muitas vezes ficamos eclipsados com as cenas r&aacute;pidas que passam diante de nossos olhos.</p>

<p>Embora n&atilde;o seja um emaranhado de conspira&ccedil;&otilde;es e terias pol&iacute;ticas como Siryana e O jardineiro fiel, esse filme tamb&eacute;m levanta quest&otilde;es preocupantes como o contrabando de diamantes em &aacute;reas de conflitos e o pior, o recrutamento de crian&ccedil;as para guerra.</p>

<p>Estima-se que 200.000 no mundo todo participem de conflitos armados.</p>

<p>Leonardo Dicaprio convence, mas quem chama aten&ccedil;&atilde;o mesmo &eacute; Djimon Hounssou.
O filme emociona ao mostrar a luta de um pai para reunir sua fam&iacute;lia e em certos aspectos a carnificina lembra outro filme tamb&eacute;m com a &Aacute;frica como pano de fundo, &quot;Hotel Ruanda&#8221;.</p>
</div>
  <footer>
    <a rel="full-article" href="/2007/03/05/diamante-de-sangue/">Ler mais &rarr;</a>
  </footer>


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/02/28/300/">300</a></h1>
    
    
      <p class="meta">




<time datetime="2007-02-28 00:00:00 -0300" pubdate  updated >28 de Fevereiro de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p><a href="http://bp2.blogger.com/_qPFTWwym1uQ/Reh4ufgXcxI/AAAAAAAAARs/RpzyY-yQ-2o/s1600-h/300esparta_americano.jpg" onblur="try {parent.deselectBloggerImageGracefully();} catch(e) {}"><img border="0" src="http://bp2.blogger.com/_qPFTWwym1uQ/Reh4ufgXcxI/AAAAAAAAARs/RpzyY-yQ-2o/s400/300esparta_americano.jpg" style="display: block; margin: 0px auto 10px; cursor: pointer; text-align: center" id="BLOGGER_PHOTO_ID_5037408923340469010" /></a>Daqui 30 dias veremos um dos mais esperados filmes do ano.
&#8220;300&#8221;</p>

<p>O filme &eacute; baseado na Graphic novel de Frank Miller, que tamb&eacute;m assina Sin City recentemente lan&ccedil;ada no cinema e DVD.
No elenco estar&aacute; o agora internacional Rodrigo Santoro, com destaque interpretando o vil&atilde;o.
O texto &eacute; praticamente fiel aos quadrinhos, apenas acrescentando uma hist&oacute;ria secund&aacute;ria para atrair mais aten&ccedil;&atilde;o ao publico feminino.
<span class="fullpost">
O filme tem tudo para ser um &eacute;pico.
Boa produ&ccedil;&atilde;o, efeitos especiais de tirar o f&ocirc;lego, um roteiro afiado, por&eacute;m &eacute; na hist&oacute;ria real do mito que est&aacute; o grande atrativo de &#8220;300&#8221;.</span><span class="fullpost">Embora o roteiro de Miller nos quadrinhos n&atilde;o seja uma r&eacute;plica exata da hist&oacute;ria, a ess&ecirc;ncia esta ali.
Estamos no ver&atilde;o de 480 a.C. no desfiladeiro das Term&oacute;pilas nas Gr&eacute;cia central.
No per&iacute;odo da II guerra M&eacute;dica, (n&atilde;o, n&atilde;o foi uma batalha travada por m&eacute;dicos com bisturis&#8230;), ou seja, a segunda investida dos Persas para dominar a Gr&eacute;cia.
Os Persas eram a na&ccedil;&atilde;o a ser temida.
Haviam derrotado a poderosa Babil&ocirc;nia e agora seu imp&eacute;rio se expandia pelo mundo.
Finalmente o Ocidente se encontrava com o Oriente.
Muitos anos antes uma batalha com essa j&aacute; havia sido travada, entre os Aqueus e os Troianos, mas agora essa era uma guerra de propor&ccedil;&otilde;es muito maiores.
Se os Persas conseguissem invadir a Gr&eacute;cia talvez todo mundo ocidental como conhecemos n&atilde;o houvesse existido.</p>

<p>A H&eacute;lade (dividida em v&aacute;rias pequenas cidades-Estado independentes, separadas entre si por particularismos geogr&aacute;ficos e culturais) finalmente resolve se unir para deter o avan&ccedil;o do Rei-de-Reis, titulo dado a Xerxes.</p>

<p>31cidades-estados apoiaram a liga e elegeram com l&iacute;der Le&ocirc;nidas I de Esparta, a mais bem preparada militarmente.
O contingente atingiu em torno de 7.000 homens.
O inimigo era enormemente superior.
Her&oacute;doto, historiador grego que viveu num per&iacute;odo aproximado ao embate diz que eram pelo menos 4 milh&otilde;es de Persas.
Hoje se sabe que esse numero era exagerado e que os Persas n&atilde;o devem ter passado de 250.000, mas ainda assim era uma propor&ccedil;&atilde;o de 35 soldados persas para 1 grego.
Os gregos sabiam que n&atilde;o podiam vencer, mas o objetivo era atrasar ao m&aacute;ximo os avan&ccedil;os Persas.
A estrat&eacute;gia foi bem definida. Em vez de enfrentar os Persas num campo aberto, onde seriam evidentemente massacrados, eles levaram a batalha para o desfiladeiro das Term&oacute;pilas, onde o curto espa&ccedil;o n&atilde;o ajudaria movimenta&ccedil;&atilde;o do enorme ex&eacute;rcito inimigo.</p>

<p>Xerxes com certeza n&atilde;o esperava tanta resist&ecirc;ncia de t&atilde;o poucos homens.
No entanto os gregos n&atilde;o poderiam resistir mais e o pior aconteceu, uma trai&ccedil;&atilde;o.
Elfiates filho de Euridemo de M&aacute;lis entregou ao rei Xerxes um caminho alternativo para atacar os gregos pelas costas, em troca de futuro prestigio.
Sem alternativas eles ent&atilde;o retornaram para avisar as outras cidades e para proteger seus estados, com exce&ccedil;&atilde;o de Le&ocirc;nidas e seus 300 corajosos homens que decidiram retardar ao m&aacute;ximo o avan&ccedil;o hostil, para que seus companheiros pudessem se preparar.
Hoje os historiadores dizem que pelo menos mais mil soldados permaneceram ali.</p>

<p>Por sete dias eles conseguiram combater os Persas e derrubando 30.000 homens do exercito invasor.
Por&eacute;m Xerxes convocou seus 10.000 imortais, a tropa de elite dos persas e massacrou os homens de Le&ocirc;nidas.
Xerxes ainda procurou o corpo de Le&ocirc;nidas para ver quem causara tantos danos ao seu ex&eacute;rcito, mas n&atilde;o o encontrou.</p>

<p>Quem venceu a batalha?
Aparentemente os Persas que derrotaram a for&ccedil;a de conten&ccedil;&atilde;o dos gregos.
No entanto os Gregos conseguiram o que queriam e por isso se sa&iacute;ram tamb&eacute;m vitoriosos.
O atraso no avan&ccedil;o Persa foi determinante para que os gregos se organizassem e estivessem preparados.
Os Persas nunca conseguiram subjugar os gregos ap&oacute;s essa batalha e 150 anos depois um jovem general Maced&ocirc;nio viria a impor uma humilhante derrota aos persas e dominar o mundo, mas isso &eacute; conversa para outra hist&oacute;ria e outro filme.</p>

<p></span></p>
</div>
  <footer>
    <a rel="full-article" href="/2007/02/28/300/">Ler mais &rarr;</a>
  </footer>


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/02/27/o-caderno-de-noah/">O caderno de Noah</a></h1>
    
    
      <p class="meta">




<time datetime="2007-02-27 00:00:00 -0300" pubdate  updated >27 de Fevereiro de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p><img border="0" src="http://bp2.blogger.com/_qPFTWwym1uQ/ReRlO6gNJLI/AAAAAAAAAPA/e4q9DCP0rKg/s200/untitled.bmp" style="float: left; margin: 0pt 10px 10px 0pt; cursor: pointer" id="BLOGGER_PHOTO_ID_5036261590203966642" />O quanto duas pessoas podem se amar?
Noah e Allie se conheceram ainda adolescentes e se apaixonaram.
O mundo pareceu conspirar contra eles.
A condi&ccedil;&atilde;o social os separava.
Noah podia ser um bom homem, mas n&atilde;o era bom para Allie.</p>

<p>Veio a guerra e Noah tentou de todos os modos esquec&ecirc;-la.
De maneira desesperada e inconsciente ele gastou todas as suas for&ccedil;as em realizar um desejo de Allie.
<span class="fullpost">
Ela esta noiva, quando &eacute; surpreendida com uma bela lembran&ccedil;a do passado.
Como seguir adiante se n&atilde;o h&aacute; mais caminhos para voltar?</span><span class="fullpost">Uma grande hist&oacute;ria de amor, com um final comovente.</p>

<p>Um senhor conta esta hist&oacute;ria dia ap&oacute;s dia para uma senhora idosa doente num asilo.
Todos os dias ele apanha um caderno e inicia a hist&oacute;ria de Noah e Allie.
Um amor que o tempo n&atilde;o conseguiu abrandar.</p>

<p>&#8220;O Nome do Jogo&#8221; recomenda.</p>

<p>O caderno de Noah
Editora: Objetiva.
Ano: 1997
N&uacute;mero de p&aacute;ginas: 172</p>

<p></span></p>
</div>
  <footer>
    <a rel="full-article" href="/2007/02/27/o-caderno-de-noah/">Ler mais &rarr;</a>
  </footer>


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/02/26/antes-do-por-do-sol/">Antes do pôr do sol</a></h1>
    
    
      <p class="meta">




<time datetime="2007-02-26 00:00:00 -0300" pubdate  updated >26 de Fevereiro de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p><img style="margin: 0pt 10px 10px 0pt; float: left; cursor: pointer;" src="http://bp0.blogger.com/_qPFTWwym1uQ/Rd8bkPGDj9I/AAAAAAAAANY/WdZ0lEdCFXk/s200/antes-do-por-do-sol08t.jpg" alt="" id="BLOGGER_PHOTO_ID_5034773217764675538" border="0" />J&aacute; teve a sensa&ccedil;&atilde;o de que o grande amor da sua vida veio e passou e que voc&ecirc; n&atilde;o o agarrou com todas as for&ccedil;as?
Ser&aacute; que podemos amar verdadeiramente apenas uma vez na vida?
Se assim for, n&atilde;o parece cruel o que a vida faz ou que deixamos que  aconte&ccedil;a?
Ser&aacute; que estamos realmente fadados a conviver com a amargura depois de ter deixado passar o amor?
<span class="fullpost">
Este filme n&atilde;o responde a  essas perguntas.
Longe disso ele levanta mais pondera&ccedil;&otilde;es.
Talvez eu n&atilde;o encontre essas respostas e talvez quem passe por isso nem saiba o que dizer.
No entanto a beleza desse filme est&aacute; no que n&atilde;o aconteceu&#8230;</p>

<p>Antes do p&ocirc;r do sol, filmado em 2004 &eacute; a continua&ccedil;&atilde;o do excelente antes do amanhecer de 1995.
Num breve vislumbre do primeiro filme conhecemos Jesse e Celine.
Um encontro improv&aacute;vel em Viena os une.
Eles passam 14 horas juntos num dia que jamais esquecer&atilde;o.
A descoberta de um grande amor incendeia aquela breve tarde e o anoitecer dos dois.
Por&eacute;m antes do amanhecer eles precisam se despedir&#8230;
Ela vai para os Estados Unidos e ela para Fran&ccedil;a.</p>

<p>Inesperadamente eles decidem n&atilde;o trocarem telefones, aproveitando aquele momento talvez &uacute;nico de suas vidas e marcam o reencontro seis meses depois, ali mesmo naquela esta&ccedil;&atilde;o.</p>

<p>Bom, um sil&ecirc;ncio de dez anos se passaram sem termos a resposta.
Eles se encontraram?
At&eacute; ent&atilde;o a resposta era de cada um de n&oacute;s.
Se voc&ecirc; for uma pessoa rom&acirc;ntica vai imaginar que sim e que foram felizes para sempre.
Se voc&ecirc; for uma pessoa c&eacute;ptica vai dizer que n&atilde;o e que se esqueceram.</p>

<p>A surpreendente resposta &eacute; que eles n&atilde;o se encontraram, mas que tamb&eacute;m n&atilde;o se esqueceram&#8230;
N&atilde;o se preocupe isso n&atilde;o &eacute;  uma revela&ccedil;&atilde;o, isso &eacute; descoberto no primeiro minuto do filme.</p>

<p>O que dizer dez anos depois?
Por que n&atilde;o se encontraram? O que fazem da vida? O que se tornaram?
As respostas s&atilde;o recebidas de uma maneira &uacute;nica.
O filme se passa em tempo real.
&Eacute; uma conversa de aproximadamente uma hora e meia entre os dois.
Como em todas as conversas mais importantes, todas as banalidades s&atilde;o mencionadas para que nos &uacute;ltimos cinco minutos tudo que faltou dizer surja de forma desordenada e desesperada.</p>

<p>O que foi aquela noite em Viena?
Apenas uma noite ou o momento em que o grande amor de suas vidas passou e eles deixaram ir?</p>

<p>Pode ser que voc&ecirc; n&atilde;o goste do filme.
Ele n&atilde;o &eacute; convencional.
Por&eacute;m se voc&ecirc; &eacute; uma pessoa que acredita em um grande amor se comover&aacute; com os di&aacute;logos e com as bel&iacute;ssimas atua&ccedil;&otilde;es dos atores em &#8220;Antes do p&ocirc;r do Sol&#8221;.</p>
</div>
  <footer>
    <a rel="full-article" href="/2007/02/26/antes-do-por-do-sol/">Ler mais &rarr;</a>
  </footer>


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/02/08/recupere-seus-cds-arranhados-com-pasta-de-dentes/">Recupere seus CDs arranhados com pasta de dentes</a></h1>
    
    
      <p class="meta">




<time datetime="2007-02-08 00:00:00 -0200" pubdate  updated > 8 de Fevereiro de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p><img border="0" src="http://bp2.blogger.com/_qPFTWwym1uQ/Rd7Fr_GDj8I/AAAAAAAAANM/P-lFmkmmD_M/s200/images.jpg" style="float: right; margin: 0pt 0pt 10px 10px; cursor: pointer; border: 0px" id="BLOGGER_PHOTO_ID_5034678792908672962" />Pode parecer esquisito, mas uma das maneiras de se salvar um CD riscado &eacute; passando pasta de dentes na sua superf&iacute;cie.
<span class="fullpost">
Gabriel Torres do site <a href="http://www.clubedohardware.com.br/">clube do hardware</a> ensina como fazer. Ele explica que em um CD os dados est&atilde;o gravados numa camada met&aacute;lica dentro dele, e esta camada &eacute; revestida por uma camada pl&aacute;stica transparente que serve para proteg&ecirc;-la.</span><span class="fullpost">Quando esta camada pl&aacute;stica risca, o leitor n&atilde;o consegue ultrapass&aacute;-la para ler os dados gravados dentro do CD. Por isto a sugest&atilde;o &eacute; polir a camada pl&aacute;stica usando pasta de dentes.</p>

<p>Usando um chuma&ccedil;o de algod&atilde;o, esfregue suavemente a pasta de dente sobre os ricos at&eacute; remov&ecirc;-los. Depois lave com &aacute;gua e pronto!</p>

<p>Se tiver sucesso, recomendamos fazer uma c&oacute;pia do CD para evitar problemas no futuro.</p>

<p>E ent&atilde;o, fez o teste? Deixe um coment&aacute;rio para sabermos se deu certo.</p>

<p>via <a href="http://www.clubedohardware.com.br/artigos/668">Clube do Hardware</a></p>

<p></span></p>
</div>
  <footer>
    <a rel="full-article" href="/2007/02/08/recupere-seus-cds-arranhados-com-pasta-de-dentes/">Ler mais &rarr;</a>
  </footer>


  </article>

<nav role="pagination">
  <div>
    
    <a href="/blog/archives">Arquivo</a>
    
    <a class="next" href="/page/81/">Novos &rarr;</a>
    
  </div>
</nav>

<script type="text/javascript">
    var disqus_shortname = 'carlosbrando';
    (function () {
      var s = document.createElement('script'); s.async = true;
      s.type = 'text/javascript';
      s.src = 'http://' + disqus_shortname + '.disqus.com/count.js';
      (document.getElementsByTagName('HEAD')[0] || document.getElementsByTagName('BODY')[0]).appendChild(s);
    }());
</script>

</div>
<aside role=sidebar>
  
    <section>
  <h1>Recent Posts</h1>
  <ul id="recent_posts">
    
      <li class="post">
        <a href="/2011/06/13/a-regra-direita-esquerda-do-c/">A Regra Direita-Esquerda do C</a>
      </li>
    
      <li class="post">
        <a href="/2011/06/03/colorific/">Colorific</a>
      </li>
    
      <li class="post">
        <a href="/2011/03/29/quem-disse-que-gravar-um-podcast-e-facil/">Quem disse que gravar um podcast é fácil?</a>
      </li>
    
      <li class="post">
        <a href="/2011/03/24/convite-para-o-grok-podcast/">Convite para o Grok Podcast!</a>
      </li>
    
      <li class="post">
        <a href="/2011/02/08/quatro-anos-de-nome-do-jogo/">Quatro anos de Nome do Jogo</a>
      </li>
    
  </ul>
</section>

<section>
  <h1>Latest Tweets</h1>
  <ul id="tweets">
    <li class="loading">Status updating&#8230;</li>
  </ul>
  <script type="text/javascript">
    $.domReady(function(){
      getTwitterFeed("carlosbrando", 4, false);
    });
  </script>
  <script src="/javascripts/twitter.js" type="text/javascript"> </script>
  
    <a href="http://twitter.com/carlosbrando" class="twitter-follow-button" data-width="208px" data-show-count="false">Follow @carlosbrando</a>
  
</section>




  
</aside>

    </div>
  </div>
  <footer><p>
  Copyright &copy; 2011 - Carlos Brando -
  <span class="credit">Powered by <a href="http://octopress.org">Octopress</a></span>
</p>

</footer>
</body>
</html>
