
<!DOCTYPE html>
<!--[if IEMobile 7 ]><html class="no-js iem7"><![endif]-->
<!--[if lt IE 9]><html class="no-js lte-ie8"><![endif]-->
<!--[if (gt IE 8)|(gt IEMobile 7)|!(IEMobile)|!(IE)]><!--><html class="no-js" lang="en"><!--<![endif]-->
<head>
  <meta charset="utf-8">
  <title>Nome do Jogo: Personalizar ou não personalizar?</title>
  <meta name="author" content="Carlos Brando">
  

  <!-- http://t.co/dKP3o1e -->
  <meta name="HandheldFriendly" content="True">
  <meta name="MobileOptimized" content="320">
  <meta name="viewport" content="width=device-width, initial-scale=1">

  

  <link rel="canonical" href="http://nomedojogo.com/2007/11/29/personalizar-ou-nao-personalizar/"/>
  <link href="/favicon.png" rel="shortcut icon" />
  <link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
  <script src="/javascripts/modernizr-2.0.js"></script>
  <script src="http://s3.amazonaws.com/ender-js/jeesh.min.js"></script>
  <script src="/javascripts/octopress.js" type="text/javascript"></script>
  <link href="http://feeds2.feedburner.com/NomeDoJogo" rel="alternate" title="Nome do Jogo" type="application/atom+xml"/>
  
  <script type="text/javascript">
    var _gaq = _gaq || [];
    _gaq.push(['_setAccount', 'UA-1249636-1']);
    _gaq.push(['_trackPageview']);

    (function() {
      var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
      ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
      var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
    })();
  </script>


  
  <script type="text/javascript">
    (function() {
      var script = document.createElement('script'); script.type = 'text/javascript'; script.async = true;
      script.src = 'https://apis.google.com/js/plusone.js';
      var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(script, s);
    })();
  </script>


  
  <script type="text/javascript">
    (function(){
      var twitterWidgets = document.createElement('script');
      twitterWidgets.type = 'text/javascript';
      twitterWidgets.async = true;
      twitterWidgets.src = 'http://platform.twitter.com/widgets.js';
      document.getElementsByTagName('head')[0].appendChild(twitterWidgets);
    })();
  </script>


  <!--Fonts from Google's Web font directory at http://google.com/webfonts -->
<link href='http://fonts.googleapis.com/css?family=PT+Serif:regular,italic,bold,bolditalic' rel='stylesheet' type='text/css'>
<link href='http://fonts.googleapis.com/css?family=PT+Sans:regular,italic,bold,bolditalic' rel='stylesheet' type='text/css'>

</head>

<body  >
  <header><hgroup>
  <h1><a href="/">Nome do Jogo</a></h1>
  
    <h2>por Carlos Brando</h2>
  
</hgroup>

</header>
  <nav role=navigation><ul role=subscription data-subscription="rss">
  <li><a href="http://feeds2.feedburner.com/NomeDoJogo" rel="subscribe-rss" title="subscribe via RSS">RSS</a></li>
  
</ul>
<form action="http://google.com/search" method="get">
  <fieldset role="site-search">
    <input type="hidden" name="q" value="site:nomedojogo.com" />
    <input class="search" type="text" name="q" results="0" placeholder="Search"/>
  </fieldset>
</form>
<ul role=main-navigation>
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Arquivo</a></li>
</ul>

</nav>
  <div id="main">
    <div id="content">
      <div>
<article class="hentry">
  
  <header>
    
      <h1 class="entry-title">Personalizar ou não personalizar?</h1>
    
    
      <p class="meta">




<time datetime="2007-11-29 00:00:00 -0200" pubdate  updated >29 de Novembro de 2007</time>


</p>
    
  </header>


<div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/11/1219450501_628b20dc79.jpg" alt="1219450501_628b20dc79.jpg" /></p>

<p>Hoje em dia tem muita gente usando a palavra customizar, mas eu n&atilde;o gosto muito deste neologismo em especial, ent&atilde;o vou usar personalizar mesmo.</p>

<p>Durante muito tempo me ensinaram que um software realmente poderoso deve ser totalmente personaliz&aacute;vel. Pois assim, caso o cliente desejasse ajustar alguma coisa ele simplesmente deveria ir at&eacute; a tela de configura&ccedil;&otilde;es e mudar alguns par&acirc;metros. Isto era ainda mais importante caso o software fosse vendido para mais de um cliente, porque cada um poderia deixar o software do seu jeito. Ao gosto do cliente.</p>

<p>O engra&ccedil;ado &eacute; que <strong>isto nunca funcionava</strong>, voc&ecirc; tinha um trabalh&atilde;o para criar uma tela de configura&ccedil;&otilde;es que o cliente acabava usando apenas uma vez, isto quando usava. E na maioria dos casos, quando o cliente resolvia mudar alguma coisa, era justamente aquela op&ccedil;&atilde;o que voc&ecirc; n&atilde;o deixou personaliz&aacute;vel.</p>

<p>Mais de uma vez vi colegas criando solu&ccedil;&otilde;es mirabolantes para deixar o software mais flex&iacute;vel. Tabelas de dom&iacute;nio, configura&ccedil;&atilde;o <strong>ninjas</strong> em arquivos XML e mais um monte de solu&ccedil;&otilde;es fant&aacute;sticas que ningu&eacute;m usava.</p>

<p>Mas veja o que o <a href="http://gettingreal.37signals.com/ch06_Avoid_Preferences.php">Getting Real</a> fala sobre isto:</p>

<blockquote>
<h3>Evite Prefer&ecirc;ncias</h3>
<h4>Decida sobre os pequenos detalhes para que seus clientes n&atilde;o precisem</h4>
Nos deparamos com uma decis&atilde;o dif&iacute;cil: quantas mensagens inclu&iacute;mos em cada p&aacute;gina? A primeira inclina&ccedil;&atilde;o pode ser em dizer, &quot;Vamos apenas tornar isso uma prefer&ecirc;ncia onde as pessoas possam escolher 25, 50 ou 100&quot;. Entretanto, essa &eacute; a forma mais simples. Apenas tome a decis&atilde;o.
<h4>Prefer&ecirc;ncias s&atilde;o uma maneira de evitar tomar decis&otilde;es dif&iacute;ceis</h4>
Em vez de usar nossa experi&ecirc;ncia para escolher o melhor caminho, deixamos nas m&atilde;os dos clientes. Pode parecer que estamos fazendo um favor a eles mas apenas estamos lhes dando mais trabalho (e provavelmente eles j&aacute; s&atilde;o ocupados o suficiente). Para os clientes, telas de prefer&ecirc;ncia com uma quantidade infinita de op&ccedil;&otilde;es s&atilde;o uma dor de cabe&ccedil;a, n&atilde;o uma b&ecirc;n&ccedil;&atilde;o. Clientes n&atilde;o deveriam ter que pensar sobre cada &iacute;nfimo detalhezinho - n&atilde;o coloque esse peso sobre eles quando deveria ser sua responsabilidade.

Prefer&ecirc;ncias tamb&eacute;m s&atilde;o m&aacute;s porque criam mais software. Mais op&ccedil;&otilde;es requerem mais c&oacute;digo. E tamb&eacute;m ainda tem todo o teste extra e design que precisamos fazer. E ainda vamos acabar com permuta&ccedil;&otilde;es de prefer&ecirc;ncias e telas que nunca usaremos. Isso significa bugs que n&atilde;o sabemos a respeito: layouts quebrados, tabelas explodindo, problemas estranhos de pagina&ccedil;&atilde;o, etc.
<h4>Tome a decis&atilde;o</h4>
Tome as decis&otilde;es simples no lugar dos clientes. &Eacute; o que fizemos no Basecamp. O n&uacute;mero de mensagens por p&aacute;gina &eacute; 25. Na p&aacute;gina de resumo, as &uacute;ltimas 25 s&atilde;o mostradas. Mensagens s&atilde;o ordenadas em ordem cronol&oacute;gica reversa. Os cinco projetos mais recentes s&atilde;o mostrados no painel. N&atilde;o existem op&ccedil;&otilde;es. &Eacute; o jeito que tem que ser.

Sim, podemos tomar uma decis&atilde;o ruim. Mas e da&iacute;? Se fizermos isso, as pessoas v&atilde;o reclamar e nos dizer sobre isso. Como sempre, podemos ajustar. Cair na Real &eacute; justamente sobre ser capaz de mudar em tempo real.</blockquote>


<p>Ao contr&aacute;rio do que se pensa, esta abordagem n&atilde;o est&aacute; tirando a flexibilidade de seus clientes, mas ao inv&eacute;s disto voc&ecirc; est&aacute; tomando decis&otilde;es para que eles n&atilde;o precisem se preocupar em configurar ou ajustar algo para usar o seu software. Eles podem usar o seu produto tranq&uuml;ilamente sabendo que voc&ecirc; j&aacute; se preocupou com a melhor forma de usar, ver ou fazer as coisas.</p>

<p>&Eacute; claro que n&atilde;o somos fan&aacute;ticos religiosos e sabemos que nem sempre poderemos criar um produto totalmente livre de parametriza&ccedil;&atilde;o, mas devemos tentar evit&aacute;-las ao m&aacute;ximo. Muitas das vezes acabamos criando telas de configura&ccedil;&atilde;o por pura pregui&ccedil;a de pensar em qual seria a melhor op&ccedil;&atilde;o para o cliente.</p>

<p>&Eacute; claro que adotar esta postura pode deixar um ou outro descontente, mas este &eacute; um pre&ccedil;o muito baixo a se pagar, pois voc&ecirc; sabe que a maioria das pessoas poder&atilde;o <strong>fazer o que realmente interessa</strong> sem se preocuparem com parametriza&ccedil;&otilde;es e configura&ccedil;&otilde;es.</p>

<p>Outro ponto citado no Getting Real que me chama &agrave; aten&ccedil;&atilde;o &eacute; o fato de que criar telas de configura&ccedil;&atilde;o e personaliza&ccedil;&atilde;o tamb&eacute;m significa criar mais software, e n&oacute;s queremos &#8221;<strong>menos software</strong>&#8221;. E n&atilde;o se engane achando que &eacute; apenas mais uma telinha boboca, porque para cada tela nova de parametriza&ccedil;&atilde;o que voc&ecirc; cria voc&ecirc; leva de brinde todo o c&oacute;digo de teste e design da p&aacute;gina.</p>

<p>E ainda existe um ponto de risco nas parametriza&ccedil;&otilde;es. Dependendo do tipo, elas tornam algumas funcionalidades do seu sistema complexas demais, o que vai dificultar os seus testes. Ser&aacute; que voc&ecirc; se lembrou de testar aquela funcionalidade com as op&ccedil;&otilde;es 1 e 2 habilitadas e com a op&ccedil;&atilde;o 3 desligada?</p>

<p>Toda a parametriza&ccedil;&atilde;o que voc&ecirc; cria <strong>tem um custo</strong>. &Eacute; claro que algumas s&atilde;o cruciais para o sucesso do projeto, mas algumas pessoas n&atilde;o entendem isso e acham que quanto mais op&ccedil;&otilde;es forem dadas ao cliente, mais satisfeito ele ficar&aacute;. Nosso foco deve ser <strong>criar software que funciona</strong> e n&atilde;o adicionar funcionalidades que apenas engordam nosso produto e o submetem a mais falhas.</p>

<p><a href="http://gettingreal.37signals.com/GR_por.php">Clique aqui</a> para conhecer o Getting Real (em portugu&ecirc;s).</p>
</div>


  <footer>
    <p class="meta">
      
  

<span class="byline author vcard">Publicado por <span class="fn">Carlos Brando</span></span>

      




<time datetime="2007-11-29 00:00:00 -0200" pubdate  updated >29 de Novembro de 2007</time>



      


    </p>
    
      <div class="sharing">
  
  <a href="http://twitter.com/share" class="twitter-share-button" data-url="http://nomedojogo.com/2007/11/29/personalizar-ou-nao-personalizar/" data-via="carlosbrando" data-counturl="http://nomedojogo.com/2007/11/29/personalizar-ou-nao-personalizar/" >Tweet</a>
  
  
  <g:plusone size="medium"></g:plusone>
  
</div>

    
  </footer>
</article>

  <section>
    <h1>Comments</h1>
    <div id="disqus_thread"><div id="disqus_thread"></div>
<script type="text/javascript">
  var disqus_shortname = 'carlosbrando';
  var disqus_identifier = 'http://nomedojogo.com/2007/11/29/personalizar-ou-nao-personalizar/';
  var disqus_url = 'http://nomedojogo.com/2007/11/29/personalizar-ou-nao-personalizar/';
  //var disqus_developer = 1;
  (function() {
    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
    dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
  })();
</script>
<noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
</div>
  </section>

</div>

<aside role=sidebar>
  
    <section>
  <h1>Recent Posts</h1>
  <ul id="recent_posts">
    
      <li class="post">
        <a href="/2011/06/13/a-regra-direita-esquerda-do-c/">A Regra Direita-Esquerda do C</a>
      </li>
    
      <li class="post">
        <a href="/2011/06/03/colorific/">Colorific</a>
      </li>
    
      <li class="post">
        <a href="/2011/03/29/quem-disse-que-gravar-um-podcast-e-facil/">Quem disse que gravar um podcast é fácil?</a>
      </li>
    
      <li class="post">
        <a href="/2011/03/24/convite-para-o-grok-podcast/">Convite para o Grok Podcast!</a>
      </li>
    
      <li class="post">
        <a href="/2011/02/08/quatro-anos-de-nome-do-jogo/">Quatro anos de Nome do Jogo</a>
      </li>
    
  </ul>
</section>

<section>
  <h1>Latest Tweets</h1>
  <ul id="tweets">
    <li class="loading">Status updating&#8230;</li>
  </ul>
  <script type="text/javascript">
    $.domReady(function(){
      getTwitterFeed("carlosbrando", 4, false);
    });
  </script>
  <script src="/javascripts/twitter.js" type="text/javascript"> </script>
  
    <a href="http://twitter.com/carlosbrando" class="twitter-follow-button" data-width="208px" data-show-count="false">Follow @carlosbrando</a>
  
</section>




  
</aside>


    </div>
  </div>
  <footer><p>
  Copyright &copy; 2011 - Carlos Brando -
  <span class="credit">Powered by <a href="http://octopress.org">Octopress</a></span>
</p>

</footer>
</body>
</html>
