
<!DOCTYPE html>
<!--[if IEMobile 7 ]><html class="no-js iem7"><![endif]-->
<!--[if lt IE 9]><html class="no-js lte-ie8"><![endif]-->
<!--[if (gt IE 8)|(gt IEMobile 7)|!(IEMobile)|!(IE)]><!--><html class="no-js" lang="en"><!--<![endif]-->
<head>
  <meta charset="utf-8">
  <title>Nome do Jogo</title>
  <meta name="author" content="Carlos Brando">
  

  <!-- http://t.co/dKP3o1e -->
  <meta name="HandheldFriendly" content="True">
  <meta name="MobileOptimized" content="320">
  <meta name="viewport" content="width=device-width, initial-scale=1">

  

  <link rel="canonical" href="http://nomedojogo.com/page/60/index.html"/>
  <link href="/favicon.png" rel="shortcut icon" />
  <link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
  <script src="/javascripts/modernizr-2.0.js"></script>
  <script src="http://s3.amazonaws.com/ender-js/jeesh.min.js"></script>
  <script src="/javascripts/octopress.js" type="text/javascript"></script>
  <link href="http://feeds2.feedburner.com/NomeDoJogo" rel="alternate" title="Nome do Jogo" type="application/atom+xml"/>
  
  <script type="text/javascript">
    var _gaq = _gaq || [];
    _gaq.push(['_setAccount', 'UA-1249636-1']);
    _gaq.push(['_trackPageview']);

    (function() {
      var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
      ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
      var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
    })();
  </script>


  
  <script type="text/javascript">
    (function() {
      var script = document.createElement('script'); script.type = 'text/javascript'; script.async = true;
      script.src = 'https://apis.google.com/js/plusone.js';
      var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(script, s);
    })();
  </script>


  
  <script type="text/javascript">
    (function(){
      var twitterWidgets = document.createElement('script');
      twitterWidgets.type = 'text/javascript';
      twitterWidgets.async = true;
      twitterWidgets.src = 'http://platform.twitter.com/widgets.js';
      document.getElementsByTagName('head')[0].appendChild(twitterWidgets);
    })();
  </script>


  <!--Fonts from Google's Web font directory at http://google.com/webfonts -->
<link href='http://fonts.googleapis.com/css?family=PT+Serif:regular,italic,bold,bolditalic' rel='stylesheet' type='text/css'>
<link href='http://fonts.googleapis.com/css?family=PT+Sans:regular,italic,bold,bolditalic' rel='stylesheet' type='text/css'>

</head>

<body  >
  <header><hgroup>
  <h1><a href="/">Nome do Jogo</a></h1>
  
    <h2>por Carlos Brando</h2>
  
</hgroup>

</header>
  <nav role=navigation><ul role=subscription data-subscription="rss">
  <li><a href="http://feeds2.feedburner.com/NomeDoJogo" rel="subscribe-rss" title="assine via RSS">RSS</a></li>
  
</ul>
<form action="http://google.com/search" method="get">
  <fieldset role="site-search">
    <input type="hidden" name="q" value="site:nomedojogo.com" />
    <input class="search" type="text" name="q" results="0" placeholder="Pesquisar"/>
  </fieldset>
</form>
<ul role=main-navigation>
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Arquivo</a></li>
</ul>

</nav>
  <div id="main">
    <div id="content">
      <div class="blog-index">



  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/12/14/pressao-para-crescer/">Pressão para crescer?</a></h1>
    
    
      <p class="meta">




<time datetime="2007-12-14 00:00:00 -0200" pubdate  updated >14 de Dezembro de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/12/18539901_b81d9c7096.jpg" alt="18539901_b81d9c7096.jpg" /></p>

<p>Mais um da s&eacute;rie de tradu&ccedil;&otilde;es dos artigos &#8221;<strong>Ask 37signals</strong>&#8221;. Antes de come&ccedil;ar deixe-me explicar algo, a 37signals &eacute; uma pequena equipe que cria software simples e focado. Quando eu digo pequena &eacute; porque embora eles tenham alguns produtos de grande sucesso, a empresa conta apenas com oito funcion&aacute;rios.</p>

<p>Bom, vamos a <a href="http://www.37signals.com/svn/posts/625-ask-37signals-pressure-to-grow">pergunta</a>:</p>

<blockquote>Como voc&ecirc;s lidam com a press&atilde;o para crescer?
Voc&ecirc;s simplesmente dizem &quot;N&atilde;o!&quot;?</blockquote>


<p>Quem respondeu foi Jason Fried:</p>

<p>As pessoas est&atilde;o sempre nos perguntando isso, por isto eu adoro esta pergunta. Alem disso, acho que ela vai na raiz do que significa crescimento e como ele &eacute; percebido.</p>

<p>Mas deixe-me dizer algo antes que interpretem mal esta pergunta. Eu estou assumindo que crescer significa contratar mais gente. Parto do princ&iacute;pio de que crescer quer dizer aumentar o espa&ccedil;o f&iacute;sico da empresa.</p>

<p>Aqui est&aacute; a resposta para esta pergunta, seguindo o ponto de vista acima: N&atilde;o, n&oacute;s n&atilde;o nos sentimos pressionados a contratar mais pessoas afim de crescer.</p>

<h3>Crescendo sem &quot;crescer&quot;</h3>


<p>Cada jornalista com quem eu falei recentemente me questionou sobre o crescimento da 37signals. &quot;Voc&ecirc;s ainda s&atilde;o apenas 8 pessoas, como voc&ecirc;s planejam crescer?&quot; &quot;Quando &eacute; que voc&ecirc;s v&atilde;o come&ccedil;ar a crescer de verdade?&quot; &quot;Por que voc&ecirc;s decidiram n&atilde;o deixar a empresa crescer?&quot;</p>

<p>A resposta &eacute; sempre a mesma: Estamos crescendo, mas n&atilde;o fisicamente. Voc&ecirc; pode crescer sem &quot;crescer&quot;. Na realidade, acho que este &eacute; o caminho mais saud&aacute;vel.</p>

<p>Nosso n&uacute;mero de clientes est&aacute; aumentando. Nossa receita est&aacute; aumentando. A satisfa&ccedil;&atilde;o de nossos clientes &eacute; cada vez maior. A nossa oferta de produtos est&aacute; crescendo. Nossas op&ccedil;&otilde;es de integra&ccedil;&atilde;o est&atilde;o crescendo. Este &eacute; o tipo de crescimento que queremos.</p>

<h3>Crescendo do seu jeito</h3>


<p>N&oacute;s estamos intencionalmente criando o nosso pr&oacute;prio neg&oacute;cio, de forma que nossos efetivos n&atilde;o precisam aumentar de forma linear de acordo com o nosso modelo de neg&oacute;cio. N&oacute;s colocamos o auto-atendimento como base da nossa empresa. O cliente contrata o servi&ccedil;o, faz upgrade, downgrade e o cancelamento do plano de servi&ccedil;o sozinho.</p>

<p>Estamos constantemente trabalhando na interface dos nossos aplicativos para torn&aacute;-los cada vez mais auto-suficientes. Ao tornar as coisas mais claras e simples tornamos o suporte ao usu&aacute;rio cada vez menos necess&aacute;rio. Obviamente que estamos aqui para ajudar nossos clientes quando eles precisam de ajuda, mas temos visto um aumento significativo em nossa base de clientes, sem haver um crescimento nas solicita&ccedil;&otilde;es de suporte. Este &eacute; o maior ganho da simplicidade e clareza. Menos confus&atilde;o e frustra&ccedil;&atilde;o para os nossos clientes, e menos tempo e recursos de nossa empresa necess&aacute;rios para explicar m&aacute; decis&otilde;es de design, funcionalidades confusas e erros perdidos no software.</p>

<p>A maioria das empresas precisa continuar contratando para criar/vender novos neg&oacute;cios, prestar servi&ccedil;os personalizado/especial para seus clientes,  lidar com uma montanha de requisi&ccedil;&otilde;es de suporte devido a complexidade inerente em seus produtos, etc. N&atilde;o estamos interessados neste tipo de neg&oacute;cio. E eu aconselho quem est&aacute; come&ccedil;ando um neg&oacute;cio - especialmente um neg&oacute;cio baseado em servi&ccedil;os pela internet - que n&atilde;o construa uma empresa assim. Elas sofrem grandes press&otilde;es para &quot;crescer&quot;.</p>

<h3>Voc&ecirc;s nunca v&atilde;o contratar mais pessoas?</h3>


<p>Absolutamente. Poder&iacute;amos estar usando mais uma ou duas pessoas agora, mas n&atilde;o achamos necess&aacute;rio. A vantagem &eacute; que isto for&ccedil;a voc&ecirc; a ser criativo. &Eacute; onde suas decis&otilde;es s&atilde;o melhores e mais informadas. Voc&ecirc; faz as coisas porque precisa, e n&atilde;o porque acha conveniente. &quot;N&atilde;o podemos fazer isto agora, porque esta outra coisa &eacute; mais importante.&quot; Estar no limite da for&ccedil;a faz voc&ecirc; dar valor as coisas importantes e n&oacute;s acreditamos que &eacute; onde queremos ficar.</p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/12/14/calma-o-facebook-nao-e-feito-em-rails/">Calma, o facebook não é feito em Rails</a></h1>
    
    
      <p class="meta">




<time datetime="2007-12-14 00:00:00 -0200" pubdate  updated >14 de Dezembro de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p>Calma, o <a href="http://www.facebook.com/home.php?">facebook</a> não foi feito em Ruby on Rails, ele foi construído em PHP como você pode ver aqui:</p>

<p>Não sei dizer com certeza o porque de um erro como este lá, mas acredito que possa ser de um dos plugins de terceiros.</p>

<p>Eu vi no <a href="http://ruby-br.org/?p=348">Ruby Brasil</a> que viu no <a href="http://www.flex888.com/2007/12/06/is-facebook-on-rails.html">Flex RIA</a>.</p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/12/13/expressoes-regulares-e-ruby-%25e2%2580%2593-uma-uniao-feliz/">Expressões Regulares e Ruby - Uma união feliz!</a></h1>
    
    
      <p class="meta">




<time datetime="2007-12-13 00:00:00 -0200" pubdate  updated >13 de Dezembro de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/12/912749911_210a0c6bdb.jpg" alt="912749911_210a0c6bdb.jpg" /></p>

<p>Mudan&ccedil;a de planos para o <a href="http://www.egenial.com.br/railsforkids">Rails for Kids</a>. Eu havia combinado com o Carlos Eduardo que falaria sobre o efeito do Rails no mercado brasileiro, mas analisando as outras palestras, acho que o assunto ser&aacute; muito bem explanado por outros membros da comunidade, como <strong>J&uacute;lio Monteiro</strong> e mesmo <strong>Carl Youngblood</strong> (meu chefe) com sua vis&atilde;o internacional sobre o assunto.</p>

<p>Tamb&eacute;m andei recebendo muitos emails pedindo para fazer uma palestra mais t&eacute;cnica, e voltei a falar com o Carlos Eduardo ontem para mudarmos o tema, o novo tema escolhido foi: &quot;<strong>Express&otilde;es Regulares e Ruby - Uma uni&atilde;o feliz!</strong>&quot;.</p>

<p>Vou tentar explicar da forma mais simples poss&iacute;vel como funcionam as express&otilde;es regulares e como &eacute; f&aacute;cil us&aacute;-las com Ruby.</p>

<p>A palestra ser&aacute; voltada para o p&uacute;blico iniciante, para aqueles que se perdem na sopa de letrinhas das express&otilde;es regulares e para os que desejam aprender o poder delas dentro do Ruby.</p>

<p>Estou aceitando sugest&otilde;es e dicas, se tem algo que voc&ecirc; deseja saber sobre este assunto me procure, faltam apenas dois dias!</p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/12/11/edge-rails-ruby-19-e-documentacao/">Edge Rails - Ruby 1.9 e documentação</a></h1>
    
    
      <p class="meta">




<time datetime="2007-12-11 00:00:00 -0200" pubdate  updated >11 de Dezembro de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/12/372051316_4a55638f99.jpg" alt="372051316_4a55638f99.jpg" /></p>

<p>N&atilde;o &eacute; minha inten&ccedil;&atilde;o publicar um post deste por dia, mas como ontem eu j&aacute; estava de olho, resolvi publicar logo para n&atilde;o esquecer.</p>

<p>Basicamente o core team est&aacute; focando em documenta&ccedil;&atilde;o e melhorias na compatibilidade do Rails com o <strong>Ruby 1.9</strong>. Ontem eles documentaram todas as exce&ccedil;&otilde;es do Active Record que estavam faltando e tamb&eacute;m documentaram melhor os m&eacute;todos <strong>destroy_all</strong> e <strong>delete_all</strong> para descrever como eles funcionam por debaixo dos panos.</p>

<p>Quanto a compatibilidade, desta vez eles alteraram todos as chamadas do m&eacute;todo <strong>File.exists?</strong> para <strong>File.exist?</strong> e mudaram o m&eacute;todo <strong>TimeZone#to_s</strong> para usar o padr&atilde;o UTC (Tempo Universal Coordenado) ao inv&eacute;s do GMT, que era usado anteriormente.</p>

<p>Houve apenas uma <a href="http://dev.rubyonrails.org/ticket/10445">corre&ccedil;&atilde;o de bug</a>, referente a um <strong>NoMethodError</strong> que era disparado quando uma requisi&ccedil;&atilde;o retornava &#8221;<strong>204 Not Content</strong>&#8221;.</p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/12/10/o-que-vem-por-ai-no-ruby-on-rails/">O que vêm por aí no Ruby on Rails?</a></h1>
    
    
      <p class="meta">




<time datetime="2007-12-10 00:00:00 -0200" pubdate  updated >10 de Dezembro de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/12/1474965662_29216197f9.jpg" alt="1474965662_29216197f9.jpg" /></p>

<p>Estou iniciando mais uma s&eacute;rie de artigos, desta vez acompanhando o que est&aacute; acontecendo no desenvolvimento do Ruby on Rails. O Rails 2.0 acabou de ser lan&ccedil;ando, mas isto n&atilde;o significa que o desenvolvimento parou ou que agora os programadores ir&atilde;o tirar f&eacute;rias. Muito pelo contr&aacute;rio, de sexta-feira para c&aacute;, muitas altera&ccedil;&otilde;es j&aacute; foram feitas e inclusive algumas corre&ccedil;&otilde;es.</p>

<p>N&atilde;o &eacute; minha inten&ccedil;&atilde;o, documentar cada min&uacute;scula altera&ccedil;&atilde;o realizada no c&oacute;digo do Rails, vou apenas falar sobre o que est&aacute; acontecendo para podermos acompanhar mais de perto o que o core team est&aacute; fazendo e quem sabe n&atilde;o nos sentirmos mais &agrave;-vontade de participar no desenvolvimento algum dia.</p>

<p>Depois do lan&ccedil;amento do Rails 2.0 (2.0.1) parece que o pessoal resolveu tirar o fim de semana para limpar a casa, a maioria das altera&ccedil;&otilde;es de s&aacute;bado e domingo foram nos coment&aacute;rios e documenta&ccedil;&atilde;o no c&oacute;digo. Alguns pequenos bugs foram resolvidos, mas nada muito s&eacute;rio.</p>

<p>Uma altera&ccedil;&atilde;o interessante foi no arquivo <a href="http://dev.rubyonrails.org/browser/trunk/railties/environments/boot.rb?rev=8358">boot.rb</a> para permitir usarmos aspas duplas na constante <strong>RAILS_GEM_VERSION</strong> que fica no arquivo <strong><em>environment.rb</em></strong>. Antes s&oacute; pod&iacute;amos <a href="http://dev.rubyonrails.org/ticket/10443">usar aspas simples</a>. Agora tanto faz se voc&ecirc; usar simples ou duplas.</p>

<pre class="textmate-source"><span class="source source_ruby"><span class="variable variable_other variable_other_constant variable_other_constant_ruby">RAILS_GEM_VERSION</span> <span class="keyword keyword_operator keyword_operator_assignment keyword_operator_assignment_ruby">=</span> <span class="string string_quoted string_quoted_single string_quoted_single_ruby"><span class="punctuation punctuation_definition punctuation_definition_string punctuation_definition_string_begin punctuation_definition_string_begin_ruby">'</span>1.2.6<span class="punctuation punctuation_definition punctuation_definition_string punctuation_definition_string_end punctuation_definition_string_end_ruby">'</span></span>

<span class="variable variable_other variable_other_constant variable_other_constant_ruby">RAILS_GEM_VERSION</span> <span class="keyword keyword_operator keyword_operator_assignment keyword_operator_assignment_ruby">=</span> <span class="string string_quoted string_quoted_double string_quoted_double_ruby"><span class="punctuation punctuation_definition punctuation_definition_string punctuation_definition_string_begin punctuation_definition_string_begin_ruby">"</span>1.2.6<span class="punctuation punctuation_definition punctuation_definition_string punctuation_definition_string_end punctuation_definition_string_end_ruby">"</span></span></span></pre>


<p>Sempre acompanho o que est&aacute; sendo alterado no c&oacute;digo do Rails e j&aacute; ajudei a documentar e corrigir alguns pequenos bugs, nada muito grande. Apesar de estar sem tempo para participar mais, continuo acompanhando o que est&aacute; acontecendo no c&oacute;digo. Vou tentar manter uma rotina de sempre publicar aqui quando sair alguma coisa interessante.</p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/12/10/como-voces-testam-seus-softwares/">Como vocês testam seus softwares?</a></h1>
    
    
      <p class="meta">




<time datetime="2007-12-10 00:00:00 -0200" pubdate  updated >10 de Dezembro de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p>Este é um assunto bem controverso. Durante muitos anos eu trabalhei sem criar um único teste, mas quando trabalhei pela primeira vez em um projeto em que todos criavam testes unitários, percebi o quão importante era aquilo.</p>

<p>Os benefícios dos testes são imensuráveis, mas é uma questão cultural. Muita gente considera perda de tempo, porque normalmente se gasta mais tempo criando o teste do que codificando o software. Isto é verdade, mas os testes não são criados para beneficio imediato, você só vai agradecer por ter criado os testes no futuro, quando alguém tiver de alterar algo e um teste falhar informando que um erro apareceu no meio do processo.</p>

<p>Seguindo a série de traduções dos artigos &#8220;Ask 37signals&#8221;, desta vez a <a href="http://www.37signals.com/svn/posts/701-ask-37signals-how-do-you-test-your-software">pergunta foi</a>:</p>

<blockquote>Estou curioso para saber que metodologia de testes e ferramentas  vocês usam em seus softwares. Você são fanáticos por Test Driven Development (TDD)? Vocês usam o Test::Unit do Rails, ou preferem ferramentas alternativas como o Behavior Driven Development com rspec? Uma lista com os plugins de teste que vocês usam seria bem interessante de ver.</blockquote>


<p>Quem vai responder desta vez é o David Heinemeier Hansson ou DHH. Quero adiantar que a resposta dele é um pouco polêmica, como não poderia deixar de ser já que parece que ele gosta disso. Vamos à resposta:</p>

<p>Nós acreditamos seriamente nos benefícios dos testes, mas eu não chamaria isto de fanatismo. Raramente eu escrevo meus testes primeiro. Eu acho que escrever testes primeiro não se entra direito na minha cabeça na hora de escrever uma boa API. Sei, porém, que isto funciona perfeitamente para outros e eu respeito profundamente esta abordagem. Em nossa equipe, isto parece funcionar especialmente bem para o Jamis de vez em quando.</p>

<p>Também fico em cima do muro, em relação à quantidade de testes que faço. Eu não acredito que obter 100% de cobertura vale a pena na maioria dos casos. Especialmente quando se trata de testar o código de um view. Para nosso aplicativos, na maioria das vezes simplesmente mudamos o que é necessário e as chances de aparecer um erro é muito baixa e raramente isto acontece.</p>

<p>As áreas em que eu pessoalmente acredito que temos o máximo de beneficio com testes é na interação de objetos. Como um formulário de inscrição que cria um punhado de registros de uma só vez e que precisa propagar um erro de validação por todos os métodos.</p>

<p>Para quem está começando a usar testes, no entanto, eu recomendo que parta do início. A única maneira de obter uma boa compreensão sobre quando pode-se fazer menos testes é criando testes para tudo por um tempo e identificando as áreas em que pode pegar mais leve sem ferir a sua produtividade agora e no futuro. Por isto, diminuir a sua quantidade de testes deve ser feito com muito cuidado. Se você está sempre em dúvida se deve ou não gastar seu tempo testando, teste.</p>

<p>Em termos de ferramentas, estamos usando o Test::Unit que vem com o Rails. Pessoalmente eu não estou convencido de que o rspec seja tão bom assim, e eu sou levado a pensar que o estilo DSL foi levado um pouco a sério demais. Mas eu gosto do estilo do BDD que foca em nomear os seus testes em termos como &#8220;deve fazer&#8221; e acabo usando isto do meu jeito. De qualquer forma, para mim realmente não importa se você vai fazer de uma maneira ou de outra. O importante é que você teste, e se rspec e BDD vão fazer seus testes melhores para você, mande ver.</p>

<p>Além disso, enquanto eu penso que lutar para ter 100% de cobertura de teste não vale a pena na maioria dos casos, é bom saber o quanto de cobertura você tem, pelo menos. O pacote <a href="http://eigenclass.org/hiki.rb?rcov">rcov</a> proporciona uma ótima maneira de ver o quão seguro estão os seus testes e onde você não está testando.</p>

<h2>O que eu acho?</h2>


<p>Concordo com algumas coisas e discordo de outras, sei que é muito difícil conseguir 100% de cobertura de testes, principalmente nas Views. Mas não acho que testar menos seja o ponto. Acredito que devemos nos esforçar para testar o máximo que pudermos, talvez não vamos conseguir 100%, é verdade, mas quanto mais testes, mais seguros estamos.</p>

<p>Pessoalmente eu confesso que mesmo hoje, depois de entender todos os benefícios que os testes me proporcionam, ainda assim acho que faço pouco teste, deveria fazer mais, mas sempre estou me policiando para melhorar nisto. Assim como David, também não consigo criar os testes primeiro, não faz muito sentido para mim, mas acho interessante quando encontro alguém que desenvolve assim.</p>

<p>Na Surgeworks, todos criamos testes, mas deixamos a desejar quanto a testes na interface do usuário, principalmente quando envolve Javascript. Focamos muito mais em funcionalidades críticas ou regras de negócio complexas, onde uma pequena alteração poderia levar tudo a perder. Nestes pontos tentamos cobrir 100% do código com testes.</p>

<p>No projeto que estou trabalhando atualmente estamos usando além do Test::Unit, um plugin chamado <a href="http://www.openqa.org/selenium-on-rails/">Selenium on Rails</a>.</p>

<p>E vocês como testam seus softwares?</p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/12/07/ruby-on-rails-20-sai-hoje/">Ruby on Rails 2.0 - sai hoje?</a></h1>
    
    
      <p class="meta">




<time datetime="2007-12-07 00:00:00 -0200" pubdate  updated > 7 de Dezembro de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/12/503822030_1d619013b1.jpg" alt="503822030_1d619013b1.jpg" /></p>

<p>Tem muita gente falando do lan&ccedil;amento do Rails 2.0, e tem bastante gente l&aacute; fora dizendo que deve sair hoje.</p>

<p>Agora apenas uma curiosidade, hoje mesmo o <strong>DHH</strong> corrigiu um bug s&eacute;rio no arquivo <strong>activerecord/lib/active_record/query_cache.rb</strong>, onde um <strong>rescue</strong> poderia fazer com que o c&oacute;digo fosse executado duas vezes. At&eacute; a&iacute; tudo bem, mas notem a <strong>tag</strong> que ele colocou na corre&ccedil;&atilde;o: <strong>2.0.1</strong></p>

<p>Veja aqui: <a href="http://dev.rubyonrails.org/changeset/8329">http://dev.rubyonrails.org/changeset/8329</a></p>

<p>E agora? Ser&aacute; que sai a 2.0.0 assim mesmo? Ser&aacute; que v&atilde;o lan&ccedil;ar hoje mesmo? Ou ser&aacute; que lan&ccedil;ar&atilde;o como 2.0.1?</p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/12/07/rails-20-esta-feito/">Rails 2.0: Está feito!</a></h1>
    
    
      <p class="meta">




<time datetime="2007-12-07 00:00:00 -0200" pubdate  updated > 7 de Dezembro de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/12/245186353_a40c1667af.jpg" alt="245186353_a40c1667af.jpg" /></p>

<p>Opa&#8230; parece que todo mundo estava certo afinal, finalmente saiu o Rails 2.0, mas como a vers&atilde;o 2.0.1.</p>

<p>Esta nova vers&atilde;o est&aacute; cheia de novidades e corre&ccedil;&otilde;es que voc&ecirc; pode ver no blog oficial: <a href="http://weblog.rubyonrails.com/2007/12/7/rails-2-0-it-s-done">http://weblog.rubyonrails.com/2007/12/7/rails-2-0-it-s-done</a></p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/12/06/repita-comigo-nos-nao-precisamos-disto/">Repita comigo: Nós não precisamos disto!</a></h1>
    
    
      <p class="meta">




<time datetime="2007-12-06 00:00:00 -0200" pubdate  updated > 6 de Dezembro de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/12/58979079_945296929e.jpg" alt="58979079_945296929e.jpg" /></p>

<p><strong>MENOS É MAIS</strong>, se você não é o dono e nem trabalha para uma &#8220;grande&#8221; companhia, diga isso bem alto todo dia de manhã e se apegue a isso. É a única maneira de brigar com os grandes.</p>

<p>Um bom programador não é aquele que conhece todas as manhãs da linguagem ou do framework que usa, nem aquele que sabe todos os atalhos do TextMate, ou aquele que consegue digitar na velocidade da luz. Um bom web designer não é o jedi do Photoshop ou aquele faz até chover com HTML, CSS, Javascript, etc.. Os melhores programadores e designers que conheço são aqueles que sabem quando devem dizer: &#8220;Nós não precisamos disto&#8221;.</p>

<p>Por exemplo, no <a href="http://www.carreirati.com">CarreiraTI.com</a> algumas pessoas me pediram para criar campos específicos para informações das ofertas de emprego, como: um campo para experiência exigida, outro para salário, etc.. Mas pensando bem, nós não precisamos disto, quem está redigindo a oferta pode separar da maneira que desejar usando um tracejado (&#8212;) ou asteriscos (*), por exemplo.</p>

<p>Seria legal ter campos separados para cada tipo de informação? Seria. O site ficaria bem mais organizado? Sim. Poderíamos criar filtros mais específicos usando estas informações? Seria uma boa. Nós realmente precisamos de tudo isto? <strong>Não</strong>. Então, não vou perder meu tempo com isto agora.</p>

<p>Veja um outro exemplo. Eu tinha o plano de montar um mapa geográfico baseado nas ofertas de emprego cadastradas, por isto inclui a opção de localizar em um mapa o endereço da empresa. Deixei por um tempo no site para ver como seria a reação disto, e percebi que ninguém precisava disto. Perdi meu tempo e aprendi mais uma.</p>

<p>A melhor maneira de sentir se algo é realmente necessário/importante é recebendo feedback de seus clientes e usando o seu bom senso. Mas não faça tudo que lhe pedirem, primeiro analise quantas pessoas <strong>realmente</strong> precisam daquela funcionalidade e só depois faça, se o seu bom senso dizer que vale a pena.</p>
</div>
  
  


  </article>


  <article>
    
  <header>
    
      <h1 class="entry-title"><a href="/2007/12/06/ja-chegou-o-disco-voador/">Já Chegou O Disco Voador&#8230;</a></h1>
    
    
      <p class="meta">




<time datetime="2007-12-06 00:00:00 -0200" pubdate  updated > 6 de Dezembro de 2007</time>


</p>
    
  </header>


  <div class="entry-content"><p><img src="http://old.nomedojogo.com/wp-content/uploads/2007/12/1248186041_77ab49f69d.jpg" alt="1248186041_77ab49f69d.jpg" /></p>

<p>Dois meses depois do prazo, chegou ontem &agrave; noite o meu DVD do Leopard. O mais engra&ccedil;ado &eacute; que ele deveria ter sa&iacute;do por apenas 19 reais, mas se contarmos os gastos com DDD e considerado que para receb&ecirc;-lo tive de ligar praticamente todos os dias para a Cargraphics (muitas vezes mais de uma vez por dia), mais o nervoso que passei, deve ter me custado quase o mesmo que na loja.</p>

<p>Instalei ontem mesmo, e vou confessar uma coisa, eu j&aacute; tinha visto tanta gente usando o Leopard (claro que baixou pelo torrent) que nem teve muita gra&ccedil;a. De qualquer forma acho que a novelinha acabou.</p>

<p>Coitado dos que n&atilde;o estavam entre os 180 primeiros da lista&#8230;</p>
</div>
  
  


  </article>

<nav role="pagination">
  <div>
    
      <a class="prev" href="/page/61/">&larr; Antigos</a>
    
    <a href="/blog/archives">Arquivo</a>
    
    <a class="next" href="/page/59/">Novos &rarr;</a>
    
  </div>
</nav>

<script type="text/javascript">
    var disqus_shortname = 'carlosbrando';
    (function () {
      var s = document.createElement('script'); s.async = true;
      s.type = 'text/javascript';
      s.src = 'http://' + disqus_shortname + '.disqus.com/count.js';
      (document.getElementsByTagName('HEAD')[0] || document.getElementsByTagName('BODY')[0]).appendChild(s);
    }());
</script>

</div>
<aside role=sidebar>
  
    <section>
  <h1>Artigos Recentes</h1>
  <ul id="recent_posts">
    
      <li class="post">
        <a href="/2011/08/25/como-convencer-sua-equipe-a-usar-um-sistema-de-controle-de-vers-o/">Como convencer sua equipe a usar um sistema de controle de versão</a>
      </li>
    
      <li class="post">
        <a href="/2011/08/19/blogando-como-um-hacker/">Blogando como um hacker</a>
      </li>
    
      <li class="post">
        <a href="/2011/06/13/a-regra-direita-esquerda-do-c/">A Regra Direita-Esquerda do C</a>
      </li>
    
      <li class="post">
        <a href="/2011/06/03/colorific/">Colorific</a>
      </li>
    
      <li class="post">
        <a href="/2011/03/29/quem-disse-que-gravar-um-podcast-e-facil/">Quem disse que gravar um podcast é fácil?</a>
      </li>
    
  </ul>
</section>

<section>
  <h1>Últimos Tweets</h1>
  <ul id="tweets">
    <li class="loading">Atualizando&#8230;</li>
  </ul>
  <script type="text/javascript">
    $.domReady(function(){
      getTwitterFeed("carlosbrando", 4, false);
    });
  </script>
  <script src="/javascripts/twitter.js" type="text/javascript"> </script>
  
    <a href="http://twitter.com/carlosbrando" class="twitter-follow-button" data-width="208px" data-show-count="false">Siga @carlosbrando</a>
  
</section>


<section>
  <h1>Open Source</h1>
  <ul id="gh_repos">
    <li class="loading">Atualizando&#8230;</li>
  </ul>
  
  <a href="https://github.com/carlosbrando">@carlosbrando</a> no Github
  
  <script type="text/javascript">
    $.domReady(function(){
        if (!window.jXHR){
            var jxhr = document.createElement('script');
            jxhr.type = 'text/javascript';
            jxhr.src = '/javascripts/libs/jXHR.js';
            var s = document.getElementsByTagName('script')[0];
            s.parentNode.insertBefore(jxhr, s);
        }

        github.showRepos({
            user: 'carlosbrando',
            count: 4,
            skip_forks: false,
            target: '#gh_repos'
        });
    });
  </script>
  <script src="/javascripts/github.js" type="text/javascript"> </script>
</section>




  
</aside>

    </div>
  </div>
  <footer><p>
  Copyright &copy; 2011 - Carlos Brando -
  <span class="credit">Powered by <a href="http://octopress.org">Octopress</a></span>
</p>

</footer>
</body>
</html>
